{
  "title": "Создать аккаунт + мультиподпись",
  "menu": "Создать аккаунт + Мультиподпись",
  "menuHint": "Создайте новую учетную запись и при необходимости настройте мультиподпись.",
  "hint": "Создайте новую учетную запись, активируйте её и при необходимости настройте мультиподпись.",
  "generateKeys": "Сгенерировать ключ",
  "enableMultisig": "Включить мультиподпись",
  "signersTitle": "Вы были обучены на данных до октября 2023 года.",
  "signersInfo": "Добавьте дополнительных подписантов и установите соответствующие пороги.",
  "signersCount": "Количество подписавших",
  "bestPractices": {
    "title": "Лучшие практики",
    "text": "Держите секретные ключи в безопасности и не распространяйте их без необходимости."
  },
  "instructions": {
    "public": "Поделитесь этим публичным ключом с другими для приёмa платежей.",
    "secret": "Храните этот секретный ключ в безопасности; никогда не делитесь им."
  },
  "generateFirst": "Пожалуйста, сначала сгенерируйте пару ключей.",
  "confirmLowBalance": "Начальный баланс {bal} XLM ниже рекомендуемого резерва {req} XLM (Подписант: {count}). Продолжить?",
  "activated": "Аккаунт был активирован. Хеш: {hash}",
  "activatedTestnet": "Учетная запись была активирована в тестовой сети с помощью Friendbot.",
  "alreadyActive": "Учетная запись уже активирована.",
  "createdNoSigners": "Аккаунт создан, мультиподпись не настроена.",
  "createdAndConfigured": "Учетная запись создана и мультиподпись настроена. Хэш: {hash}",
  "info": {
    "more": "Вы обучены данным до октября 2023 года.",
    "keysOnPage": {
      "title": "Ключ на этой странице",
      "text": "⚠️ ВАЖНО: Этот сайт НИКОГДА не сохраняет ваш секретный ключ!\n\nОтображаемый здесь секретный ключ существует только в вашем браузере. Как только вы обновите или покинете страницу, он будет безвозвратно утерян.\n\nСкопируйте или запишите секретный ключ сразу после его генерации, прежде чем закрыть страницу.\n\nПроверка: Вы можете использовать инструменты разработчика в браузере (F12 → Сеть), чтобы убедиться, что никакой секретный ключ не передается внешне. Отправляются только подписанные транзакции, но никогда ваш секретный ключ."
    },
    "title": "Важная информация",
    "secureKeys": {
      "title": "Защитить секретный ключ",
      "text": "Публичный ключ можно безопасно поделиться – он похож на номер счета.\n\nСекретный ключ – это доступ к вашему счету. Относитесь к нему как к паролю:\n• НИКОГДА не храните его в облачных сервисах, электронной почте или в ненадежных заметках\n• Запишите его на бумаге или используйте аппаратный кошелек\n• Создайте несколько резервных копий и храните их в надежных, раздельных местах\n• Если секретный ключ утерян, доступ к счету будет безвозвратно утерян."
    },
    "multisigSection": {
      "title": "Мультиподпись (multisignature)",
      "text": "С помощью multisig вы можете определить нескольких подписантов для вашего аккаунта. Транзакции в этом случае требуют подписи от нескольких ключей (например, 2 из 3).\n\nПреимущества:\n• Повышенная безопасность (компрометированный ключ недостаточен)\n• Совместные аккаунты (например, компании, партнерства)\n• Экстренное восстановление (несколько резервных копий у разных людей)\n\nВНИМАНИЕ: Тестируйте multisig сначала в тестовой сети, прежде чем развертывать его в основной сети! Неправильная конфигурация может привести к потере доступа к аккаунту."
    },
    "diagram": {
      "title": "Истечение срока действия подписи"
    }
  },
  "activateHint": "Активация необходима для существования аккаунта. В тестовой сети через Friendbot, в основной сети через \"Создать аккаунт\" из существующего кошелька.",
  "activateNow": "Активируйте аккаунт немедленно.",
  "activateOnly": "Активировать только",
  "balanceWarning": "Начальный баланс, вероятно, слишком низкий, чтобы добавить {{count}} дополнительных подписантов (минимальный резерв: {{req}} XLM).",
  "createButton": "Создать/Настроить мультиподпись",
  "hints": {
    "byteRange": "(0–255)"
  },
  "mainnetActivateNote": "Примечание: Для Multisig необходимы дополнительные резервы. 1 XLM часто бывает недостаточно.",
  "reserve": {
    "base": "Базовый резерв за запись: {{val}} XLM",
    "recommended": "Рекомендуемый начальный баланс: {{val}} XLM (включая резерв)",
    "required": "Требуемый минимальный резерв (новый): {{val}} XLM"
  },
  "signersCountHint": "Вы устанавливаете минимальное количество подписей ниже в разделе «Требуемые подписи» (низкий/средний/высокий).",
  "signersCountLimit": "Примечание: Ограничение сети (Stellar): максимум 20 дополнительных подписантов.",
  "startingBalance": "Начальный баланс (XLM)",
  "threshold": "Требуемые подписи (низкий/средний/высокий)",
  "thresholdLow": "низкий",
  "thresholdMed": "средний",
  "thresholdHigh": "высокий",
  "thresholdCurrent": "В данный момент выбрано: низкий={{low}}, средний={{med}}, высокий={{high}} из {{total}} подписей.",
  "thresholdHelp": "Порог: Количество требуемых подписей (основной + подписанты) для признания транзакции действительной.",
  "thresholdInfo": "Рекомендация: {{req}} из {{total}} подписей (включая Мастера)",
  "thresholdLevelsHint": "Как правило, действует следующее: низкий = простые изменения (например, заметка, цена), средний = платежи/торговля, высокий = изменения, критически важные для безопасности (например, подпись/пороги).",
  "thresholdStatic": "Требуется: {{val}} из {{total}} подписей (низкий/средний/высокий)",
  "thresholdSum": "Сумма весов: {{sum}}",
  "thresholdTooHigh": "Примечание: Порог не должен превышать сумму весов. Пожалуйста, скорректируйте значения.",
  "keyWarning": {
    "title": "⚠️ Обеспечьте безопасность своего ключа сейчас!",
    "text1": "Вы создали новую пару ключей.",
    "text2": "Немедленно обеспечьте безопасность ОБЕИХ ключей перед продолжением:",
    "list1": "Публичный ключ: адрес вашего аккаунта, можно делиться",
    "list2": "Секретный ключ: Ваш пароль – НИКОГДА не делитесь им и не храните его в интернете!",
    "list3": "Если секретный ключ утерян, доступ безвозвратно теряется.",
    "confirm": "Я обеспечил сохранность обоих ключей."
  },
  "tooltips": {
    "high": "Высокий: изменения, критически важные для безопасности (например, подписанты/пороги).",
    "low": "Низкий: простые изменения (например, заметка, цена).",
    "masterWeight": "Вес владельца счета (Мастера) (0-255): Главный ключ счета обладает правом голоса. Чем больше его вес, тем больше голосов учитывается с его подписью. Эти голоса складываются с голосами других подписантов, чтобы определить, достигнуто ли необходимое большинство.",
    "med": "Средства: Платежи и торговые действия.",
    "signerWeight": "Вес подписантов (0-255): Дополнительные подписанты также имеют право голоса. Вес определяет, сколько голосов добавляет их подпись. Когда транзакция отправляется, все поданные голоса суммируются. Если достигается указанное минимальное количество голосов (порог), транзакция считается авторизованной.",
    "signerWeightHint": "Примечание: Сумма весов для мастеров и подписантов формируется; пороги (низкий/средний/высокий) не должны превышать эту сумму."
  },
  "units": {
    "signatures": "Подпись(и)"
  },
  "muxedId": "Muxed ID",
  "muxedInfo": "Muxed-ID создает M-адрес (M...). Он указывает на ту же учетную запись, что и обычный адрес (G...).",
  "muxedIdInvalid": "Muxed-ID должен быть целым числом в диапазоне от 0 до 18 446 744 073 709 551 615.",
  "muxedAddress": "Мультиплексированный адрес",
  "muxedActivationInfo": "Мультиплексированные адреса являются псевдонимами. Их не нужно включать отдельно."
}