{
  "title": "Создать аккаунт + мультиподпись",
  "menu": "Создать аккаунт + Мультиподпись",
  "menuHint": "Создайте новый аккаунт и при желании настройте мультиподпись.",
  "hint": "Создайте новую учетную запись, активируйте её и при необходимости настройте мультиподпись.",
  "generateKeys": "Создать ключ",
  "enableMultisig": "Включить мультиподпись",
  "signersTitle": "Сигнальщик",
  "signersInfo": "Добавьте дополнительных подписантов и установите соответствующие пороги.",
  "signersCount": "Количество подписавших",
  "bestPractices": {
    "title": "Лучшие практики",
    "text": "Храните секретные ключи в безопасности и не распространяйте их без необходимости."
  },
  "instructions": {
    "public": "Поделитесь этим публичным ключом с другими для осуществления платежей.",
    "secret": "Храните этот секретный ключ в безопасности; никогда не делитесь им."
  },
  "generateFirst": "Пожалуйста, сначала сгенерируйте пару ключей.",
  "confirmLowBalance": "Начальный баланс в размере {bal} XLM ниже рекомендованного резерва в {req} XLM (Подписанты: {count}). Продолжить?",
  "activated": "Учетная запись была активирована. Хеш: {hash}",
  "activatedTestnet": "Аккаунт был активирован в тестовой сети через Friendbot.",
  "alreadyActive": "Учетная запись уже активирована.",
  "createdNoSigners": "Аккаунт создан, мультиподпись не настроена.",
  "createdAndConfigured": "Счет создан и многоподписная конфигурация настроена. Хэш: {hash}",
  "info": {
    "more": "Вы обучены на данных до октября 2023 года.",
    "keysOnPage": {
      "title": "Ключи на этой странице",
      "text": "⚠️ ВАЖНО: Этот сайт НИКОГДА не сохраняет ваш секретный ключ!\n\nСекретный ключ, отображаемый здесь, существует только в вашем браузере (lokal im Arbeitsspeicher). Как только вы перезагружаете или покидаете страницу, он теряется навсегда.\n\nСкопируйте или запишите секретный ключ сразу после его генерации, до закрытия страницы.\n\nПроверка: Вы можете убедиться, используя инструменты разработчика в браузере (F12 → Network), что никакой секретный ключ не передается внешне. Отправляются только подписанные транзакции, но никогда ваш секретный ключ."
    },
    "title": "Важная информация",
    "secureKeys": {
      "title": "Безопасный секретный ключ",
      "text": "Публичный ключ можно безопасно поделиться – он подобен номеру счета.\n\nСекретный ключ - это доступ к вашему счету. Обращайтесь с ним, как с паролем:\n• НИКОГДА не храните его в облачных сервисах, электронных письмах или небезопасных заметках\n• Запишите его на бумаге или используйте аппаратный кошелек\n• Сделайте несколько резервных копий и храните их в безопасных, отдельных местах\n• Если секретный ключ утерян, доступ к счету будет безвозвратно утерян"
    },
    "multisigSection": {
      "title": "Мультиподпись (Multisig)",
      "text": "С помощью multisig вы можете определить нескольких подписантов для вашего аккаунта. Транзакции тогда требуют подписей от нескольких ключей (z. B. 2 von 3).\n\nПреимущества:\n• Усиленная безопасность (ein kompromittierter Key reicht nicht)\n• Общие аккаунты (z. B. Firmen, Partnerschaften)\n• Аварийное восстановление (mehrere Backups bei verschiedenen Personen)\n\nВНИМАНИЕ: Сначала протестируйте multisig в тестовой сети, прежде чем развертывать его в основной сети! Некорректная конфигурация может привести к потере доступа к аккаунту."
    },
    "diagram": {
      "title": "Истечение срока действия подписи"
    }
  },
  "activateHint": "Активация необходима для существования учётной записи. В тестовой сети это происходит через Friendbot, а в основной сети - через \"Создать учётную запись\" из существующего кошелька.",
  "activateNow": "Активируйте аккаунт немедленно.",
  "activateOnly": "Просто активируй",
  "balanceWarning": "Начальный баланс, вероятно, слишком низкий, чтобы добавить {{count}} дополнительных подписантов (минимальный резерв: {{req}} XLM).",
  "createButton": "Создать / Настроить мультиподпись",
  "mainnetActivateNote": "Примечание: Для мультиподписи нужны дополнительные резервы. 1 XLM часто бывает недостаточно.",
  "reserve": {
    "base": "Базовый резерв за запись: {{val}} XLM",
    "recommended": "Рекомендуемый начальный баланс: {{val}} XLM (inkl. Puffer)",
    "required": "Требуемый минимальный резерв (neu): {{val}} XLM"
  },
  "signersCountLimit": "Примечание: Граница сети (Stellar): максимум 20 дополнительных подписантов.",
  "startingBalance": "Начальный баланс (XLM)",
  "keyWarning": {
    "title": "⚠️ Защитите ваш ключ сейчас!",
    "text1": "Вы создали новую пару ключей.",
    "text2": "Перед тем как продолжить, НЕМЕДЛЕННО обеспечьте безопасность ОБЕИХ ключей:",
    "list1": "Публичный ключ: адрес вашего аккаунта, можно поделиться.",
    "list2": "Секретный ключ: Ваш пароль – НИКОГДА не делитесь им и не храните его в интернете!",
    "list3": "Если секретный ключ утерян, доступ безвозвратно утрачивается.",
    "confirm": "У меня есть оба ключа."
  },
  "muxedId": "Информация об обучении актуальна до октября 2023 года.",
  "muxedInfo": "Muxed-ID используется для создания M-Address (M...). Он указывает на ту же учетную запись, что и регулярный адрес (G...).",
  "muxedIdInvalid": "Muxed-ID должен быть целым числом от 0 до 18,446,744,073,709,551,615.",
  "muxedAddress": "Мультиплексированный адрес",
  "muxedActivationInfo": "Мультиплексированные адреса являются псевдонимами адресов. Их не нужно активировать отдельно."
}
