{
  "pageTitle": "Глоссарий",
  "pageIntro": "Здесь вы найдете важные слова из мира блокчейн и сети Stellar. Все объяснено простыми словами.",
  "searchLabel": "Поисковый запрос",
  "searchPlaceholder": "Поиск термина (например, аккаунт, Muxed)",
  "searchHint": "Поиск находит слова и объяснения.",
  "noResults": "Нет совпадения.",
  "blockchain": {
    "title": "Блокчейн",
    "original": "Blockchain",
    "short": "Общедоступный цифровой реестр – многие компьютеры хранят одинаковые записи.",
    "desc": "Блокчейн похож на цифровую бухгалтерскую книгу. Многие компьютеры хранят одни и те же записи, что гарантирует невозможность тайного изменения данных."
  },
  "wallet": {
    "title": "Кошелек",
    "original": "Wallet",
    "short": "Цифровой кошелек, который управляет вашими ключами.",
    "desc": "Кошелек — это ваш цифровой кошелек. Он управляет ключами, необходимыми для доступа к вашему счету и отправки транзакций. Кошелек может быть программой, приложением или даже просто листом бумаги с вашим приватным ключом."
  },
  "account": {
    "title": "Учетная запись",
    "original": "Account",
    "short": "Учетная запись блокчейна может хранить активы и отправлять транзакции.",
    "desc": "Учетная запись - это место в блокчейне, где хранятся ваши активы. Учетная запись имеет публичный адрес, который начинается с буквы G. Несколько кошельков могут получить доступ к одной и той же учетной записи, если у них есть правильный ключ."
  },
  "addressG": {
    "title": "G-адрес",
    "original": "G Address",
    "short": "Публичный основной адрес Stellar-аккаунта (начинается с G).",
    "desc": "G-адрес является основным адресом счета Stellar. Он начинается с буквы G. Вы предоставляете его другим людям, чтобы они могли отправить вам что-то."
  },
  "publicKey": {
    "title": "Открытый ключ",
    "original": "Public Key",
    "short": "Адрес, который вы можете поделиться; обычно это G-адрес для Stellar.",
    "desc": "Открытый ключ — это адрес, который вы можете поделиться. В системе Stellar это G-адрес. Другие используют его, чтобы отправить вам деньги."
  },
  "privateKey": {
    "title": "Секретный ключ",
    "original": "Secret Key",
    "short": "Пароль от аккаунта — никогда не делитесь.",
    "desc": "Секретный ключ — это ваш пароль для аккаунта. Тот, у кого есть этот ключ, может управлять вашими деньгами. Никогда не делитесь им."
  },
  "addressFederation": {
    "title": "Адрес федерации",
    "original": "Federation Address",
    "short": "Краткий адрес, такой как электронная почта, указывает на G-адрес.",
    "desc": "Адрес федерации выглядит как электронная почта. Например: имя*домен.com. Этот короткий адрес указывает на обычный G-адрес. Его легче запомнить."
  },
  "addressMuxed": {
    "title": "Перемешанный аккаунт",
    "original": "Muxed Account",
    "short": "M-адрес с дополнительным идентификатором – использует общий базовый аккаунт.",
    "desc": "M-адрес указывает на существующую учетную запись в сети Stellar, но имеет дополнительный номер (ID). Это позволяет, например, различать нескольких людей или отделы под одним и тем же G-адресом. Технически деньги по-прежнему принадлежат основному аккаунту."
  },
  "multisig": {
    "title": "Мультиподпись",
    "original": "Multi‑Sig",
    "short": "Важные действия требуют больше, чем просто подпись.",
    "desc": "Multi-Sig обозначает несколько подписей. Важное действие требует более одного ключа. Например, и вы, и второй ключ должны согласиться, прежде чем что-то может быть отправлено. Это делает кражу более сложной."
  },
  "trustline": {
    "title": "Трастовая линия",
    "original": "Trustline",
    "short": "Согласие на владение токеном определённого эмитента.",
    "desc": "Трастовая линия (trustline) подобна выражению \"да, я принимаю этот токен\". Делая это, вы указываете, что ваш аккаунт готов удерживать определённый токен от конкретного эмитента. Без трастовой линии вы не можете получить этот токен.\n\nПример: трастовая линия обозначается как КОД:ЭМИТЕНТ. Для EURT от эмитента GDUKMGUGDZQK6Y... это будет EURT:GDUKMGUGDZQK6Y...."
  },
  "token": {
    "title": "Токен",
    "original": "Token",
    "short": "Цифровая единица – например, деньги, баллы или кредит.",
    "desc": "Токен — это цифровая единица на блокчейне. Токен может представлять деньги, баллы или кредиты за услугу."
  },
  "asset": {
    "title": "Актив",
    "original": "Asset",
    "short": "Токены на Stellar всегда связаны с эмитентом.",
    "desc": "В сети Stellar токен называется активом. Актив всегда связан с аккаунтом эмитента. Например, аккаунт может выпустить токен евро. Этот токен евро затем становится активом."
  },
  "xlm": {
    "title": "Вы прошли обучение на данных до октября 2023 года.",
    "original": "XLM",
    "short": "Родная валюта Stellar для сборов и активации.",
    "desc": "XLM является родной валютой платформы Stellar. Вам необходимы XLM для оплаты комиссий и создания нового аккаунта."
  },
  "mainnet": {
    "title": "Основная сеть (Mainnet)",
    "original": "Mainnet",
    "short": "Сеть Real Stellar с реальной ценностью.",
    "desc": "Настоящая сеть Stellar с реальной ценностью. Транзакции являются окончательными, а комиссии оплачиваются настоящими XLM."
  },
  "testnet": {
    "title": "Тестовая сеть",
    "original": "Testnet",
    "short": "Общественная учебная сеть без реальной ценности.",
    "desc": "Сеть публичной практики. Токены не имеют реальной ценности. Идеально для обучения и экспериментов без риска."
  },
  "memo": {
    "title": "Памятка",
    "original": "Memo",
    "short": "Краткое примечание в транзакции.",
    "desc": "Мемо - это небольшая заметка, которую можно отправить вместе с транзакцией. Часто биржа требует указать конкретное мемо, чтобы определить, кому принадлежат средства."
  },
  "transaction": {
    "title": "Транзакция",
    "original": "Transaction",
    "short": "Действие на блокчейне, например, платеж или линия доверия.",
    "desc": "Транзакция — это действие в блокчейне, такое как отправка денег или создание трастовой линии. Транзакция навсегда сохраняется после её подтверждения."
  },
  "fee": {
    "title": "Плата",
    "original": "Fee",
    "short": "Очень небольшая сумма за транзакцию.",
    "desc": "Плата представляет собой очень небольшую сумму, которую вы платите при каждой транзакции. Эти деньги идут в сеть. В Stellar комиссии очень маленькие."
  },
  "ledger": {
    "title": "Главная книга (Ledger)",
    "original": "Ledger",
    "short": "Цепочка подтвержденных данных и балансов счетов.",
    "desc": "Главная книга - это цепочка всех подтвержденных данных. Она показывает, какие счета имеют какое количество средств и какие транзакции имели место. Любой человек может проверить главную книгу."
  },
  "horizon": {
    "title": "Горизонт",
    "original": "Horizon",
    "short": "Сервис API, через который приложения взаимодействуют с сетью Stellar.",
    "desc": "Horizon — это сервис, через который программы взаимодействуют с блокчейном Stellar. Наш инструмент обращается к Horizon для получения данных о балансе счетов и транзакциях."
  },
  "anchor": {
    "title": "Анкер",
    "original": "Anchor",
    "short": "Компания, которая связывает фиатные деньги с Stellar.",
    "desc": "Якорь — это компания, которая соединяет реальные деньги, такие как евро или доллары, со Stellar. Например, вы отдаете якорю евро и взамен получаете токен евро на Stellar."
  },
  "exchange": {
    "title": "Фондовая биржа",
    "original": "Exchange",
    "short": "Место для покупки и продажи токенов.",
    "desc": "Биржа — это место, где можно покупать или продавать токены. На многих биржах требуется процедура KYC, которая является проверкой личности, прежде чем вы сможете вывести деньги в евро или франках."
  },
  "dex": {
    "title": "Дец",
    "original": "Decentralized Exchange",
    "short": "Децентрализованная биржа непосредственно на блокчейне.",
    "desc": "DEX означает Децентрализованная Биржа. Здесь люди торгуют напрямую друг с другом на блокчейне. Единого оператора нет. Stellar имеет встроенную децентрализованную биржу."
  },
  "liquidityPool": {
    "title": "Пул ликвидности",
    "original": "Liquidity Pool",
    "short": "Общий пул с двумя токенами для немедленного обмена.",
    "desc": "Ликвидный пул — это общий пул, содержащий два токена. Люди вносят оба токена в пул. Затем другие пользователи могут мгновенно обменивать эти токены. Взамен участники, предоставляющие ликвидность, зарабатывают небольшие комиссии."
  },
  "balanceClaimable": {
    "title": "Подлежащий востребованию баланс",
    "original": "Claimable Balance",
    "short": "Зарезервированные средства, которые вам еще предстоит принять.",
    "desc": "Испрашиваемый остаток - это деньги, которые уже зарезервированы для вас, но их все равно нужно запросить. Только после их принятия они поступят на ваш счет."
  },
  "protocolUpdate": {
    "title": "Обновление протокола",
    "original": "Protocol Update",
    "short": "Обновление правил сети.",
    "desc": "Обновление протокола — это усовершенствование правил в сети Stellar. Например, новые функции или изменения в области безопасности. Все узлы в сети должны использовать одинаковые правила."
  },
  "soroban": {
    "title": "Соробан",
    "original": "Soroban",
    "short": "Система смарт-контрактов Stellar.",
    "desc": "Soroban — это система смарт-контрактов Stellar. Смарт-контракт — это программный код на блокчейне. Код может самостоятельно проверять правила и инициировать действия без необходимости участия банка."
  },
  "missingKey": "Отсутствует ключ глоссария: {{detail}}",
  "multiSignature": {
    "title": "Мультиподпись (Multi-Signature)",
    "original": "Multi-Signature",
    "short": "Требуется несколько подписей; веса + порог определяют одобрение.",
    "desc": "В многоподписной системе необходимо, чтобы несколько ключей подписали действие, прежде чем оно станет действительным. Каждый подписант имеет вес, и сумма должна достигнуть необходимого порога. Это повышает безопасность, так как одного украденного ключа недостаточно."
  },
  "signer": {
    "title": "Подписавшаяся сторона (Signatory)",
    "original": "Signer",
    "short": "Открытый ключ с весом, часть конфигурации учетной записи.",
    "desc": "Подписант — это открытый ключ, который принадлежит аккаунту и имеет вес. Его подпись учитывается в достижении необходимого порога. Несколько подписантов могут совместно авторизовать транзакцию."
  },
  "thresholds": {
    "title": "Пороги (Thresholds)",
    "original": "Thresholds",
    "short": "Ограничения (low/med/high), которые определяют необходимую сумму веса.",
    "desc": "Пороговые значения определяют, сколько взвешенных подписей требуется для выполнения действий: низкий порог для простых операций, средний для платежей и высокий для критических изменений. Сумма весов подписантов должна достичь соответствующего порога."
  },
  "masterWeight": {
    "title": "Мастер вес (master_weight)",
    "original": "master_weight",
    "short": "Вес мастер-ключа; определяет, насколько сильно учитывается мастер-ключ.",
    "desc": "Мастер-вес — это вес основного ключа учетной записи. Высокий мастер-вес позволяет основному ключу подписывать множество действий самостоятельно; низкое значение требует дополнительных подписантов."
  },
  "accountConfig": {
    "title": "Конфигурация аккаунта (Account configuration)",
    "original": "Account Configuration",
    "short": "Взаимодействие подписантов и порогов определяет безопасность аккаунта.",
    "desc": "Конфигурация учетной записи определяет, какие подписанты существуют, с какими весами и какие пороги применяются. Изменения подписантов или порогов критически важны для безопасности, так как они определяют, сколько подписей требуется."
  },
  "horizonHistory": {
    "title": "История горизонта",
    "original": "Horizon history depth",
    "short": "Описывает, насколько далеко в историю уходит история транзакций, предоставляемая публичными серверами Horizon.",
    "desc": "Die von der Stellar Development Foundation betriebenen öffentlichen Horizon-Server (Mainnet und Testnet) stellen nur eine begrenzte Historie zur Verfügung – derzeit ungefähr ein Jahr rückwirkend. Ältere Daten sind über diese kostenlosen Endpunkte nicht mehr abrufbar. Wenn du weiter in die Vergangenheit zurück musst, hast du im Wesentlichen zwei Optionen: (1) du betreibst einen eigenen Horizon-Node mit vollständiger History (inklusive History Archives), oder (2) du nutzt Drittanbieter- bzw. Bezahldienste, die historische Stellar-Daten langfristig speichern und zur Verfügung stellen.",
    "seeAlso": "Я обучен на данных до октября 2023 года."
  }
}