{
  "pageTitle": "Глоссарий",
  "pageIntro": "Здесь вы найдете важные термины из мира блокчейн и сети Stellar. Все объяснено простыми словами.",
  "searchLabel": "Искать термин",
  "searchPlaceholder": "Поиск термина (например, учетная запись, аккаунт, мультиплексированный)",
  "searchHint": "Поиск находит слова и объяснения.",
  "noResults": "Совпадений не найдено.",
  "blockchain": {
    "title": "Блокчейн",
    "original": "Blockchain",
    "short": "Общая цифровая кассовая книга – многие компьютеры сохраняют одни и те же записи.",
    "desc": "Блокчейн подобен цифровой книге учёта. Многие компьютеры хранят одни и те же записи. Таким образом, никто не может тайно что-либо изменить."
  },
  "wallet": {
    "title": "Кошелек",
    "original": "Wallet",
    "short": "Цифровой кошелек, управляющий вашими ключами.",
    "desc": "Кошелек - это ваш цифровой бумажник. Он управляет ключами, которые необходимы для доступа к вашему счету и отправки транзакций. Кошелек может быть программой, приложением или даже просто листом бумаги с вашим секретным ключом."
  },
  "account": {
    "title": "Учетная запись",
    "original": "Account",
    "short": "Блокчейн-аккаунт может хранить активы и отправлять транзакции.",
    "desc": "Аккаунт — это место в блокчейне, где хранятся ваши ценности. Аккаунт имеет публичный адрес, который начинается с буквы G. Несколько кошельков могут получить доступ к одному и тому же аккаунту, если у них есть правильный ключ."
  },
  "addressG": {
    "title": "G-адрес",
    "original": "G Address",
    "short": "Основной публичный адрес Stellar-счёта (начинается с G).",
    "desc": "G-адрес — это основной адрес Stellar-аккаунта. Он начинается с буквы G. Вы предоставляете его другим людям, чтобы они могли отправить вам что-то."
  },
  "publicKey": {
    "title": "Открытый ключ",
    "original": "Public Key",
    "short": "Адрес, который можно поделиться; в Stellar это обычно адрес, начинающийся с G.",
    "desc": "Открытый ключ - это адрес, который вы можете показать. В Stellar это G-адрес. Другие используют его, чтобы отправить вам деньги."
  },
  "privateKey": {
    "title": "Секретный ключ",
    "original": "Secret Key",
    "short": "Пароль от учетной записи — никогда не передавайте.",
    "desc": "Секретный ключ - это ваш пароль к счету. Тот, кто обладает этим ключом, может распоряжаться вашими деньгами. Никогда не передавайте его другим."
  },
  "addressFederation": {
    "title": "Федеральный адрес",
    "original": "Federation Address",
    "short": "Короткий адрес, например, электронная почта, указывает на G-адрес.",
    "desc": "Федеративный адрес выглядит как электронная почта. Пример: имя*домен.com. Этот короткий адрес указывает на обычный G-адрес. Это проще запомнить."
  },
  "addressMuxed": {
    "title": "Muxed-счет",
    "original": "Muxed Account",
    "short": "М‑адрес с дополнительным идентификатором – делит базовый аккаунт.",
    "desc": "M-адрес указывает на существующий счет Stellar, но дополнительно имеет собственный номер (ID). Таким образом, можно, например, различать нескольких человек или отделы под одним и тем же G-адресом. Технически деньги по-прежнему принадлежат основному счету."
  },
  "multisig": {
    "title": "Мультиподпись",
    "original": "Multi‑Sig",
    "short": "Важные действия требуют большего, чем просто подпись.",
    "desc": "Multi-Sig обозначает использование нескольких подписей. Для выполнения важного действия требуется более одного ключа. Например, ты и второй ключ должны оба согласиться, прежде чем что-то будет отправлено. Это усложняет кражу."
  },
  "trustline": {
    "title": "Трастлайн",
    "original": "Trustline",
    "short": "Согласие на удержание токена определенного эмитента.",
    "desc": "Трастлайн — это как \"Да, я принимаю этот токен\". Таким образом, вы заявляете, что ваш аккаунт готов держать определенный токен от определенного эмитента. Без трастлайна вы не сможете получить этот токен.\n\nПример: Трастлайн обозначается как CODE:ISSUER. Для EURT от эмитента GDUKMGUGDZQK6Y… он выглядит как EURT:GDUKMGUGDZQK6Y…"
  },
  "token": {
    "title": "Токен",
    "original": "Token",
    "short": "Цифровая единица – например, деньги, баллы или кредит.",
    "desc": "Токен — это цифровая единица в блокчейне. Токен может представлять собой деньги, очки или баланс для какой-либо услуги."
  },
  "asset": {
    "title": "Актив",
    "original": "Asset",
    "short": "Токен на Stellar всегда связан с эмитентом.",
    "desc": "В Stellar токен называется активом. Актив всегда связан с учетной записью эмитента. Например, одна учетная запись может выпустить токен в евро. Этот токен евро затем становится активом."
  },
  "xlm": {
    "title": "Вы обучены на данных по октябрь 2023 года.",
    "original": "XLM",
    "short": "Нативная валюта Stellar для комиссий и активации.",
    "desc": "XLM является основной валютой Stellar. Вам нужны XLM для оплаты комиссий и открытия нового счета."
  },
  "mainnet": {
    "title": "Основная сеть",
    "original": "Mainnet",
    "short": "Настоящая Stellar‑сеть с реальной ценностью.",
    "desc": "Настоящая сеть Stellar с реальной стоимостью. Транзакции являются окончательными, и комиссии оплачиваются в настоящих XLM."
  },
  "testnet": {
    "title": "Тестовая сеть",
    "original": "Testnet",
    "short": "Общедоступная тренировочная сеть без реальной ценности.",
    "desc": "Публичная тренировочная сеть. Токены не имеют реальной стоимости. Идеально для обучения и экспериментов без риска."
  },
  "memo": {
    "title": "Служебная записка",
    "original": "Memo",
    "short": "Краткая заметка в транзакции.",
    "desc": "Мемо - это небольшая заметка, которую вы можете отправить вместе с транзакцией. Часто биржа требует указать определенное мемо, чтобы понять, кому принадлежат деньги."
  },
  "transaction": {
    "title": "Транзакция",
    "original": "Transaction",
    "short": "Действие на блокчейне, например, платеж или доверенная линия.",
    "desc": "Транзакция – это действие в блокчейне. Например, отправка денег или создание доверительной линии. Транзакция сохраняется навсегда, если она подтверждена."
  },
  "fee": {
    "title": "Плата",
    "original": "Fee",
    "short": "Очень небольшая сумма за транзакцию.",
    "desc": "Комиссия - это очень небольшая сумма, которую вы платите при каждой транзакции. Комиссия идет в сеть. В Stellar комиссии очень малы."
  },
  "ledger": {
    "title": "Главная книга",
    "original": "Ledger",
    "short": "Цепочка подтвержденных данных и балансов.",
    "desc": "Ledger - это цепочка всех подтвержденных данных. Там указано, сколько находится на каждом счете и какие транзакции произошли. Каждый может проверить Ledger."
  },
  "horizon": {
    "title": "Горизонт",
    "original": "Horizon",
    "short": "Служба API, через которую приложения взаимодействуют с Stellar.",
    "desc": "Horizon — это сервис, через который программы взаимодействуют с блокчейном Stellar. Наш инструмент запрашивает у Horizon данные о балансах счетов и транзакциях."
  },
  "anchor": {
    "title": "Я обучен на данных до октября 2023 года.",
    "original": "Anchor",
    "short": "Компания, которая соединяет фиатные деньги с сетью Stellar.",
    "desc": "Анкор - это компания, которая связывает реальные деньги, такие как евро или доллары, со Stellar. Вы даете анкору, например, евро, и за это получаете токен евро на платформе Stellar."
  },
  "exchange": {
    "title": "Фондовая биржа",
    "original": "Exchange",
    "short": "Место для покупки и продажи токенов.",
    "desc": "Биржа — это место, где можно покупать или продавать токены. Многие биржи требуют процедуру KYC, то есть проверку удостоверения личности, прежде чем вы сможете вывести деньги в евро или франках."
  },
  "dex": {
    "title": "Вы обучены на данных до октября 2023 года.",
    "original": "Decentralized Exchange",
    "short": "Децентрализованная биржа непосредственно на блокчейне.",
    "desc": "DEX означает децентрализованная биржа. Здесь люди торгуют напрямую друг с другом на блокчейне. Единого оператора нет. В Stellar децентрализованная биржа встроена напрямую."
  },
  "liquidityPool": {
    "title": "Пул ликвидности",
    "original": "Liquidity Pool",
    "short": "Общий пул с двумя токенами для немедленного обмена.",
    "desc": "Ликвидный пул - это общий резервуар с двумя токенами. Люди вносят оба токена в этот пул. Другие могут мгновенно обменивать эти токены. Вкладчики за это зарабатывают небольшие комиссии."
  },
  "balanceClaimable": {
    "title": "Доступный баланс для предъявления",
    "original": "Claimable Balance",
    "short": "Зарезервированные средства, которые ты еще должен принять.",
    "desc": "Claimable Balance - это деньги, которые уже зарезервированы для вас, но вы должны их забрать. Только когда вы их примете, они поступят на ваш счет."
  },
  "protocolUpdate": {
    "title": "Обновление протокола",
    "original": "Protocol Update",
    "short": "Обновление сетевых правил.",
    "desc": "Обновление протокола – это апгрейд правил в сети Stellar, например, новые функции или изменения безопасности. Все узлы в сети должны использовать одни и те же правила."
  },
  "soroban": {
    "title": "Соробан",
    "original": "Soroban",
    "short": "Система смарт-контрактов Stellars.",
    "desc": "Соробан - это система смарт-контрактов на платформе Stellar. Смарт-контракт - это программный код на блокчейне. Этот код может самостоятельно проверять правила и выполнять действия без участия банка."
  },
  "missingKey": "Отсутствующий ключ глоссария: {{detail}}"
}