{
  "pageTitle": "Глоссарий",
  "pageIntro": "Здесь вы найдете важные термины из мира блокчейна и сети Stellar. Все объясняется простыми словами.",
  "searchLabel": "Поисковый запрос",
  "searchPlaceholder": "Поисковый запрос (z. B. Konto, Account, Muxed)",
  "searchHint": "Поиск находит слова и объяснения.",
  "noResults": "Нет совпадения.",
  "blockchain": {
    "title": "Блокчейн",
    "original": "Blockchain",
    "short": "Gemeinsames digitales Kassenbuch – viele Computer speichern die gleichen Einträge.",
    "desc": "Блокчейн подобен цифровой книге учета. Многие компьютеры хранят одинаковые записи, поэтому никто не может тайно что-либо изменить."
  },
  "wallet": {
    "title": "Кошелек",
    "original": "Wallet",
    "short": "Цифровой кошелек, управляющий вашими ключами.",
    "desc": "Кошелек — это ваш цифровой кошелек. Он управляет ключами, необходимыми для доступа к вашему аккаунту и отправки транзакций. Кошелек может быть программой, приложением или даже просто листком бумаги с вашим приватным ключом."
  },
  "account": {
    "title": "Учетная запись",
    "original": "Account",
    "short": "Учетная запись в блокчейне может содержать активы и отправлять транзакции.",
    "desc": "Учётная запись - это место в блокчейне, где хранятся ваши активы. Учётная запись имеет публичный адрес, который начинается с G. Несколько кошельков могут получить доступ к одной и той же учётной записи, если у них есть правильный ключ."
  },
  "addressG": {
    "title": "G-адрес",
    "original": "G Address",
    "short": "Публичный ключ (beginnt mit G) учётной записи Stellar.",
    "desc": "G-адрес является основным адресом Stellar-аккаунта. Он начинается с буквы G. Вы предоставляете его другим, чтобы они могли отправить вам что-либо."
  },
  "publicKey": {
    "title": "Открытый ключ",
    "original": "Public Key",
    "short": "Adresse, die du teilen darfst; bei Stellar meist die G‑Adresse.",
    "desc": "Публичный ключ — это адрес, который можно делиться. В системе Stellar это G-адрес. Другие используют его, чтобы отправлять вам деньги."
  },
  "privateKey": {
    "title": "Секретный ключ",
    "original": "Secret Key",
    "short": "Пароль от аккаунта – никогда не делитесь им.",
    "desc": "Секретный ключ — это ваш пароль для доступа к аккаунту. Любой, у кого есть этот ключ, может перемещать ваши деньги. Никогда не делитесь им."
  },
  "addressFederation": {
    "title": "Адрес федерации",
    "original": "Federation Address",
    "short": "Kurze Adresse wie E‑Mail, zeigt auf eine G‑Adresse.",
    "desc": "Федеративный адрес выглядит как электронная почта. Пример: имя*домен.com. Этот короткий адрес указывает на обычный G-адрес. Его легче запомнить."
  },
  "addressMuxed": {
    "title": "Мультиплексированный аккаунт",
    "original": "Muxed Account",
    "short": "M‑адрес с дополнительным идентификатором – использует общий базовый счёт.",
    "desc": "Адрес M указывает на существующую учетную запись в Stellar, но имеет дополнительный уникальный идентификатор (ID). Это позволяет, например, различать нескольких людей или отделы под одним и тем же G-адресом. Технически средства все еще принадлежат основной учетной записи."
  },
  "multisig": {
    "title": "Мультиподпись",
    "original": "Multi‑Sig",
    "short": "Важные действия требуют больше, чем просто подпись.",
    "desc": "Multi-Sig означает несколько подписей. Для важного действия требуется более одного ключа. Например, вы и второй ключ должны оба согласиться, прежде чем что-то можно будет отправить. Это делает кражу более затруднительной."
  },
  "trustline": {
    "title": "Кредитная линия",
    "original": "Trustline",
    "short": "Соглашение о владении токеном от конкретного эмитента.",
    "desc": "Трастовая линия похожа на выражение согласия: да, я принимаю этот токен. Делая это, вы указываете, что ваш аккаунт готов принять определённый токен от конкретного эмитента. Без трастовой линии вы не сможете получить этот токен.\n\nПример: Трастовая линия указывается как КОД:ЭМИТЕНТ. Например, для EURT от эмитента GDUKMGUGDZQK6Y… это будет EURT:GDUKMGUGDZQK6Y…"
  },
  "token": {
    "title": "Токен",
    "original": "Token",
    "short": "Цифровая единица – например, деньги, баллы или кредиты.",
    "desc": "Токен — это цифровая единица на блокчейне. Токен может представлять собой деньги, очки или кредит на услугу."
  },
  "asset": {
    "title": "Актив",
    "original": "Asset",
    "short": "Токены на платформе Stellar всегда связаны с эмитентом.",
    "desc": "В системе Stellar токен называется активом. Актив всегда связан с аккаунтом-эмитентом. Например, аккаунт может выпустить токен в евро. Этот токен в евро будет считаться активом."
  },
  "xlm": {
    "title": "XLM (Stellar Lumens)",
    "original": "XLM",
    "short": "Нативная валюта Stellar для комиссии и активации.",
    "desc": "XLM является родной валютой Stellar. Вам необходим XLM для оплаты комиссий и создания нового аккаунта."
  },
  "mainnet": {
    "title": "Основная сеть",
    "original": "Mainnet",
    "short": "Echtes Stellar‑Netzwerk mit realem Wert.",
    "desc": "Настоящая сеть Stellar с реальной ценностью. Транзакции окончательные, и комиссии оплачиваются в реальных XLM."
  },
  "testnet": {
    "title": "Тестовая сеть",
    "original": "Testnet",
    "short": "Сеть общественной практики без реальной ценности.",
    "desc": "Сеть для публичной практики. Токены не имеют реальной ценности. Идеально для обучения и экспериментов без риска."
  },
  "memo": {
    "title": "Памятка",
    "original": "Memo",
    "short": "Краткое примечание в транзакции.",
    "desc": "Мемо - это небольшая записка, которую можно отправить вместе с транзакцией. Часто обмен требует указания конкретного мемо, чтобы определить, кому принадлежат деньги."
  },
  "transaction": {
    "title": "Транзакция",
    "original": "Transaction",
    "short": "Действие на блокчейне, например, платеж или кредитная линия.",
    "desc": "Транзакция — это действие в блокчейне, такое как отправка денег или установление доверительной линии. Транзакция сохраняется на постоянной основе после ее подтверждения."
  },
  "fee": {
    "title": "Плата",
    "original": "Fee",
    "short": "Очень маленькая сумма за транзакцию.",
    "desc": "Комиссия представляет собой очень небольшую сумму, которую вы платите при каждой транзакции. Комиссия идет сети. На платформе Stellar комиссии очень маленькие."
  },
  "ledger": {
    "title": "Главная книга",
    "original": "Ledger",
    "short": "Цепочка подтвержденных данных и остатков на счетах.",
    "desc": "Главная книга представляет собой цепочку всех подтвержденных данных. Она показывает, какие счета владеют какими суммами и какие транзакции произошли. Каждый может проверить главную книгу."
  },
  "horizon": {
    "title": "Горизонт",
    "original": "Horizon",
    "short": "API‑Dienst, über den Apps mit Stellar sprechen.",
    "desc": "Horizon — это сервис, через который программы взаимодействуют с блокчейном Stellar. Наш инструмент отправляет запросы к Horizon для загрузки балансов счетов и транзакций."
  },
  "horizonHistory": {
    "title": "Горизонт Истории",
    "original": "Horizon history depth",
    "short": "Описывает, насколько далеко простирается история транзакций, предоставляемая публичными серверами Horizon.",
    "desc": "Die von der Stellar Development Foundation betriebenen öffentlichen Horizon-Server (Mainnet und Testnet) stellen nur eine begrenzte Historie zur Verfügung – derzeit ungefähr ein Jahr rückwirkend. Ältere Daten sind über diese kostenlosen Endpunkte nicht mehr abrufbar. Wenn du weiter in die Vergangenheit zurück musst, hast du im Wesentlichen zwei Optionen: (1) du betreibst einen eigenen Horizon-Node mit vollständiger History (inklusive History Archives), oder (2) du nutzt Drittanbieter- bzw. Bezahldienste, die historische Stellar-Daten langfristig speichern und zur Verfügung stellen.",
    "seeAlso": "Вы обучены данным до октября 2023 года."
  },
  "anchor": {
    "title": "Якорь",
    "original": "Anchor",
    "short": "Firma, die Fiat‑Geld mit Stellar verbindet.",
    "desc": "Анкер — это компания, которая соединяет реальные деньги, такие как евро или доллары, с сетью Stellar. Например, вы отдаёте анкеру евро и получаете взамен токен в евро на платформе Stellar."
  },
  "exchange": {
    "title": "Биржа",
    "original": "Exchange",
    "short": "Место для покупки и продажи токенов.",
    "desc": "Биржа — это место, где вы можете покупать или продавать токены. Многие биржи требуют прохождения процесса KYC (идентификация личности) перед тем, как вы сможете вывести деньги в евро или франках."
  },
  "dex": {
    "title": "DEX (децентрализованная биржа)",
    "original": "Decentralized Exchange",
    "short": "Децентрализованная биржа непосредственно на блокчейне.",
    "desc": "DEX означает Децентрализованная Биржа. Здесь люди обмениваются друг с другом напрямую на блокчейне. Единого оператора нет. Stellar имеет встроенную децентрализованную биржу."
  },
  "liquidityPool": {
    "title": "Пул ликвидности",
    "original": "Liquidity Pool",
    "short": "Совместный пул с двумя токенами для немедленного обмена.",
    "desc": "Пул ликвидности представляет собой общий пул, содержащий два токена. Люди вносят в него оба токена. Другие могут сразу обменять эти токены. Депозиторы зарабатывают небольшие комиссии за эту услугу."
  },
  "balanceClaimable": {
    "title": "Требуемый баланс",
    "original": "Claimable Balance",
    "short": "Зарезервированные деньги, которые вам ещё нужно принять.",
    "desc": "Запрашиваемый остаток — это деньги, которые уже были зарезервированы для вас, но которые вам все еще нужно запросить. Только когда вы их принимаете, они попадают на ваш счет."
  },
  "protocolUpdate": {
    "title": "Обновление протокола",
    "original": "Protocol Update",
    "short": "Aktualisierung der Netzwerk‑Regeln.",
    "desc": "Обновление протокола — это усовершенствование правил в сети Stellar, такое как новые возможности или изменения в области безопасности. Все узлы в сети должны использовать одни и те же правила."
  },
  "soroban": {
    "title": "Соробан",
    "original": "Soroban",
    "short": "Stellars Smart‑Contract‑System.",
    "desc": "Soroban — это система смарт-контрактов Stellar. Смарт-контракт — это программный код на блокчейне. Код может самостоятельно проверять правила и инициировать действия без участия посредника, такого как банк."
  },
  "multiSignature": {
    "title": "Мультиподпись (Multi-Signature)",
    "original": "Multi-Signature",
    "short": "Multiple signatures required; weights + threshold determine the release.",
    "desc": "В мультиподписной настройке необходимо, чтобы несколько ключей подписали действие, прежде чем оно станет действительным. У каждого подписанта есть вес, и сумма должна достичь необходимого порога. Это повышает безопасность, так как один украденный ключ недостаточен."
  },
  "signer": {
    "title": "Подписант (Signer)",
    "original": "Signer",
    "short": "Открытый ключ с весом, являющийся частью конфигурации учетной записи.",
    "desc": "Подписант - это открытый ключ, который принадлежит учетной записи и имеет вес. Его подпись учитывается для достижения необходимого порога. Несколько подписантов могут совместно авторизовать транзакцию."
  },
  "thresholds": {
    "title": "Пороговые значения (Thresholds)",
    "original": "Thresholds",
    "short": "Ограничения (low/med/high), которые определяют необходимую сумму весов.",
    "desc": "Пороги определяют, сколько взвешенных подписей необходимо для выполнения действий: низкий порог для простых операций, средний для платежей, высокий для критических изменений. Сумма весов подписантов должна соответствовать соответствующему порогу."
  },
  "masterWeight": {
    "title": "Мастер вес (master_weight)",
    "original": "master_weight",
    "short": "Вес главного ключа; управляет значимостью основного ключа.",
    "desc": "Мастер-вес — это вес главного ключа учетной записи. Высокий мастер-вес позволяет главному ключу самостоятельно подписывать множество действий; низкое значение требует дополнительных подписантов."
  },
  "accountConfig": {
    "title": "Конфигурация учетной записи (Account Configuration)",
    "original": "Account Configuration",
    "short": "Взаимодействие подписантов и порогов определяет безопасность учетной записи.",
    "desc": "Конфигурация учетной записи указывает, какие подписанты существуют с каким весом и какие пороги применяются. Изменения подписантов или порогов критически важны для безопасности, поскольку они определяют, сколько подписей требуется."
  },
  "missingKey": "Отсутствует ключ глоссария: {{detail}}"
}