{
  "pageTitle": "Глоссарий",
  "pageIntro": "Здесь вы найдете важные термины из мира блокчейна и сети Stellar. Все объясняется простыми словами.",
  "searchLabel": "Поисковый запрос",
  "searchPlaceholder": "Поисковый запрос (z. B. Konto, Account, Muxed)",
  "searchHint": "Поиск находит слова и объяснения.",
  "noResults": "Нет совпадения.",
  "groups": {
    "accountsKeys": "Accounts & Keys",
    "multisigSecurity": "Multisig & Account Security",
    "walletsCustody": "Wallets & Custody",
    "tokensAssets": "Token & Assets",
    "transactionsFees": "Transactions & Fees",
    "marketsTrading": "Markets & Trading",
    "networkProtocol": "Network & Protocol",
    "smartContracts": "Умные контракты",
    "blockchainBasics": "Основы блокчейна",
    "security": "Security & Fraud"
  },
  "blockchain": {
    "title": "Блокчейн",
    "original": "Blockchain",
    "short": "Общий цифровой регистр – многие компьютеры хранят одни и те же записи.",
    "desc": "Блокчейн подобен цифровой книге учета. Многие компьютеры хранят одни и те же записи, что гарантирует невозможность тайного внесения изменений."
  },
  "wallet": {
    "title": "Кошелёк",
    "original": "Wallet",
    "short": "Цифровой кошелек, который управляет вашими ключами.",
    "desc": "Кошелек – это ваш цифровой бумажник. Он управляет ключами, которые вам нужны для доступа к вашему аккаунту и отправки транзакций. Кошелек может быть программой, приложением или даже просто листом бумаги с вашим приватным ключом."
  },
  "account": {
    "title": "Учетная запись",
    "original": "Account",
    "short": "Блокчейн-аккаунт может хранить активы и отправлять транзакции.",
    "desc": "Учётная запись - это место на блокчейне, где хранятся ваши активы. Учётная запись имеет публичный адрес, который начинается с буквы G. Несколько кошельков могут получить доступ к одной и той же учётной записи, если у них есть правильный ключ."
  },
  "addressG": {
    "title": "Извините, я не могу предоставить эту информацию.",
    "original": "G Address",
    "short": "Публичный первичный адрес аккаунта Stellar (beginnt mit G).",
    "desc": "G-адрес является основным адресом аккаунта Stellar. Он начинается с буквы G. Вы предоставляете его другим, чтобы они могли отправить вам что-либо."
  },
  "publicKey": {
    "title": "Публичный ключ",
    "original": "Public Key",
    "short": "Adresse, die du teilen darfst; bei Stellar meist die G‑Adresse.",
    "desc": "Публичный ключ — это адрес, который вы можете делиться с другими. В Stellar это адрес, начинающийся с буквы \"G\". Другие использует его, чтобы отправлять вам деньги."
  },
  "privateKey": {
    "title": "Секретный ключ",
    "original": "Secret Key",
    "short": "Пароль от аккаунта – никогда не делитесь им.",
    "desc": "Секретный ключ — это ваш пароль от аккаунта. Кто имеет этот ключ, может распоряжаться вашими деньгами. Никогда не делитесь им."
  },
  "addressFederation": {
    "title": "Адрес федерации",
    "original": "Federation Address",
    "short": "Короткий адрес, как E‑Mail, указывает на G‑адрес.",
    "desc": "Адрес федерации выглядит как электронная почта. Пример: name*domain.com. Этот короткий адрес указывает на обычный G-адрес. Его легче запомнить."
  },
  "addressMuxed": {
    "title": "Мультиплексированный аккаунт",
    "original": "Muxed Account",
    "short": "M‑адрес с дополнительным идентификатором – делится базовым счетом.",
    "desc": "M-адрес указывает на существующий аккаунт в сети Stellar, но имеет дополнительный номер (ID).\n\nМультиплексированные аккаунты = G-аккаунт + ID (M-Adresse)\nОни обеспечивают ассоциацию, но не разделение аккаунтов.\nБаланс, линии доверия, подписанты и флаги всегда находятся на G-аккаунте.\n\nФонд развития Stellar\n\nНапример, несколько человек или подразделений можно различать под одним и тем же G-адресом. Технически деньги по-прежнему принадлежат основному аккаунту."
  },
  "muxedAccountsUseCases": {
    "title": "Сценарии использования для мультиплексированных (Muxed) счетов",
    "original": "Muxed accounts use cases",
    "short": "Примеры, преимущества и ограничения M-адресов как средства картографирования.",
    "desc": "Компания - Example\n\nНастройка:\n- Корпоративный G-аккаунт\n- Один M-адрес на клиента/случай использования (ID)\n\nПроцесс:\n- Клиент платит на свой M-адрес\n- Всё идёт на корпоративный G-аккаунт\n- Бухгалтерия считывает ID -> уникальное распределение\n\nПодходит для:\n- Магазинов, поставщиков платежей, бирж\n- Внутренних ссылок без риска ошибок в мемо\n\nАссоциация - Example\n\nНастройка:\n- Ассоциативный G-аккаунт\n- M-адреса для членов, отделов, целей\n\nПроцесс:\n- Взносы/пожертвования на соответствующий M-адрес\n- Распределение через ID, без ошибок в мемо\n\nПодходит для:\n- Членских взносов\n- Целевых доходов\n- Упрощённого аудита\n\nЧем хороши мультиаккаунты:\n- Надёжное распределение входных средств\n- Один аккаунт, много идентичностей\n- Нет необходимости в мемо\n- Меньше операционных ошибок\n\nЧем не являются мультиаккаунты:\n- Не являются суб-счетами\n- Нет индивидуального баланса\n- Нет индивидуальных доверительных линий\n- Нет индивидуальных подписантов/прав\n\nОбычно неподходящие случаи использования:\n- Выплаты зарплаты (benoetigen eigenes G-Konto)\n- Доверительное управление/эскроу для третьих лиц (kein rechtlicher Vermoegenstrenner)\n- Безопасность, основанная на ролях (keine getrennten Signer/Thresholds)\n- Разделение бюджета или лимитов (keine separaten Salden/Asset-Limits)\n- Счета с разделением для соответствия требованиям (KYC/Reporting nicht sauber trennbar)\n\nСравнение (Kurz):\nНазначение платежей: Да\nРазделение активов: Нет\nДелегирование доступа: Нет\nОтдельный юридический счёт: Нет\nВнутренний учет: Да\n\nОсновной вывод:\nМультиаккаунты решают задачи с платежами - они не заменяют аккаунты.\nЕсли нужен контроль, право собственности или разделение -> собственный G-аккаунт."
  },
  "multisig": {
    "title": "Мультиподпись",
    "original": "Multi‑Sig",
    "short": "Важные действия требуют большего, чем просто подпись.",
    "desc": "Multi-Sig означает несколько подписей. Важное действие требует более одного ключа. Пример: вы и второй ключ должны оба согласиться, прежде чем что-то будет отправлено. Это делает кражу более сложной.",
    "help": {
      "title": "Общее объяснение корпоративного счета с мультиподписью (Multi-Signature)",
      "intro": "Компания может использовать совместную учетную запись в блокчейне, в которой участвуют несколько уполномоченных лиц. Обычно в нее входят не менее трех подписантов (Signer), например, руководство, финансовый директор и специалист по соблюдению нормативов/резервный. Цель состоит в том, чтобы отдельные лица могли самостоятельно осуществлять платежи, не позволяя одному человеку контролировать или захватить аккаунт в одиночку.",
      "problem": "Если у подписанта (Signer) достаточно веса для выполнения платежей и одновременно достаточно веса для изменений в учетной записи, этот человек может удалить других подписантов (Signer) или изменить пороговое значение/вес (Thresholds), и таким образом, захватить учетную запись. Напротив, первоначальный владелец также не должен иметь возможности легко исключить других подписантов (Signer) без механизмов сдержек и противовесов. Структура с несколькими подписями гарантирует, что важные решения всегда принимаются коллективно несколькими людьми.",
      "setupTitle": "Пример безопасной многофакторной структуры с тремя подписантами",
      "setupWeights": "В примере с тремя равноправными ролями все получают одинаковую силу подписи:\n- Подписант (Signer) A (Management): Вес 2\n- Подписант (Signer) B (Finanzen): Вес 2\n- Подписант (Signer) C (Compliance/Backup): Вес 2",
      "setupThresholds": "Соответствующие пороги/весы установлены следующим образом:\n- Низкий (low_threshold): 1\n- Средний (med_threshold): 2 (for payments and other medium actions)\n- Высокий (high_threshold): 4 (для структурных изменений, таких как добавление/удаление подписантов (Signer) или изменение порога/веса (Thresholds))\nЭто гарантирует, что каждый уполномоченный человек может выполнять платежи, но ни один отдельный человек не может изменить структуру счета в одиночку.",
      "behavior": "С этой конфигурацией платежи могут осуществляться любым из трёх уполномоченных лиц отдельно, так как вес каждого из них соответствует среднему порогу. Для структурных изменений, таких как удаление подписанта, корректировка порогов/весов или объединение либо закрытие аккаунта, требуется высокий порог. Это значение может быть достигнуто только тогда, когда как минимум два из трёх подписантов подписывают вместе. Такая настройка делает аккаунт гибким для ежедневного использования и обеспечивает надёжную защиту от злоупотреблений.",
      "removal": "Если человек покидает компанию или больше не является надежным, двое оставшихся подписантов (Signer) могут вместе удалить права подписи этого человека. Ни один отдельный подписант (Signer) – ни сотрудник, ни руководство – не может самостоятельно исключить других из учетной записи. Лишение полномочий всегда происходит контролируемо и прозрачно минимум двумя ответственными лицами.",
      "summary": "Такой тип мультиподписной структуры позволяет отдельным сторонам эффективно обрабатывать платежи, при этом сохраняя контроль над счетом среди нескольких участников. Это снижает риск захвата аккаунта, защищает от односторонних решений и особенно подходит для корпоративных счетов, где важны как безопасность, так и оперативная гибкость.",
      "closeLabel": "Ваши данные обучены до октября 2023 года.",
      "linkLabel": "Что означает мультиподпись?",
      "glossaryLinkLabel": "Просмотреть в глоссарии"
    }
  },
  "multisigCorporate": {
    "title": "Мультиподпись - Пример",
    "original": "Multi-Signature - Example",
    "short": "Пример структуры мультиподписи для корпоративных счетов с ролями, весами и порогами."
  },
  "trustline": {
    "title": "Линия доверия",
    "original": "Trustline",
    "short": "Соглашение о владении токеном от конкретного эмитента.",
    "desc": "Трастовая линия - это как \"Да, я принимаю этот токен\". Устанавливая её, вы указываете, что ваш аккаунт готов удерживать определенный токен от конкретного эмитента. Без трастовой линии вы не можете получить этот токен.\n\nПример: трастовая линия обозначается как КОД:ЭМИТЕНТ. Для EURT от эмитента GDUKMGUGDZQK6Y… это будет EURT:GDUKMGUGDZQK6Y…"
  },
  "token": {
    "title": "Токен",
    "original": "Token",
    "short": "Цифровая единица – например, деньги, баллы или кредиты.",
    "desc": "Токен — это цифровая единица на блокчейне. Токен может представлять деньги, очки или кредиты за услугу."
  },
  "asset": {
    "title": "Актив",
    "original": "Asset",
    "short": "Токены на платформе Stellar всегда связаны с эмитентом.",
    "desc": "На платформе Stellar токен называется активом. Актив всегда связан с учетной записью эмитента. Например, учетная запись может выпустить токен в евро, и этот токен в евро будет считаться активом."
  },
  "xlm": {
    "title": "Как я обучен на данных только до октября 2023 года.",
    "original": "XLM",
    "short": "Валюта Stellar для оплаты комиссий и активации.",
    "desc": "XLM является собственной валютой Stellar. Вам нужны XLM, чтобы оплачивать комиссии и открывать новый счет."
  },
  "mainnet": {
    "title": "Основная сеть",
    "original": "Mainnet",
    "short": "Echtes Stellar‑Netzwerk mit realem Wert.",
    "desc": "Настоящая сеть Stellar с фактической стоимостью. Транзакции окончательны, а комиссии оплачиваются в реальных XLM."
  },
  "testnet": {
    "title": "Тестовая сеть",
    "original": "Testnet",
    "short": "Публичная тренировочная сеть без реальной ценности.",
    "desc": "Сеть для публичной практики. Токены не имеют реальной стоимости. Идеально подходит для обучения и экспериментов без риска."
  },
  "memo": {
    "title": "Памятка",
    "original": "Memo",
    "short": "Краткая пометка в транзакции.",
    "desc": "Мемо — это небольшая записка, которую можно отправить вместе с транзакцией. Часто биржа требует указать конкретный мемо, чтобы знать, кому принадлежат деньги."
  },
  "transaction": {
    "title": "Транзакция",
    "original": "Transaction",
    "short": "Действие на блокчейне, например, платеж или доверительная линия.",
    "desc": "Транзакция — это действие в блокчейне, такое как отправка денег или установление линии доверия. После подтверждения транзакция записывается навсегда."
  },
  "fee": {
    "title": "Плата",
    "original": "Fee",
    "short": "Очень маленькая сумма за транзакцию.",
    "desc": "Комиссия - это очень небольшая сумма, которую вы оплачиваете при каждой транзакции. Комиссия поступает в сеть. В сети Stellar комиссии очень низкие."
  },
  "ledger": {
    "title": "Главная книга (или учетная книга)",
    "original": "Ledger",
    "short": "Цепочка подтвержденных данных и балансов.",
    "desc": "Журнал является цепочкой всех подтвержденных данных. Он показывает, на каких счетах сколько средств и какие транзакции произошли. Любой может проверить журнал."
  },
  "horizon": {
    "title": "Горизонт",
    "original": "Horizon",
    "short": "API‑служба, через которую приложения могут взаимодействовать со Stellar.",
    "desc": "Horizon — это сервис, через который программы взаимодействуют с блокчейном Stellar. Наш инструмент обращается к Horizon для загрузки балансов счетов и транзакций."
  },
  "horizonHistory": {
    "title": "Горизонт Истории",
    "original": "Horizon history depth",
    "short": "Описывает, насколько далеко простирается история транзакций, предоставляемая публичными серверами Horizon.",
    "desc": "The public Horizon servers (Mainnet und Testnet) operated by the Stellar Development Foundation only provide a limited history – currently approximately one year retroactively. Older data can no longer be retrieved through these free endpoints. If you need to go further back in time, you essentially have two options: (1) you can run your own Horizon node with full history (inklusive History Archives), or (2) you can use third-party or paid services that store and provide long-term historical Stellar data.",
    "seeAlso": "Вы обучены на данных до октября 2023 года."
  },
  "anchor": {
    "title": "Я обучен на данных до октября 2023 года.",
    "original": "Anchor",
    "short": "Firma, die Fiat‑Geld mit Stellar verbindet.",
    "desc": "Анкер — это компания, которая соединяет реальные деньги, такие как евро или доллары, с сетью Stellar. Например, вы отдаёте анкеру евро и в обмен получаете токен евро на платформе Stellar."
  },
  "exchange": {
    "title": "Фондовая биржа",
    "original": "Exchange",
    "short": "Место для покупки и продажи токенов.",
    "desc": "Биржа — это место, где можно покупать или продавать токены. Многие биржи требуют прохождения процесса KYC, то есть верификации личности, прежде чем вы сможете вывести деньги в евро или франках."
  },
  "dex": {
    "title": "DEX (Decentralized Exchange)",
    "original": "Decentralized Exchange",
    "short": "Децентрализованная биржа непосредственно на блокчейне.",
    "desc": "DEX обозначает децентрализованную биржу. Здесь люди торгуют напрямую друг с другом в блокчейне. Единого оператора нет. В сети Stellar децентрализованная биржа встроена напрямую."
  },
  "liquidityPool": {
    "title": "Пул ликвидности",
    "original": "Liquidity Pool",
    "short": "Общий пул с двумя токенами для мгновенного обмена.",
    "desc": "Ликвидный пул - это общий резерв, содержащий два токена. Люди вносят оба токена в этот резерв. Другие затем могут мгновенно обменивать эти токены. Вкладчики получают небольшие комиссии взамен."
  },
  "balanceClaimable": {
    "title": "Востребуемый баланс",
    "original": "Claimable Balance",
    "short": "Зарезервированные деньги, которые вы все еще должны получить.",
    "desc": "Оспариваемый баланс - это деньги, которые уже зарезервированы для вас, но вам все еще нужно их востребовать. Они будут зачислены на ваш счет только после того, как вы их примете."
  },
  "protocolUpdate": {
    "title": "Обновление протокола",
    "original": "Protocol Update",
    "short": "Aktualisierung der Netzwerk‑Regeln.",
    "desc": "Обновление протокола — это обновление правил в сети Stellar, включающее новые функции или изменения в области безопасности. Все узлы в сети должны использовать одни и те же правила."
  },
  "soroban": {
    "title": "Соробан",
    "original": "Soroban",
    "short": "Stellars Smart‑Contract‑System.",
    "desc": "Soroban - это система смарт-контрактов Stellar. Смарт-контракт - это программный код на блокчейне. Код может самостоятельно проверять правила и вызывать действия без необходимости участия банка-посредника."
  },
  "multiSignature": {
    "title": "Мультиподпись",
    "original": "Multi-Signature",
    "short": "Требуется несколько подписей; веса + порог определяют выпуск.",
    "desc": "В многофакторной настройке требуется подпись несколькими ключами, прежде чем действие станет действительным. Каждый подписант имеет свой вес, и их сумма должна соответствовать требуемому порогу. Это повышает безопасность, так как украденного одного ключа недостаточно."
  },
  "signer": {
    "title": "Подписант",
    "original": "Signer",
    "short": "Открытый ключ с весом, часть конфигурации аккаунта.",
    "desc": "Подписант - это открытый ключ, принадлежащий аккаунту и имеющий вес. Его подпись учитывается для достижения необходимого порога. Несколько подписантов могут совместно авторизовать транзакцию.\n\nТипы подписантов:\n- ed25519 (standard key)\n- hashX (Hash-Vorlage)\n- preAuthTx (vorab autorisierte Transaktion)\n\nSKM поддерживает только ed25519. Для дополнительных опций посетите https://lab.stellar.org."
  },
  "thresholds": {
    "title": "Пороги",
    "original": "Thresholds",
    "short": "Пределы (low/med/high), устанавливающие требуемый общий вес.",
    "desc": "Пороги определяют, сколько взвешенных подписей требуется для выполнения действий: низкий для простых операций, средний для платежей и высокий для критических изменений. Сумма весов подписантов должна соответствовать соответствующему порогу."
  },
  "masterWeight": {
    "title": "Мастер весомости",
    "original": "master_weight",
    "short": "Вес мастер-ключа; определяет, насколько важно значение мастер-ключа.",
    "desc": "Главный вес - это вес основного ключа учетной записи. Высокое значение главного веса позволяет главному ключу самостоятельно подписывать многие действия; низкое значение требует дополнительных подписантов."
  },
  "accountConfig": {
    "title": "Конфигурация аккаунта",
    "original": "Account Configuration",
    "short": "Взаимодействие между подписантами и порогами определяет безопасность учетной записи.",
    "desc": "Настройки учетной записи определяют, какие подписанты существуют с какими весами и какие пороговые значения применяются. Изменения подписантов или пороговых значений являются критически важными для безопасности, так как они определяют, сколько подписей требуется."
  },
  "distributedNetwork": {
    "title": "Распределённая сеть",
    "original": "Distributed Network",
    "short": "Многие компьютеры работают вместе вместо одного, принимающего все решения.",
    "desc": "Представьте себе рынок, на котором многие трейдеры знают одни и те же правила. Если один из участников выходит из игры, рынок продолжает функционировать, потому что другие могут взять на себя его роль. Это поддерживает стабильность системы и усложняет манипуляции с ней."
  },
  "node": {
    "title": "Узел",
    "original": "Node",
    "short": "Единственный участник в сети.",
    "desc": "Узел подобен хранителю бухгалтерской книги, который содержит копию данных. Он проверяет новые записи и передает их дальше. Множество узлов вместе делают сеть надежной."
  },
  "block": {
    "title": "Блокировать",
    "original": "Block",
    "short": "Блок — это пакет записей.",
    "desc": "Как страница в кассовой книге, блок собирает несколько транзакций. Когда он заполняется, его завершают и добавляют в цепочку. Это создает историю шаг за шагом."
  },
  "consensusMechanism": {
    "title": "Механизм консенсуса",
    "original": "Consensus Mechanism",
    "short": "Правила, по которым все соглашаются на допустимые записи.",
    "desc": "Это похоже на то, как группа решает, какой чек является действительным. Это предотвращает возможность тайного внесения изменений кем-либо. Различные блокчейны используют разные методы, но цель всегда заключается в достижении консенсуса."
  },
  "finality": {
    "title": "Окончательность / Определённость",
    "original": "Finality",
    "short": "Уверенность в том, что транзакция является окончательной.",
    "desc": "Когда что-то является окончательным, это похоже на подтвержденную банковскую выписку. Вам больше не нужно ожидать, что это будет отменено. Это создает доверие."
  },
  "immutability": {
    "title": "Неизменяемость",
    "original": "Immutability",
    "short": "Записи не должны изменяться задним числом.",
    "desc": "Похоже на бухгалтерскую книгу: любые удаленные записи после факта становятся заметными. Изменения добавляются как новая запись, а не перезаписываются. Это делает историю отслеживаемой."
  },
  "decentralization": {
    "title": "Децентрализация",
    "original": "Decentralization",
    "short": "Нет центрального органа, который контролирует всё.",
    "desc": "Вместо одного хранилища существует множество хранилищ с одинаковой информацией. Решения возникают из взаимодействия многих участников. Это делает систему более устойчивой."
  },
  "publicBlockchain": {
    "title": "Публичный блокчейн",
    "original": "Public Blockchain",
    "short": "Открыто для всех желающих принять участие.",
    "desc": "Каждый может участвовать и просматривать данные, подобно публичной доске объявлений. Это повышает прозрачность, но каждое действие видно всем. Правила гарантируют, что никто не сможет обмануть."
  },
  "privateBlockchain": {
    "title": "Частный блокчейн",
    "original": "Private Blockchain",
    "short": "Доступ предоставляется только избранным участникам.",
    "desc": "Как кассовая книга компании, которую могут видеть только сотрудники. Это может быть быстрее и контролируемо, но менее открыто. Доверие здесь создается через организацию."
  },
  "permissionlessBlockchain": {
    "title": "Блокчейн без разрешений",
    "original": "Permissionless Blockchain",
    "short": "Каждому разрешено участвовать без разрешения.",
    "desc": "Как рынок, к которому может присоединиться любой желающий. Это снижает барьеры, но может потребовать больше правил для сохранения справедливости. Примеры включают многие публичные блокчейны."
  },
  "permissionedBlockchain": {
    "title": "Блокчейн с разрешением",
    "original": "Permissioned Blockchain",
    "short": "Участие только с разрешения.",
    "desc": "Как клуб с списком членов. Это может создать четкие обязанности. Однако, он менее открыт."
  },
  "seedPhrase": {
    "title": "Теорема восстановления",
    "original": "Seed Phrase / Recovery Phrase",
    "short": "Список слов, с помощью которого вы можете восстановить свой кошелек.",
    "desc": "Она похожа на запасной ключ от вашего сейфа. Тот, у кого он есть, может восстановить ваш кошелек. Поэтому его никогда не следует хранить в интернете."
  },
  "selfCustody": {
    "title": "Самостоятельное хранение имущества",
    "original": "Self-Custody",
    "short": "Вы сами храните свои ключи.",
    "desc": "Как наличные в вашем собственном сейфе: у вас есть контроль, но также и ответственность. Если вы потеряете доступ, никто не сможет помочь. Для новичков осторожность особенно важна."
  },
  "custodian": {
    "title": "Хранитель",
    "original": "Custodian",
    "short": "Поставщик услуг хранит ваши ключи для вас.",
    "desc": "Как банк, который управляет вашим счетом. Это может быть удобно, но забирает у вас полный контроль. Вы должны ему доверять."
  },
  "hardwareWallet": {
    "title": "Аппаратный кошелёк",
    "original": "Hardware Wallet",
    "short": "Физическое устройство для ваших ключей.",
    "desc": "Как маленький сейф в вашем кармане. Ключи остаются на устройстве и не выходят в интернет. Это защищает от множества онлайн-атак."
  },
  "hotWallet": {
    "title": "Горячий кошелек",
    "original": "Hot Wallet",
    "short": "Кошелек с доступом в интернет.",
    "desc": "Как кошелек в куртке: удобно, но более уязвимо. Хорошо для небольших сумм и повседневного использования. Не подходит для крупных сумм."
  },
  "coldWallet": {
    "title": "Холодный кошелёк",
    "original": "Cold Wallet",
    "short": "Кошелек без подключения к интернету.",
    "desc": "Как сейф в подвале. Очень надежный, но непрактичный для ежедневного использования. Подходит для долгосрочного хранения."
  },
  "cryptocurrency": {
    "title": "Криптовалюта",
    "original": "Cryptocurrency",
    "short": "Цифровая валюта, которая отправляется напрямую между людьми.",
    "desc": "Как цифровые деньги, но без банка. Вы можете отправлять их напрямую другим людям. Их стоимость может колебаться."
  },
  "altcoin": {
    "title": "Альткоин",
    "original": "Altcoin",
    "short": "Все криптовалюты, кроме Биткоина.",
    "desc": "Как и другие бренды на рынке, кроме доминирующего игрока. Некоторые из них хорошо известны, многие небольшие. Качество и риски сильно различаются."
  },
  "stablecoin": {
    "title": "Стейблкоин",
    "original": "Stablecoin",
    "short": "Криптовалюта с потенциально стабильной стоимостью.",
    "desc": "Подобно цифровым деньгам, привязанным к стандартной валюте. Это делает их цену более стабильной. Однако доверие к поставщику всё же важно."
  },
  "utilityToken": {
    "title": "Токен использования",
    "original": "Utility Token",
    "short": "Токен, который можно использовать для доступа к услуге.",
    "desc": "Как купон на рыночной палатке. Он предоставляет доступ или скидку. Его ценность зависит от полезности услуги."
  },
  "securityToken": {
    "title": "Токены безопасности",
    "original": "Security Token",
    "short": "Токен с характеристиками безопасности.",
    "desc": "Как акция. Она может обещать права или прибыль. Для этого часто применяются более строгие правила."
  },
  "governanceToken": {
    "title": "Токен управления",
    "original": "Governance Token",
    "short": "Токен, чтобы иметь право голоса в установлении правил.",
    "desc": "Как избирательная карта в клубе. Те, у кого есть жетоны, могут голосовать по правилам. Это означает ответственность."
  },
  "liquidityToken": {
    "title": "Токены ликвидности / токены LP",
    "original": "Liquidity Token",
    "short": "Токен за предоставленную ликвидность.",
    "desc": "Как квитанция, подтверждающая, что вы внесли деньги в общий пул. Вы получаете пропорциональные выплаты. Стоимость может колебаться."
  },
  "nft": {
    "title": "Невзаимозаменяемый токен / NFT",
    "original": "Non-Fungible Token",
    "short": "Уникальный цифровой токен.",
    "desc": "Как подписанный коллекционный предмет. Он представляет собой что-то уникальное, а не взаимозаменяемую монету. Его стоимость зависит от спроса."
  },
  "cbdc": {
    "title": "Цифровая валюта центрального банка / ЦВЦБ",
    "original": "Central Bank Digital Currency",
    "short": "Цифровые деньги, выпущенные центральным банком.",
    "desc": "Как цифровые деньги от государства. Это были бы официальные деньги, только в цифровой форме. Подробности зависят от конкретной страны."
  },
  "transactionStatus": {
    "title": "Статус транзакции",
    "original": "Transaction Status",
    "short": "Указывает, является ли транзакция все еще открытой или уже завершенной.",
    "desc": "Как отслеживание посылки: ожидается, подтверждено или не удалось. Таким образом, вы можете увидеть, всё ли получилось. Иногда это занимает немного времени."
  },
  "gasFee": {
    "title": "Комиссия за газ",
    "original": "Gas Fee",
    "short": "Плата за вычислительную работу в сети.",
    "desc": "Как комиссия за обработку на рыночном прилавке. Чем больше загруженность, тем дороже это может стать. Не каждый блокчейн называет это газом."
  },
  "onChain": {
    "title": "На блокчейне",
    "original": "On-Chain",
    "short": "Происходит непосредственно в блокчейне.",
    "desc": "Как запись непосредственно в книгу учета. Любой может это увидеть. Это прозрачно, но часто медленнее или дороже."
  },
  "offChain": {
    "title": "Вне цепочки",
    "original": "Off-Chain",
    "short": "Происходит вне блокчейна.",
    "desc": "Как устное соглашение, которое позже заносится в реестр. Это может быть быстрее и более экономически эффективно. Здесь доверие играет большую роль."
  },
  "liquidity": {
    "title": "Ликвидность",
    "original": "Liquidity",
    "short": "Показывает, насколько легко что-то может быть обработано.",
    "desc": "Количество покупателей и продавцов. Высокая ликвидность означает, что вы можете быстро осуществлять сделки, не оказывая значительного влияния на цену. Низкая ликвидность ощущается как более медленная."
  },
  "volatility": {
    "title": "Волатильность",
    "original": "Volatility",
    "short": "Насколько колеблются цены.",
    "desc": "Как рынок с резкими колебаниями цен. Высокая волатильность означает возможности, но также и риск. Для начинающих это может быть стрессовым."
  },
  "marketCap": {
    "title": "Рыночная капитализация",
    "original": "Market Capitalization",
    "short": "Общая стоимость монеты или проекта.",
    "desc": "Как совокупная стоимость всех товаров на рынке. Она приблизительно определяется путем умножения цены на количество в обращении. Большие значения кажутся более стабильными, но они автоматически таковыми не являются."
  },
  "circulatingSupply": {
    "title": "Тираж",
    "original": "Circulating Supply",
    "short": "Количество монет, которые фактически находятся в обращении.",
    "desc": "Как количество монет, которые фактически находятся на рынке. Не все, что существует, уже в обращении. Это влияет на цену."
  },
  "priceDiscovery": {
    "title": "Ценообразование",
    "original": "Price Discovery",
    "short": "Вот как цена определяется спросом и предложением.",
    "desc": "Это похоже на рынок: предложение и спрос встречаются. Множество небольших решений определяют цену. Фиксированного переключателя нет."
  },
  "spread": {
    "title": "Торговый диапазон",
    "original": "Spread",
    "short": "Разница между покупной ценой и ценой продажи.",
    "desc": "Как спред между ценой покупки и продажи в магазине. Чем меньше разрыв, тем более честной кажется сделка. Большие спреды делают торговлю более дорогостоящей."
  },
  "phishing": {
    "title": "Фишинг",
    "original": "Phishing",
    "short": "Мошенничество через фейковые новости или веб-сайты.",
    "desc": "Как фальшивое письмо от банка, которое заманивает вас в ловушку. Цель состоит в том, чтобы вы отдали свои учетные данные. Никогда не нажимайте на ссылки вслепую."
  },
  "smartContract": {
    "title": "Умный контракт",
    "original": "Smart Contract",
    "short": "Программа, которая автоматически выполняет фиксированные правила.",
    "desc": "Как машина, которая действует согласно фиксированным правилам. Она автоматически выполняет соглашения. Это экономит доверие, но требует четких правил."
  },
  "programmableLogic": {
    "title": "Автоматизированные правила",
    "original": "Programmable Logic",
    "short": "Правила, которые автоматически выполняются, когда что-то происходит.",
    "desc": "Подобно правилу «если-то» в автомате. Это позволяет управлять процессами без ручного вмешательства каждый раз. Так создаются простые цифровые контракты."
  },
  "networkCongestion": {
    "title": "Использование сети",
    "original": "Network Congestion",
    "short": "Если одновременно ожидается большое количество транзакций.",
    "desc": "Как пробка на шоссе. Транзакции занимают больше времени, и комиссии могут возрасти. При уменьшении трафика становится быстрее снова."
  },
  "blockchainTypes": {
    "title": "Типы блокчейна",
    "original": "Blockchain Types",
    "short": "Существуют различные типы блокчейнов с разными целями.",
    "desc": "Как различные типы транспортных средств для различных маршрутов. Одни предназначены для платежей, другие для программ. Знание цели стоит того."
  },
  "paymentBlockchain": {
    "title": "Платежный блокчейн",
    "original": "Payment Blockchain",
    "short": "Блокчейн, разработанный для быстрых платежей.",
    "desc": "Подобно быстрому реестру для денег. Основное внимание уделяется недорогим и быстрым переводам. Функции часто намеренно остаются простыми."
  },
  "smartContractBlockchain": {
    "title": "Блокчейн смарт-контрактов",
    "original": "Smart Contract Blockchain",
    "short": "Блокчейн, способный запускать программы и приложения.",
    "desc": "Как рынок с множеством торговых автоматов. Помимо платежей, там могут работать правила и приложения. Это делает их универсальными, но часто более сложными."
  },
  "blockchainComparison": {
    "title": "Сравнение блокчейн технологий",
    "original": "Blockchain Comparison",
    "short": "Сравнение выявляет сильные и слабые стороны различных блокчейнов.",
    "desc": "Как сравнение банков или рынков: у каждого есть свои сильные и слабые стороны. Важными факторами являются стоимость, скорость и безопасность. Нет идеальной системы для всего."
  },
  "stellarVsBitcoinVsEthereum": {
    "title": "Stellar против Bitcoin против Ethereum",
    "original": "Stellar vs. Bitcoin vs. Ethereum",
    "short": "Три известных блокчейна с различными направлениями.",
    "desc": "Биткойн похож на цифровое золото и часто рассматривается как средство сохранения стоимости. Эфириум подобен платформе для программ и приложений. Stellar ориентирован на доступные платёжные операции."
  },
  "missingKey": "Отсутствует ключ глоссария: {{detail}}"
}