{
  "pageTitle": "Глоссарий",
  "pageIntro": "Здесь вы найдете важные термины из мира блокчейна и сети Stellar. Все объясняется простыми словами.",
  "searchLabel": "Поисковый запрос",
  "searchPlaceholder": "Поисковый запрос (z. B. Konto, Account, Muxed)",
  "searchHint": "Поиск находит слова и объяснения.",
  "noResults": "Нет совпадения.",
  "groups": {
    "accountsKeys": "Аккаунты и ключи",
    "multisigSecurity": "Мультиподпись и безопасность аккаунта",
    "walletsCustody": "Кошельки и хранение",
    "tokensAssets": "Токены и активы",
    "transactionsFees": "Транзакции и комиссии",
    "marketsTrading": "Рынки и трейдинг",
    "networkProtocol": "Сеть и протокол",
    "smartContracts": "Смарт-контракты",
    "blockchainBasics": "Основы блокчейна",
    "security": "Безопасность и мошенничество"
  },
  "blockchain": {
    "title": "Блокчейн",
    "original": "Blockchain",
    "short": "Gemeinsames digitales Kassenbuch – viele Computer speichern die gleichen Einträge.",
    "desc": "Блокчейн подобен цифровой книге учета. Многие компьютеры хранят одинаковые записи, поэтому никто не может тайно что-либо изменить."
  },
  "wallet": {
    "title": "Кошелек",
    "original": "Wallet",
    "short": "Цифровой кошелек, управляющий вашими ключами.",
    "desc": "Кошелек — это ваш цифровой кошелек. Он управляет ключами, необходимыми для доступа к вашему аккаунту и отправки транзакций. Кошелек может быть программой, приложением или даже просто листком бумаги с вашим приватным ключом."
  },
  "account": {
    "title": "Учетная запись",
    "original": "Account",
    "short": "Учетная запись в блокчейне может содержать активы и отправлять транзакции.",
    "desc": "Учётная запись - это место в блокчейне, где хранятся ваши активы. Учётная запись имеет публичный адрес, который начинается с G. Несколько кошельков могут получить доступ к одной и той же учётной записи, если у них есть правильный ключ."
  },
  "addressG": {
    "title": "G-адрес",
    "original": "G Address",
    "short": "Публичный ключ (beginnt mit G) учётной записи Stellar.",
    "desc": "G-адрес является основным адресом Stellar-аккаунта. Он начинается с буквы G. Вы предоставляете его другим, чтобы они могли отправить вам что-либо."
  },
  "publicKey": {
    "title": "Открытый ключ",
    "original": "Public Key",
    "short": "Adresse, die du teilen darfst; bei Stellar meist die G‑Adresse.",
    "desc": "Публичный ключ — это адрес, который можно делиться. В системе Stellar это G-адрес. Другие используют его, чтобы отправлять вам деньги."
  },
  "privateKey": {
    "title": "Секретный ключ",
    "original": "Secret Key",
    "short": "Пароль от аккаунта – никогда не делитесь им.",
    "desc": "Секретный ключ — это ваш пароль для доступа к аккаунту. Любой, у кого есть этот ключ, может перемещать ваши деньги. Никогда не делитесь им."
  },
  "addressFederation": {
    "title": "Адрес федерации",
    "original": "Federation Address",
    "short": "Kurze Adresse wie E‑Mail, zeigt auf eine G‑Adresse.",
    "desc": "Федеративный адрес выглядит как электронная почта. Пример: имя*домен.com. Этот короткий адрес указывает на обычный G-адрес. Его легче запомнить."
  },
  "addressMuxed": {
    "title": "Мультиплексированный аккаунт",
    "original": "Muxed Account",
    "short": "M‑адрес с дополнительным идентификатором – использует общий базовый счёт.",
    "desc": "Адрес M указывает на существующую учетную запись в Stellar, но имеет дополнительный уникальный идентификатор (ID). Это позволяет, например, различать нескольких людей или отделы под одним и тем же G-адресом. Технически средства все еще принадлежат основной учетной записи."
  },
  "multisig": {
    "title": "Мультиподпись",
    "original": "Multi‑Sig",
    "short": "Важные действия требуют больше, чем просто подпись.",
    "desc": "Multi-Sig означает несколько подписей. Для важного действия требуется более одного ключа. Например, вы и второй ключ должны оба согласиться, прежде чем что-то можно будет отправить. Это делает кражу более затруднительной.",
    "help": {
      "title": "Общее объяснение корпоративного счета с мультиподписью (Multi-Signature)",
      "intro": "Компания может использовать совместный блокчейн-счет, в котором участвуют несколько уполномоченных лиц. Обычно в нем задействованы как минимум три подписанта (Signer), например, руководство, финансовый директор и специалист по соблюдению нормативных требований/резерв. Цель заключается в том, чтобы отдельные лица могли самостоятельно осуществлять платежи, не имея при этом единоличного контроля или возможности захватить управление счетом.",
      "problem": "Если подписант (Signer) имеет достаточный вес для выполнения платежей и одновременно достаточно веса для изменения учетной записи, он может убрать других подписантов (Signer) или изменить порог/вес (Thresholds), и таким образом захватить учетную запись. Наоборот, первоначальный владелец также не должен иметь возможности исключать других подписантов (Signer) без механизмов проверки и балансировки. Структура с несколькими подписями обеспечивает, что важные решения всегда поддерживаются несколькими людьми совместно.",
      "setupTitle": "Пример безопасной многоступенчатой структуры с тремя подписантами",
      "setupWeights": "В примере с тремя эквивалентными ролями все получают одинаковую силу подписи:\n- Подписант (Signer) A (management): вес 2\n- Подписант (Signer) B (Finanzen): вес 2\n- Подписант (Signer) C (Compliance/Backup): вес 2",
      "setupThresholds": "Установлены соответствующие пороги/весовые коэффициенты:\n- Низкий (low_threshold): 1\n- Средний (med_threshold): 2 (for payments and other medium actions)\n- Высокий (high_threshold): 4 (для структурных изменений, таких как добавление/удаление подписантов (Signer) или изменение порога/весового коэффициента (Thresholds))\nЭта настройка позволяет каждому уполномоченному лицу выполнять платежи, но ни одно лицо не может самостоятельно изменить структуру учетной записи.",
      "behavior": "С этой конфигурацией платежи могут осуществляться любым из трех уполномоченных лиц индивидуально, поскольку вес каждого из них соответствует среднему порогу/весу (Threshold). Однако для структурных изменений, таких как удаление подписанта (Signers), корректировка порогов/весов или слияние или закрытие счета, требуется высокий порог/вес (high_threshold). Это значение может быть достигнуто только в том случае, если как минимум два из трех подписантов (Signer) подпишутся вместе. Таким образом, счет остается гибким для повседневного использования и в то же время хорошо защищенным от злоупотреблений.",
      "removal": "Wenn eine Person das Unternehmen verlässt oder nicht mehr vertrauenswürdig ist, können zwei der verbleibenden Unterzeichner (Signer) gemeinsam die Signaturrechte dieser Person entfernen. Kein einzelner Unterzeichner (Signer) – weder ein Mitarbeiter noch die Geschäftsführung – kann andere eigenständig aus dem Konto ausschließen. Der Entzug von Berechtigungen erfolgt also immer kontrolliert und nachvollziehbar durch mindestens zwei Verantwortliche.",
      "summary": "Этот тип мультиподписной структуры позволяет отдельным лицам эффективно обрабатывать платежи, сохраняя при этом контроль над счетом в руках нескольких сторон. Это снижает риск захвата счета, защищает от односторонних решений и особенно подходит для корпоративных счетов, где важны как безопасность, так и операционная гибкость.",
      "closeLabel": "Вы обучены данным до октября 2023 года.",
      "linkLabel": "Мультиподпись означает необходимость наличия нескольких подписей для одобрения транзакции или осуществления определенного действия в системе. Это повышает уровень безопасности и часто используется в криптовалютных кошельках, чтобы снизить риск мошенничества и несанкционированного доступа.",
      "glossaryLinkLabel": "Посмотреть в глоссарии"
    }
  },
  "multisigCorporate": {
    "title": "Мультиподпись в компаниях",
    "original": "Multi-Signature (corporate example)",
    "short": "Пример структуры мультиподписи для корпоративных счетов с ролями, весами и порогами."
  },
  "trustline": {
    "title": "Кредитная линия",
    "original": "Trustline",
    "short": "Соглашение о владении токеном от конкретного эмитента.",
    "desc": "Трастовая линия похожа на выражение согласия: да, я принимаю этот токен. Делая это, вы указываете, что ваш аккаунт готов принять определённый токен от конкретного эмитента. Без трастовой линии вы не сможете получить этот токен.\n\nПример: Трастовая линия указывается как КОД:ЭМИТЕНТ. Например, для EURT от эмитента GDUKMGUGDZQK6Y… это будет EURT:GDUKMGUGDZQK6Y…"
  },
  "token": {
    "title": "Токен",
    "original": "Token",
    "short": "Цифровая единица – например, деньги, баллы или кредиты.",
    "desc": "Токен — это цифровая единица на блокчейне. Токен может представлять собой деньги, очки или кредит на услугу."
  },
  "asset": {
    "title": "Актив",
    "original": "Asset",
    "short": "Токены на платформе Stellar всегда связаны с эмитентом.",
    "desc": "В системе Stellar токен называется активом. Актив всегда связан с аккаунтом-эмитентом. Например, аккаунт может выпустить токен в евро. Этот токен в евро будет считаться активом."
  },
  "xlm": {
    "title": "XLM",
    "original": "XLM",
    "short": "Нативная валюта Stellar для комиссии и активации.",
    "desc": "XLM является родной валютой Stellar. Вам необходим XLM для оплаты комиссий и создания нового аккаунта."
  },
  "mainnet": {
    "title": "Основная сеть",
    "original": "Mainnet",
    "short": "Echtes Stellar‑Netzwerk mit realem Wert.",
    "desc": "Настоящая сеть Stellar с реальной ценностью. Транзакции окончательные, и комиссии оплачиваются в реальных XLM."
  },
  "testnet": {
    "title": "Тестовая сеть",
    "original": "Testnet",
    "short": "Сеть общественной практики без реальной ценности.",
    "desc": "Сеть для публичной практики. Токены не имеют реальной ценности. Идеально для обучения и экспериментов без риска."
  },
  "memo": {
    "title": "Памятка",
    "original": "Memo",
    "short": "Краткое примечание в транзакции.",
    "desc": "Мемо - это небольшая записка, которую можно отправить вместе с транзакцией. Часто обмен требует указания конкретного мемо, чтобы определить, кому принадлежат деньги."
  },
  "transaction": {
    "title": "Транзакция",
    "original": "Transaction",
    "short": "Действие на блокчейне, например, платеж или кредитная линия.",
    "desc": "Транзакция — это действие в блокчейне, такое как отправка денег или установление доверительной линии. Транзакция сохраняется на постоянной основе после ее подтверждения."
  },
  "fee": {
    "title": "Плата",
    "original": "Fee",
    "short": "Очень маленькая сумма за транзакцию.",
    "desc": "Комиссия представляет собой очень небольшую сумму, которую вы платите при каждой транзакции. Комиссия идет сети. На платформе Stellar комиссии очень маленькие."
  },
  "ledger": {
    "title": "Главная книга",
    "original": "Ledger",
    "short": "Цепочка подтвержденных данных и остатков на счетах.",
    "desc": "Главная книга представляет собой цепочку всех подтвержденных данных. Она показывает, какие счета владеют какими суммами и какие транзакции произошли. Каждый может проверить главную книгу."
  },
  "horizon": {
    "title": "Горизонт",
    "original": "Horizon",
    "short": "API‑Dienst, über den Apps mit Stellar sprechen.",
    "desc": "Horizon — это сервис, через который программы взаимодействуют с блокчейном Stellar. Наш инструмент отправляет запросы к Horizon для загрузки балансов счетов и транзакций."
  },
  "horizonHistory": {
    "title": "Горизонт Истории",
    "original": "Horizon history depth",
    "short": "Описывает, насколько далеко простирается история транзакций, предоставляемая публичными серверами Horizon.",
    "desc": "Die von der Stellar Development Foundation betriebenen öffentlichen Horizon-Server (Mainnet und Testnet) stellen nur eine begrenzte Historie zur Verfügung – derzeit ungefähr ein Jahr rückwirkend. Ältere Daten sind über diese kostenlosen Endpunkte nicht mehr abrufbar. Wenn du weiter in die Vergangenheit zurück musst, hast du im Wesentlichen zwei Optionen: (1) du betreibst einen eigenen Horizon-Node mit vollständiger History (inklusive History Archives), oder (2) du nutzt Drittanbieter- bzw. Bezahldienste, die historische Stellar-Daten langfristig speichern und zur Verfügung stellen.",
    "seeAlso": "Вы обучены данным до октября 2023 года."
  },
  "anchor": {
    "title": "Якорь",
    "original": "Anchor",
    "short": "Firma, die Fiat‑Geld mit Stellar verbindet.",
    "desc": "Анкер — это компания, которая соединяет реальные деньги, такие как евро или доллары, с сетью Stellar. Например, вы отдаёте анкеру евро и получаете взамен токен в евро на платформе Stellar."
  },
  "exchange": {
    "title": "Биржа",
    "original": "Exchange",
    "short": "Место для покупки и продажи токенов.",
    "desc": "Биржа — это место, где вы можете покупать или продавать токены. Многие биржи требуют прохождения процесса KYC (идентификация личности) перед тем, как вы сможете вывести деньги в евро или франках."
  },
  "dex": {
    "title": "DEX",
    "original": "Decentralized Exchange",
    "short": "Децентрализованная биржа непосредственно на блокчейне.",
    "desc": "DEX означает Децентрализованная Биржа. Здесь люди обмениваются друг с другом напрямую на блокчейне. Единого оператора нет. Stellar имеет встроенную децентрализованную биржу."
  },
  "liquidityPool": {
    "title": "Пул ликвидности",
    "original": "Liquidity Pool",
    "short": "Совместный пул с двумя токенами для немедленного обмена.",
    "desc": "Пул ликвидности представляет собой общий пул, содержащий два токена. Люди вносят в него оба токена. Другие могут сразу обменять эти токены. Депозиторы зарабатывают небольшие комиссии за эту услугу."
  },
  "balanceClaimable": {
    "title": "Требуемый баланс",
    "original": "Claimable Balance",
    "short": "Зарезервированные деньги, которые вам ещё нужно принять.",
    "desc": "Запрашиваемый остаток — это деньги, которые уже были зарезервированы для вас, но которые вам все еще нужно запросить. Только когда вы их принимаете, они попадают на ваш счет."
  },
  "protocolUpdate": {
    "title": "Обновление протокола",
    "original": "Protocol Update",
    "short": "Aktualisierung der Netzwerk‑Regeln.",
    "desc": "Обновление протокола — это усовершенствование правил в сети Stellar, такое как новые возможности или изменения в области безопасности. Все узлы в сети должны использовать одни и те же правила."
  },
  "soroban": {
    "title": "Соробан",
    "original": "Soroban",
    "short": "Stellars Smart‑Contract‑System.",
    "desc": "Soroban — это система смарт-контрактов Stellar. Смарт-контракт — это программный код на блокчейне. Код может самостоятельно проверять правила и инициировать действия без участия посредника, такого как банк."
  },
  "multiSignature": {
    "title": "Мультиподпись",
    "original": "Multi-Signature",
    "short": "Multiple signatures required; weights + threshold determine the release.",
    "desc": "В мультиподписной настройке необходимо, чтобы несколько ключей подписали действие, прежде чем оно станет действительным. У каждого подписанта есть вес, и сумма должна достичь необходимого порога. Это повышает безопасность, так как один украденный ключ недостаточен."
  },
  "signer": {
    "title": "Подписант",
    "original": "Signer",
    "short": "Открытый ключ с весом, являющийся частью конфигурации учетной записи.",
    "desc": "Подписант - это открытый ключ, который принадлежит учетной записи и имеет вес. Его подпись учитывается для достижения необходимого порога. Несколько подписантов могут совместно авторизовать транзакцию."
  },
  "thresholds": {
    "title": "Пороговые значения",
    "original": "Thresholds",
    "short": "Ограничения (low/med/high), которые определяют необходимую сумму весов.",
    "desc": "Пороги определяют, сколько взвешенных подписей необходимо для выполнения действий: низкий порог для простых операций, средний для платежей, высокий для критических изменений. Сумма весов подписантов должна соответствовать соответствующему порогу."
  },
  "masterWeight": {
    "title": "Мастер вес",
    "original": "master_weight",
    "short": "Вес главного ключа; управляет значимостью основного ключа.",
    "desc": "Мастер-вес — это вес главного ключа учетной записи. Высокий мастер-вес позволяет главному ключу самостоятельно подписывать множество действий; низкое значение требует дополнительных подписантов."
  },
  "accountConfig": {
    "title": "Конфигурация учетной записи",
    "original": "Account Configuration",
    "short": "Взаимодействие подписантов и порогов определяет безопасность учетной записи.",
    "desc": "Конфигурация учетной записи указывает, какие подписанты существуют с каким весом и какие пороги применяются. Изменения подписантов или порогов критически важны для безопасности, поскольку они определяют, сколько подписей требуется."
  },
  "missingKey": "Отсутствует ключ глоссария: {{detail}}",
  "distributedNetwork": {
    "title": "Распределённая сеть",
    "original": "Distributed Network",
    "short": "Многочисленные компьютеры работают вместе, вместо того чтобы один принимал все решения.",
    "desc": "Представьте себе рынок, где многие трейдеры знают одни и те же правила. Если один участник выходит из игры, он продолжает функционировать, потому что другие могут его заменить. Это поддерживает стабильность системы и делает её труднее манипулируемой."
  },
  "node": {
    "title": "Узел",
    "original": "Node",
    "short": "Один участник в сети.",
    "desc": "Узел похож на хранителя книги учета, который содержит копию данных. Он проверяет новые записи и пересылает их дальше. Множество узлов вместе делают сеть надежной."
  },
  "block": {
    "title": "Блок",
    "original": "Block",
    "short": "Блок - это пакет записей.",
    "desc": "Подобно странице в бухгалтерской книге, блок собирает несколько транзакций. Как только он заполняется, он завершается и добавляется в цепочку. Таким образом история создаётся шаг за шагом."
  },
  "consensusMechanism": {
    "title": "Механизм консенсуса",
    "original": "Consensus Mechanism",
    "short": "Правила, по которым все соглашаются на допустимые записи.",
    "desc": "Это похоже на то, как группа решает, какой чек является действительным. Это предотвращает возможность тайного внесения изменений. Различные блокчейны используют различные методы, но цель всегда заключается в достижении консенсуса."
  },
  "finality": {
    "title": "Окончательность / Определённость",
    "original": "Finality",
    "short": "Гарантия того, что транзакция является окончательной.",
    "desc": "Когда что-то является окончательным, это похоже на твёрдо зафиксированную банковскую выписку. Вам больше не нужно ожидать её отмены. Это создаёт доверие."
  },
  "immutability": {
    "title": "Незыблемость",
    "original": "Immutability",
    "short": "Записи не должны изменяться задним числом.",
    "desc": "Так же, как и с кассовой книгой: удаление задним числом заметно. Изменения вносятся как новая запись, а не перезаписываются. Это делает историю отслеживаемой."
  },
  "decentralization": {
    "title": "Децентрализация",
    "original": "Decentralization",
    "short": "Никакой центральной власти не контролирует всё.",
    "desc": "Вместо одного сейфа существует множество сейфов с той же информацией. Решения принимаются в результате взаимодействия множества участников. Это делает систему более устойчивой."
  },
  "publicBlockchain": {
    "title": "Публичный блокчейн",
    "original": "Public Blockchain",
    "short": "Открыто для всех желающих принять участие.",
    "desc": "Любой человек может участвовать и просматривать данные, подобно общественной доске объявлений. Это повышает прозрачность, но каждое действие видно всем. Правила гарантируют, что никто не сможет обмануть."
  },
  "privateBlockchain": {
    "title": "Частный блокчейн",
    "original": "Private Blockchain",
    "short": "Доступ только для избранных участников.",
    "desc": "Как бухгалтерская книга компании, которую могут видеть только сотрудники. Это может быть быстрее и более контролируемо, но менее открыто. Доверие здесь строится через организацию."
  },
  "permissionlessBlockchain": {
    "title": "Блокчейн без разрешений",
    "original": "Permissionless Blockchain",
    "short": "Каждому разрешено участвовать без разрешения.",
    "desc": "Как рынок, к которому может присоединиться каждый. Это снижает барьеры, но может потребовать больше правил для поддержания справедливости. Примеры включают многие публичные блокчейны."
  },
  "permissionedBlockchain": {
    "title": "Разрешённый блокчейн",
    "original": "Permissioned Blockchain",
    "short": "Участие разрешено только с разрешения.",
    "desc": "Как клуб с членским списком. Это может создать четкие обязанности. Однако, он менее открыт."
  },
  "seedPhrase": {
    "title": "Теорема о восстановлении",
    "original": "Seed Phrase / Recovery Phrase",
    "short": "Список слов, который можно использовать для восстановления вашего кошелька.",
    "desc": "Она как запасной ключ от вашего сейфа. У кого он есть, тот может восстановить ваш кошелек. Поэтому его никогда не следует хранить в интернете."
  },
  "selfCustody": {
    "title": "Самостоятельное хранение",
    "original": "Self-Custody",
    "short": "Вы храните свои ключи сами.",
    "desc": "Как иметь наличные в собственном сейфе: у вас есть контроль, но также и ответственность. Если вы потеряете доступ, никто не сможет вам помочь. Для новичков осторожность особенно важна."
  },
  "custodian": {
    "title": "Попечитель",
    "original": "Custodian",
    "short": "Поставщик услуг хранит ваши ключи для вас.",
    "desc": "Как банк, который управляет вашим счетом. Это может быть удобно, но вы теряете полный контроль. Вы должны ему доверять."
  },
  "hardwareWallet": {
    "title": "Аппаратный кошелек",
    "original": "Hardware Wallet",
    "short": "Физическое устройство для ваших ключей.",
    "desc": "Как маленький сейф в вашем кармане. Ключи остаются на устройстве и не попадают в интернет. Это защищает от многих онлайн-атак."
  },
  "hotWallet": {
    "title": "Горячий кошелек",
    "original": "Hot Wallet",
    "short": "Кошелек с доступом в интернет.",
    "desc": "Как кошелек в куртке: удобно, но более уязвимо. Подходит для небольших сумм и повседневного использования. Не идеально для больших сумм."
  },
  "coldWallet": {
    "title": "Холодный кошелек",
    "original": "Cold Wallet",
    "short": "Кошелек без подключения к интернету.",
    "desc": "Как сейф в подвале. Очень надежный, но непрактичный для повседневного использования. Подходит для долговременного хранения."
  },
  "cryptocurrency": {
    "title": "Криптовалюта",
    "original": "Cryptocurrency",
    "short": "Цифровая валюта, которая отправляется напрямую между людьми.",
    "desc": "Как цифровые деньги, но без банка. Вы можете отправлять их напрямую другим. Стоимость может колебаться."
  },
  "altcoin": {
    "title": "Альткоин",
    "original": "Altcoin",
    "short": "Все криптовалюты, кроме биткойна.",
    "desc": "Как и другие бренды на рынке, кроме лидера отрасли. Некоторые из них хорошо известны, многие являются небольшими. Качество и риск значительно различаются."
  },
  "stablecoin": {
    "title": "Стейблкоин",
    "original": "Stablecoin",
    "short": "Криптовалюта с наиболее стабильной стоимостью.",
    "desc": "Как цифровые деньги, привязанные к традиционной валюте. Это делает их цену более стабильной. Тем не менее, доверие к поставщику имеет большое значение."
  },
  "utilityToken": {
    "title": "Токен использования",
    "original": "Utility Token",
    "short": "Токен, с помощью которого можно воспользоваться услугой.",
    "desc": "Как ваучер на рыночной стойке. Он предоставляет доступ или скидку. Его ценность зависит от полезности услуги."
  },
  "securityToken": {
    "title": "Токены безопасности",
    "original": "Security Token",
    "short": "Токен с характеристиками безопасности.",
    "desc": "Как сертификат на акции. Он может обещать права или прибыль. К нему часто применяются более строгие правила."
  },
  "governanceToken": {
    "title": "Токен управления",
    "original": "Governance Token",
    "short": "Токен для участия в принятии решений о правилах.",
    "desc": "Как членская карточка в клубе. Те, у кого есть токены, могут голосовать за правила. Это означает ответственность."
  },
  "liquidityToken": {
    "title": "Токены ликвидности / токены LP",
    "original": "Liquidity Token",
    "short": "Токен за предоставленную ликвидность.",
    "desc": "Это похоже на квитанцию о том, что вы внесли деньги в общий фонд. Вы получаете пропорциональные вознаграждения. Значение может колебаться."
  },
  "nft": {
    "title": "Невзаимозаменяемый токен / NFT",
    "original": "Non-Fungible Token",
    "short": "Уникальный цифровой токен.",
    "desc": "Как подписанная коллекционная вещь. Это представляет собой что-то уникальное, а не взаимозаменяемую монету. Ценность зависит от спроса."
  },
  "cbdc": {
    "title": "Цифровая валюта центрального банка / CBDC",
    "original": "Central Bank Digital Currency",
    "short": "Цифровая валюта, выпущенная центральным банком.",
    "desc": "Как государственные цифровые деньги. Это были бы официальные деньги, просто в цифровой форме. Детали зависят от конкретной страны."
  },
  "transactionStatus": {
    "title": "Статус транзакции",
    "original": "Transaction Status",
    "short": "Указывает, открыта ли транзакция или уже завершена.",
    "desc": "Как отслеживание посылки: в ожидании, подтверждено или не удалось. Это позволяет вам увидеть, все ли прошло гладко. Иногда это требует немного времени."
  },
  "gasFee": {
    "title": "Комиссия за газ",
    "original": "Gas Fee",
    "short": "Плата за вычислительную работу в сети.",
    "desc": "Как плата за обработку на рыночном прилавке. Чем больше занятости, тем дороже это может стать. Не каждый блокчейн называет это газом."
  },
  "onChain": {
    "title": "На цепочке",
    "original": "On-Chain",
    "short": "Происходит непосредственно в блокчейне.",
    "desc": "Как запись непосредственно в кассовую книгу. Каждый может это видеть. Это прозрачно, но часто медленнее или дороже."
  },
  "offChain": {
    "title": "Вне цепи",
    "original": "Off-Chain",
    "short": "Происходит вне цепочки.",
    "desc": "Как устное соглашение, которое позже заносится в журнал. Это может быть быстрее и более экономично. Доверие здесь играет более важную роль."
  },
  "liquidity": {
    "title": "Ликвидность",
    "original": "Liquidity",
    "short": "Показывает, как легко что-то можно решить.",
    "desc": "Количество покупателей и продавцов. Высокая ликвидность означает, что вы можете быстро совершать сделки, не оказывая значительного влияния на цену. Низкая ликвидность ощущается медленной."
  },
  "volatility": {
    "title": "Волатильность",
    "original": "Volatility",
    "short": "Как сильно колеблются цены.",
    "desc": "Как рынок с дикими колебаниями цен. Высокая волатильность означает возможности, но также и риск. Для новичков это может быть стрессово."
  },
  "marketCap": {
    "title": "Рыночная капитализация",
    "original": "Market Capitalization",
    "short": "Полная стоимость монеты или проекта.",
    "desc": "Как общая стоимость всех товаров на рынке. Она приблизительно рассчитывается путем умножения цены на обращающееся количество. Большие значения могут казаться более стабильными, но это не всегда так."
  },
  "circulatingSupply": {
    "title": "Тираж",
    "original": "Circulating Supply",
    "short": "Количество монет, которые фактически находятся в обращении.",
    "desc": "Как количество монет, которые фактически находятся на рынке. Не всё, что существует, уже находится в обращении. Это влияет на цену."
  },
  "priceDiscovery": {
    "title": "Ценообразование",
    "original": "Price Discovery",
    "short": "Цена определяется спросом и предложением.",
    "desc": "Точно так же, как на рынке: спрос и предложение встречаются. Множество небольших решений определяют цену. Нет фиксированного переключателя."
  },
  "spread": {
    "title": "Торговый диапазон",
    "original": "Spread",
    "short": "Разница между покупной ценой и продажной ценой.",
    "desc": "Как в торговом диапазоне в магазине. Чем меньше разница, тем справедливее это воспринимается. Большие спреды делают сделки более дорогими."
  },
  "phishing": {
    "title": "Фишинг",
    "original": "Phishing",
    "short": "Мошенничество через фейковые новости или веб-сайты.",
    "desc": "Как поддельное электронное письмо от банка, которое заманивает вас в ловушку. Цель — заставить вас раскрыть свои данные для входа. Никогда не нажимайте на ссылки вслепую."
  },
  "smartContract": {
    "title": "Умный контракт",
    "original": "Smart Contract",
    "short": "Программа, которая автоматически выполняет фиксированные правила.",
    "desc": "Как автомат, который реагирует по фиксированным правилам. Он выполняет соглашения автоматически. Это экономит доверие, но требует четких правил."
  },
  "programmableLogic": {
    "title": "Автоматические правила",
    "original": "Programmable Logic",
    "short": "Правила, которые автоматически выполняются, когда что-то происходит.",
    "desc": "Как правило \"если-то\" в автомате. Это позволяет управлять процессами без ручного вмешательства каждый раз. Так создаются простые цифровые контракты."
  },
  "networkCongestion": {
    "title": "Использование сети",
    "original": "Network Congestion",
    "short": "Когда одновременно ожидается выполнение большого количества транзакций.",
    "desc": "Как пробки на шоссе. Транзакции занимают больше времени, и комиссии могут увеличиться. При меньшем трафике всё снова ускоряется."
  },
  "blockchainTypes": {
    "title": "Типы блокчейна",
    "original": "Blockchain Types",
    "short": "Существуют различные типы блокчейнов с разнообразными задачами.",
    "desc": "Как разные типы транспортных средств для разных маршрутов. Некоторые предназначены для платежей, другие - для программ. Стоит знать назначение."
  },
  "paymentBlockchain": {
    "title": "Платежный блокчейн",
    "original": "Payment Blockchain",
    "short": "Блокчейн, разработанный для быстрых платежей.",
    "desc": "Как книга учета быстрых денежных операций. Основное внимание уделяется дешевым и быстрым переводам. Функции часто намеренно упрощены."
  },
  "smartContractBlockchain": {
    "title": "Блокчейн умных контрактов",
    "original": "Smart Contract Blockchain",
    "short": "Блокчейн, способный запускать программы и приложения.",
    "desc": "Подобно рынку с множеством машин. В дополнение к платежам, там могут работать правила и приложения. Это делает их универсальными, но часто более сложными."
  },
  "blockchainComparison": {
    "title": "Сравнение блокчейн-технологий",
    "original": "Blockchain Comparison",
    "short": "Сравнение выявляет сильные и слабые стороны различных блокчейнов.",
    "desc": "Подобно сравнению банков или рынков: у каждого есть свои сильные и слабые стороны. Важными аспектами являются стоимость, скорость и безопасность. Не существует идеальной системы для всего."
  },
  "stellarVsBitcoinVsEthereum": {
    "title": "Stellar против Bitcoin против Ethereum",
    "original": "Stellar vs. Bitcoin vs. Ethereum",
    "short": "Три известных блокчейна с различной направленностью.",
    "desc": "Биткоин похож на цифровое золото и часто рассматривается как средство сохранения стоимости. Эфириум подобен платформе для программ и приложений. Stellar сильно ориентирован на доступные платежи."
  }
}
