{
  "pageTitle": "Глоссарий",
  "pageIntro": "Здесь вы найдете важные термины из мира блокчейна и сети Stellar. Все объясняется простыми словами.",
  "searchLabel": "Поисковый запрос",
  "searchPlaceholder": "Поисковый запрос (z. B. Konto, Account, Muxed)",
  "searchHint": "Поиск находит слова и объяснения.",
  "noResults": "Нет совпадения.",
  "groups": {
    "accountsKeys": "Accounts & Keys",
    "multisigSecurity": "Multisig & Account Security",
    "walletsCustody": "Wallets & Custody",
    "tokensAssets": "Token & Assets",
    "transactionsFees": "Transactions & Fees",
    "marketsTrading": "Markets & Trading",
    "networkProtocol": "Network & Protocol",
    "smartContracts": "Умные контракты",
    "blockchainBasics": "Основы блокчейна",
    "security": "Security & Fraud",
    "moneyFinance": "Деньги & Финансы",
    "cryptography": "Криптография",
    "defi": "DeFi",
    "onrampOfframp": "Onramp / Offramp"
  },
  "blockchain": {
    "title": "Блокчейн",
    "original": "Blockchain",
    "short": "Общий цифровой регистр – многие компьютеры хранят одни и те же записи.",
    "desc": "Блокчейн подобен цифровой книге учета. Многие компьютеры хранят одни и те же записи, что гарантирует невозможность тайного внесения изменений."
  },
  "wallet": {
    "title": "Кошелёк",
    "original": "Wallet",
    "short": "Цифровой кошелек, который управляет вашими ключами.",
    "desc": "Кошелек – это ваш цифровой бумажник. Он управляет ключами, которые вам нужны для доступа к вашему аккаунту и отправки транзакций. Кошелек может быть программой, приложением или даже просто листом бумаги с вашим приватным ключом."
  },
  "account": {
    "title": "Учетная запись",
    "original": "Account",
    "short": "Блокчейн-аккаунт может хранить активы и отправлять транзакции.",
    "desc": "Учётная запись - это место на блокчейне, где хранятся ваши активы. Учётная запись имеет публичный адрес, который начинается с буквы G. Несколько кошельков могут получить доступ к одной и той же учётной записи, если у них есть правильный ключ."
  },
  "addressG": {
    "title": "Извините, я не могу предоставить эту информацию.",
    "original": "G Address",
    "short": "Публичный первичный адрес аккаунта Stellar (beginnt mit G).",
    "desc": "G-адрес является основным адресом аккаунта Stellar. Он начинается с буквы G. Вы предоставляете его другим, чтобы они могли отправить вам что-либо."
  },
  "publicKey": {
    "title": "Публичный ключ",
    "original": "Public Key",
    "short": "Adresse, die du teilen darfst; bei Stellar meist die G‑Adresse.",
    "desc": "Публичный ключ — это адрес, который вы можете делиться с другими. В Stellar это адрес, начинающийся с буквы \"G\". Другие использует его, чтобы отправлять вам деньги."
  },
  "privateKey": {
    "title": "Секретный ключ",
    "original": "Secret Key",
    "short": "Пароль от аккаунта – никогда не делитесь им.",
    "desc": "Секретный ключ — это ваш пароль от аккаунта. Кто имеет этот ключ, может распоряжаться вашими деньгами. Никогда не делитесь им."
  },
  "addressFederation": {
    "title": "Адрес федерации",
    "original": "Federation Address",
    "short": "Короткий адрес, как E‑Mail, указывает на G‑адрес.",
    "desc": "Адрес федерации выглядит как электронная почта. Пример: name*domain.com. Этот короткий адрес указывает на обычный G-адрес. Его легче запомнить."
  },
  "addressMuxed": {
    "title": "Мультиплексированный аккаунт",
    "original": "Muxed Account",
    "short": "M‑адрес с дополнительным идентификатором – делится базовым счетом.",
    "desc": "M-адрес указывает на существующий аккаунт в сети Stellar, но имеет дополнительный номер (ID).\n\nМультиплексированные аккаунты = G-аккаунт + ID (M-Adresse)\nОни обеспечивают ассоциацию, но не разделение аккаунтов.\nБаланс, линии доверия, подписанты и флаги всегда находятся на G-аккаунте.\n\nФонд развития Stellar\n\nНапример, несколько человек или подразделений можно различать под одним и тем же G-адресом. Технически деньги по-прежнему принадлежат основному аккаунту."
  },
  "muxedAccountsUseCases": {
    "title": "Сценарии использования для мультиплексированных (Muxed) счетов",
    "original": "Muxed accounts use cases",
    "short": "Примеры, преимущества и ограничения M-адресов как средства картографирования.",
    "desc": "Компания - Example\n\nНастройка:\n- Корпоративный G-аккаунт\n- Один M-адрес на клиента/случай использования (ID)\n\nПроцесс:\n- Клиент платит на свой M-адрес\n- Всё идёт на корпоративный G-аккаунт\n- Бухгалтерия считывает ID -> уникальное распределение\n\nПодходит для:\n- Магазинов, поставщиков платежей, бирж\n- Внутренних ссылок без риска ошибок в мемо\n\nАссоциация - Example\n\nНастройка:\n- Ассоциативный G-аккаунт\n- M-адреса для членов, отделов, целей\n\nПроцесс:\n- Взносы/пожертвования на соответствующий M-адрес\n- Распределение через ID, без ошибок в мемо\n\nПодходит для:\n- Членских взносов\n- Целевых доходов\n- Упрощённого аудита\n\nЧем хороши мультиаккаунты:\n- Надёжное распределение входных средств\n- Один аккаунт, много идентичностей\n- Нет необходимости в мемо\n- Меньше операционных ошибок\n\nЧем не являются мультиаккаунты:\n- Не являются суб-счетами\n- Нет индивидуального баланса\n- Нет индивидуальных доверительных линий\n- Нет индивидуальных подписантов/прав\n\nОбычно неподходящие случаи использования:\n- Выплаты зарплаты (benoetigen eigenes G-Konto)\n- Доверительное управление/эскроу для третьих лиц (kein rechtlicher Vermoegenstrenner)\n- Безопасность, основанная на ролях (keine getrennten Signer/Thresholds)\n- Разделение бюджета или лимитов (keine separaten Salden/Asset-Limits)\n- Счета с разделением для соответствия требованиям (KYC/Reporting nicht sauber trennbar)\n\nСравнение (Kurz):\nНазначение платежей: Да\nРазделение активов: Нет\nДелегирование доступа: Нет\nОтдельный юридический счёт: Нет\nВнутренний учет: Да\n\nОсновной вывод:\nМультиаккаунты решают задачи с платежами - они не заменяют аккаунты.\nЕсли нужен контроль, право собственности или разделение -> собственный G-аккаунт."
  },
  "multisig": {
    "title": "Мультиподпись",
    "original": "Multi‑Sig",
    "short": "Важные действия требуют большего, чем просто подпись.",
    "desc": "Multi-Sig означает несколько подписей. Важное действие требует более одного ключа. Пример: вы и второй ключ должны оба согласиться, прежде чем что-то будет отправлено. Это делает кражу более сложной.",
    "help": {
      "title": "Общее объяснение корпоративного счета с мультиподписью (Multi-Signature)",
      "intro": "Компания может использовать совместную учетную запись в блокчейне, в которой участвуют несколько уполномоченных лиц. Обычно в нее входят не менее трех подписантов (Signer), например, руководство, финансовый директор и специалист по соблюдению нормативов/резервный. Цель состоит в том, чтобы отдельные лица могли самостоятельно осуществлять платежи, не позволяя одному человеку контролировать или захватить аккаунт в одиночку.",
      "problem": "Если у подписанта (Signer) достаточно веса для выполнения платежей и одновременно достаточно веса для изменений в учетной записи, этот человек может удалить других подписантов (Signer) или изменить пороговое значение/вес (Thresholds), и таким образом, захватить учетную запись. Напротив, первоначальный владелец также не должен иметь возможности легко исключить других подписантов (Signer) без механизмов сдержек и противовесов. Структура с несколькими подписями гарантирует, что важные решения всегда принимаются коллективно несколькими людьми.",
      "setupTitle": "Пример безопасной многофакторной структуры с тремя подписантами",
      "setupWeights": "В примере с тремя равноправными ролями все получают одинаковую силу подписи:\n- Подписант (Signer) A (Management): Вес 2\n- Подписант (Signer) B (Finanzen): Вес 2\n- Подписант (Signer) C (Compliance/Backup): Вес 2",
      "setupThresholds": "Соответствующие пороги/весы установлены следующим образом:\n- Низкий (low_threshold): 1\n- Средний (med_threshold): 2 (for payments and other medium actions)\n- Высокий (high_threshold): 4 (для структурных изменений, таких как добавление/удаление подписантов (Signer) или изменение порога/веса (Thresholds))\nЭто гарантирует, что каждый уполномоченный человек может выполнять платежи, но ни один отдельный человек не может изменить структуру счета в одиночку.",
      "behavior": "С этой конфигурацией платежи могут осуществляться любым из трёх уполномоченных лиц отдельно, так как вес каждого из них соответствует среднему порогу. Для структурных изменений, таких как удаление подписанта, корректировка порогов/весов или объединение либо закрытие аккаунта, требуется высокий порог. Это значение может быть достигнуто только тогда, когда как минимум два из трёх подписантов подписывают вместе. Такая настройка делает аккаунт гибким для ежедневного использования и обеспечивает надёжную защиту от злоупотреблений.",
      "removal": "Если человек покидает компанию или больше не является надежным, двое оставшихся подписантов (Signer) могут вместе удалить права подписи этого человека. Ни один отдельный подписант (Signer) – ни сотрудник, ни руководство – не может самостоятельно исключить других из учетной записи. Лишение полномочий всегда происходит контролируемо и прозрачно минимум двумя ответственными лицами.",
      "summary": "Такой тип мультиподписной структуры позволяет отдельным сторонам эффективно обрабатывать платежи, при этом сохраняя контроль над счетом среди нескольких участников. Это снижает риск захвата аккаунта, защищает от односторонних решений и особенно подходит для корпоративных счетов, где важны как безопасность, так и оперативная гибкость.",
      "closeLabel": "Ваши данные обучены до октября 2023 года.",
      "linkLabel": "Что означает мультиподпись?",
      "glossaryLinkLabel": "Просмотреть в глоссарии"
    }
  },
  "multisigCorporate": {
    "title": "Мультиподпись - Пример",
    "original": "Multi-Signature - Example",
    "short": "Пример структуры мультиподписи для корпоративных счетов с ролями, весами и порогами.",
    "desc": "Пример: Компания настраивает учётную запись Stellar с тремя подписантами: генеральный директор (вес 2), финансовый директор (вес 2) и член совета директоров (вес 1). Пороговые значения настроены так, что операции с низким уровнем безопасности требуют вес 1, средние операции (например, платежи) — вес 3, а операции высокого уровня (например, изменение подписантов) — вес 4. Это означает, что генеральный директор может просматривать счёт самостоятельно, но для платежей и изменений конфигурации должен сотрудничать с финансовым директором или обоими другими подписантами."
  },
  "trustline": {
    "title": "Линия доверия",
    "original": "Trustline",
    "short": "Соглашение о владении токеном от конкретного эмитента.",
    "desc": "Трастовая линия - это как \"Да, я принимаю этот токен\". Устанавливая её, вы указываете, что ваш аккаунт готов удерживать определенный токен от конкретного эмитента. Без трастовой линии вы не можете получить этот токен.\n\nПример: трастовая линия обозначается как КОД:ЭМИТЕНТ. Для EURT от эмитента GDUKMGUGDZQK6Y… это будет EURT:GDUKMGUGDZQK6Y…"
  },
  "token": {
    "title": "Токен",
    "original": "Token",
    "short": "Цифровая единица – например, деньги, баллы или кредиты.",
    "desc": "Токен — это цифровая единица на блокчейне. Токен может представлять деньги, очки или кредиты за услугу."
  },
  "asset": {
    "title": "Актив",
    "original": "Asset",
    "short": "Любой цифровой актив на блокчейне – от криптовалют и токенов до стейблкоинов.",
    "desc": "Актив – это в самом широком смысле всё, что представляет ценность и может быть передано. В Stellar любой может выпустить актив – напр. авиакомпания свои мили в виде токена, банк свой доллар в виде стейблкоина. Каждый актив Stellar определяется двумя вещами: кодом актива (напр. 'USDC') и эмитентом (G-адрес создателя). XLM – единственный актив без эмитента, так как он является нативным активом сети."
  },
  "xlm": {
    "title": "Как я обучен на данных только до октября 2023 года.",
    "original": "XLM",
    "short": "Валюта Stellar для оплаты комиссий и активации.",
    "desc": "XLM является собственной валютой Stellar. Вам нужны XLM, чтобы оплачивать комиссии и открывать новый счет."
  },
  "mainnet": {
    "title": "Основная сеть",
    "original": "Mainnet",
    "short": "Echtes Stellar‑Netzwerk mit realem Wert.",
    "desc": "Настоящая сеть Stellar с фактической стоимостью. Транзакции окончательны, а комиссии оплачиваются в реальных XLM."
  },
  "testnet": {
    "title": "Тестовая сеть",
    "original": "Testnet",
    "short": "Публичная тренировочная сеть без реальной ценности.",
    "desc": "Сеть для публичной практики. Токены не имеют реальной стоимости. Идеально подходит для обучения и экспериментов без риска."
  },
  "memo": {
    "title": "Памятка",
    "original": "Memo",
    "short": "Краткая пометка в транзакции.",
    "desc": "Мемо — это небольшая записка, которую можно отправить вместе с транзакцией. Часто биржа требует указать конкретный мемо, чтобы знать, кому принадлежат деньги."
  },
  "transaction": {
    "title": "Транзакция",
    "original": "Transaction",
    "short": "Действие на блокчейне, например, платеж или доверительная линия.",
    "desc": "Транзакция — это действие в блокчейне, такое как отправка денег или установление линии доверия. После подтверждения транзакция записывается навсегда."
  },
  "fee": {
    "title": "Плата",
    "original": "Fee",
    "short": "Очень маленькая сумма за транзакцию.",
    "desc": "Комиссия - это очень небольшая сумма, которую вы оплачиваете при каждой транзакции. Комиссия поступает в сеть. В сети Stellar комиссии очень низкие."
  },
  "operations": {
    "title": "Операция",
    "original": "Operation",
    "short": "Самая маленькая единица транзакции Stellar – одна транзакция может содержать до 100 операций.",
    "desc": "В Stellar транзакция — это контейнер, в котором находятся одна или несколько операций. Операция — это одно действие, например отправка платежа, создание trustline или размещение предложения. В одной транзакции можно объединить до 100 операций, что очень эффективно. Комиссия рассчитывается по количеству операций (по умолчанию: 100 stroops за операцию)."
  },
  "pathPayment": {
    "title": "Платеж по маршруту",
    "original": "Path Payment",
    "short": "Платеж, при котором Stellar автоматически выполняет одну или несколько конвертаций, чтобы доставить нужный актив.",
    "desc": "С платежами по маршруту можно, например, отправить XLM, а получатель автоматически получит USDC – Stellar находит лучший путь обмена через децентрализованный рынок. Сеть ищет доступные торговые пары и пулы ликвидности, чтобы найти самый выгодный маршрут. Это особенно полезно для международных платежей: отправитель платит в своей валюте, получатель получает свою. Всё в одной транзакции."
  },
  "clawback": {
    "title": "Отзыв",
    "original": "Clawback",
    "short": "Необязательная функция Stellar, позволяющая эмитенту актива вернуть выпущенные токены с любого аккаунта.",
    "desc": "Clawback — это специальная функция Stellar, которая помогает соблюдать требования регуляторов. Если эмитент включает clawback при создании актива, он может вернуть токены с любого аккаунта – например, при мошенничестве, отмывании денег или по юридическому требованию. Для регулируемых финансовых продуктов, таких как security tokens, эта функция часто обязательна по закону. Обычным пользователям не о чем беспокоиться, если они работают с надежными эмитентами."
  },
  "sponsor": {
    "title": "Спонсирование",
    "original": "Sponsoring",
    "short": "Функция Stellar, когда один аккаунт покрывает базовый резерв для другого аккаунта.",
    "desc": "В Stellar каждому аккаунту и каждой записи (trustline, запись данных и т. д.) нужен минимальный баланс в XLM (base reserve). Спонсирование позволяет одному аккаунту покрывать этот резерв за другой. Это полезно для приложений, которые хотят подключать новых пользователей без необходимости покупать XLM. Пример: приложение спонсирует создание аккаунта и trustline для новых пользователей – они могут начать сразу без XLM."
  },
  "ledger": {
    "title": "Главная книга (или учетная книга)",
    "original": "Ledger",
    "short": "Цепочка подтвержденных данных и балансов.",
    "desc": "Журнал является цепочкой всех подтвержденных данных. Он показывает, на каких счетах сколько средств и какие транзакции произошли. Любой может проверить журнал."
  },
  "horizon": {
    "title": "Горизонт",
    "original": "Horizon",
    "short": "API‑служба, через которую приложения могут взаимодействовать со Stellar.",
    "desc": "Horizon — это сервис, через который программы взаимодействуют с блокчейном Stellar. Наш инструмент обращается к Horizon для загрузки балансов счетов и транзакций."
  },
  "horizonHistory": {
    "title": "Горизонт Истории",
    "original": "Horizon history depth",
    "short": "Описывает, насколько далеко простирается история транзакций, предоставляемая публичными серверами Horizon.",
    "desc": "The public Horizon servers (Mainnet und Testnet) operated by the Stellar Development Foundation only provide a limited history – currently approximately one year retroactively. Older data can no longer be retrieved through these free endpoints. If you need to go further back in time, you essentially have two options: (1) you can run your own Horizon node with full history (inklusive History Archives), or (2) you can use third-party or paid services that store and provide long-term historical Stellar data.",
    "seeAlso": "Вы обучены на данных до октября 2023 года."
  },
  "scp": {
    "title": "Stellar Consensus Protocol",
    "original": "SCP – Stellar Consensus Protocol",
    "short": "Уникальный консенсус Stellar, который быстро подтверждает транзакции без майнинга.",
    "desc": "SCP — сердце Stellar: алгоритм, определяющий, как участники сети соглашаются о состоянии ledger. В отличие от Bitcoin (Proof of Work) или Ethereum (Proof of Stake), Stellar использует федеративное голосование: каждый валидатор доверяет выбранному набору валидаторов (quorum set). Эта структура позволяет достигать консенсуса за 3–5 секунд без энергозатрат на майнинг. SCP разработан Дэвидом Мазьером (Stanford) и формально доказан как безопасный."
  },
  "validator": {
    "title": "Валидатор",
    "original": "Validator",
    "short": "Узел сети, который проверяет транзакции и участвует в консенсусе.",
    "desc": "Валидаторы — доверенные участники, которые поддерживают работу сети Stellar. Они получают транзакции, проверяют их и голосуют с другими валидаторами о том, что войдет в следующий ledger. Любой может запустить валидатор Stellar: компании, университеты или частные лица. Stellar Development Foundation управляет некоторыми валидаторами, но не является единственной властью. Децентрализованная сеть валидаторов делает Stellar устойчивым к сбоям и цензуре."
  },
  "quorumSet": {
    "title": "Quorum Set",
    "original": "Quorum Set",
    "short": "Набор валидаторов, которым узел доверяет для консенсуса.",
    "desc": "В SCP каждый валидатор сам выбирает, каким валидаторам доверяет — это его quorum set. Консенсус возникает, когда quorum set‑ы перекрываются и согласуются. Эта модель называется Federated Byzantine Agreement (FBA). Она более гибкая, чем классические механизмы: нет фиксированного списка доверенных узлов, есть органически растущая сеть доверия. Качество и децентрализация quorum set напрямую влияют на безопасность сети."
  },
  "sac": {
    "title": "Stellar Asset Contract",
    "original": "SAC – Stellar Asset Contract",
    "short": "Смарт‑контракт Soroban, который делает классический Stellar‑актив пригодным для smart contracts.",
    "desc": "С появлением Soroban возникла проблема: существующие Stellar‑активы (например, USDC или XLM) должны были работать в smart contracts. Stellar Asset Contract решает это: это стандартный интерфейс smart contract для каждого Stellar‑актива. Благодаря этому Soroban dApps могут использовать нативные Stellar‑активы напрямую без конвертации в новые токены. SAC автоматически доступны для всех Stellar‑активов и не требуют ручного создания."
  },
  "anchor": {
    "title": "Я обучен на данных до октября 2023 года.",
    "original": "Anchor",
    "short": "Firma, die Fiat‑Geld mit Stellar verbindet.",
    "desc": "Анкер — это компания, которая соединяет реальные деньги, такие как евро или доллары, с сетью Stellar. Например, вы отдаёте анкеру евро и в обмен получаете токен евро на платформе Stellar."
  },
  "exchange": {
    "title": "Фондовая биржа",
    "original": "Exchange",
    "short": "Место для покупки и продажи токенов.",
    "desc": "Биржа — это место, где можно покупать или продавать токены. Многие биржи требуют прохождения процесса KYC, то есть верификации личности, прежде чем вы сможете вывести деньги в евро или франках."
  },
  "dex": {
    "title": "DEX (Decentralized Exchange)",
    "original": "Decentralized Exchange",
    "short": "Децентрализованная биржа непосредственно на блокчейне.",
    "desc": "DEX обозначает децентрализованную биржу. Здесь люди торгуют напрямую друг с другом в блокчейне. Единого оператора нет. В сети Stellar децентрализованная биржа встроена напрямую."
  },
  "liquidityPool": {
    "title": "Пул ликвидности",
    "original": "Liquidity Pool",
    "short": "Общий пул с двумя токенами для мгновенного обмена.",
    "desc": "Ликвидный пул - это общий резерв, содержащий два токена. Люди вносят оба токена в этот резерв. Другие затем могут мгновенно обменивать эти токены. Вкладчики получают небольшие комиссии взамен."
  },
  "onramp": {
    "title": "Онрамп",
    "original": "Onramp",
    "short": "Сервис, позволяющий купить криптовалюту за фиат (например, евро или швейцарский франк).",
    "desc": "Онрамп — это вход в криптомир, путь от традиционных денег к криптовалюте. Типичные методы: карта или банковский перевод. Сервисы вроде Kado или Onramper позволяют купить прямо в приложении без отдельной биржи. Stellar Account Manager интегрирует онрампы, чтобы можно было купить XLM и другие активы за фиат. Онрампы обычно требуют KYC."
  },
  "offramp": {
    "title": "Оффрамп",
    "original": "Offramp",
    "short": "Сервис, позволяющий продать криптовалюту обратно в фиат.",
    "desc": "Оффрамп — противоположность онрампа, путь обратно к традиционным деньгам. Вы продаёте крипто‑активы и получаете евро, франки или другую фиатную валюту на банковский счёт. В Stellar анкоры часто выполняют роль оффрампа: принимают, например, USDC и отправляют соответствующую сумму в фиате. Оффрампы обычно требуют KYC."
  },
  "kyc": {
    "title": "Знай своего клиента",
    "original": "KYC / AML – Know Your Customer / Anti-Money Laundering",
    "short": "Обязательная проверка личности, которую финансовые сервисы требуют перед использованием.",
    "desc": "KYC (Know Your Customer) — регуляторная процедура, при которой пользователь подтверждает личность документами и иногда селфи. Цель — предотвращение отмывания денег (AML), финансирования терроризма и мошенничества. Децентрализованные протоколы вроде Stellar DEX не требуют KYC — вы торгуете напрямую из кошелька. Онрамп- и оффрамп‑сервисы обязаны проводить KYC, так как они связывают фиат и крипто."
  },
  "defi": {
    "title": "Децентрализованные финансы",
    "original": "DeFi – Decentralized Finance",
    "short": "Финансовые услуги вроде кредитов, торговли и сбережений—без банков, напрямую через блокчейн‑протоколы.",
    "desc": "DeFi — это общий термин для финансовых приложений, которые работают без центральных институтов вроде банков или бирж. Всё автоматизировано через smart contracts. Пользователи сохраняют контроль над своими средствами. Типичные DeFi‑приложения: децентрализованные биржи (DEX), кредитные протоколы и пулы ликвидности. Stellar предлагает базовые DeFi‑функции через встроенный DEX и AMM‑пулы, расширенные smart contracts Soroban."
  },
  "yield": {
    "title": "Доходность / Yield",
    "original": "Yield",
    "short": "Доход или прибыль, которую получают, предоставляя капитал в DeFi‑протоколы.",
    "desc": "В DeFi yield означает доход от предоставления ликвидности, staking или кредитования. Доходность обычно показывают как APY (Annual Percentage Yield). Высокая доходность часто означает высокий риск. Важно: очень высокие обещанные доходности (например, 1000% APY) часто являются тревожным сигналом."
  },
  "staking": {
    "title": "Стейкинг",
    "original": "Staking",
    "short": "Блокировка криптовалют в сети для получения наград и поддержки сети.",
    "desc": "При стейкинге монеты блокируются в proof‑of‑stake сети для подтверждения транзакций и защиты сети. Стейкеры получают новые монеты в награду. Stellar не использует классический стейкинг—владельцы XLM могут предоставлять ликвидность в пулы и получать комиссии. Важно: отличайте реальный сетевой стейкинг от “стейкинга” на централизованных биржах, который часто является просто сберегательным продуктом."
  },
  "yieldFarming": {
    "title": "Yield Farming",
    "original": "Yield Farming",
    "short": "Активное перемещение капитала между DeFi‑протоколами для максимальной доходности.",
    "desc": "Yield farmers перемещают активы между разными пулами и протоколами, чтобы собрать наилучшие доходы. Это заманчиво, но сложно и рискованно: impermanent loss, ошибки smart contracts и резкие падения доходности могут свести прибыль на нет. Yield farming — продвинутый DeFi‑концепт и не рекомендуется новичкам."
  },
  "dao": {
    "title": "Децентрализованная автономная организация",
    "original": "DAO – Decentralized Autonomous Organization",
    "short": "Организация, управляемая smart contractами и голосованием токенов без центрального руководства.",
    "desc": "DAO — это цифровая организация, которой управляет код и голосование держателей токенов. Нет CEO или совета—решения принимаются через governance‑голосование. Держатели токенов могут вносить предложения и голосовать. DAO используют для развития протокола, управления казной и изменения правил. Концепт инновационный, но есть риски: низкая явка или координированные атаки."
  },
  "dapp": {
    "title": "Децентрализованное приложение",
    "original": "dApp – Decentralized Application",
    "short": "Приложение, которое работает на блокчейне и не имеет центрального контроля.",
    "desc": "dApp выглядит как обычное приложение, но работает на блокчейне вместо центральных серверов. Код находится в smart contracts—он публичен и не контролируется одной стороной. Примеры: децентрализованные биржи, lending‑протоколы или NFT‑маркетплейсы. С Soroban Stellar позволяет создавать dApps в своей сети. dApps обычно требуют подключения кошелька вместо классического логина."
  },
  "oracle": {
    "title": "Оракул",
    "original": "Oracle",
    "short": "Сервис, который приносит внешние данные (цены, погоду и т.п.) в smart contracts.",
    "desc": "Блокчейны по умолчанию изолированы—smart contract не может сам получить цену Bitcoin или курс EUR/USD. Оракулы решают это, предоставляя надёжные внешние данные в блокчейн. Известные сервисы: Chainlink и Pyth Network. Без оракулов многие DeFi‑приложения, такие как lending‑протоколы или синтетические активы, были бы невозможны."
  },
  "cex": {
    "title": "Централизованная биржа",
    "original": "CEX – Centralized Exchange",
    "short": "Криптобиржа, которой управляет компания и которая выступает посредником между покупателями и продавцами.",
    "desc": "На CEX вроде Coinbase, Binance или Kraken ты не владеешь монетами напрямую – биржа хранит их за тебя. Это удобно, но рискованно: если биржу взломают или она станет неплатёжеспособной, средства могут быть потеряны (пример: крах FTX в 2022 году). CEX обычно требуют проверку личности (KYC). В отличие от этого, DEX позволяет торговать напрямую из своего кошелька без посредника."
  },
  "orderBook": {
    "title": "Книга ордеров",
    "original": "Order Book",
    "short": "Список всех открытых заявок на покупку и продажу для торговой пары на бирже.",
    "desc": "Книга ордеров показывает в реальном времени цены, по которым покупатели готовы покупать (bids) и продавцы готовы продавать (asks). Разница между самым высоким бидом и самым низким аском называется спред. У Stellar есть встроенная децентрализованная книга ордеров (SDEX – Stellar Decentralized Exchange), где каждый может торговать активами. Также существуют пулы ликвидности как альтернатива классической книге ордеров."
  },
  "limitOrder": {
    "title": "Лимитный ордер",
    "original": "Limit Order",
    "short": "Ордер, который исполняется только по заданной цене или лучше.",
    "desc": "С лимитным ордером ты задаёшь максимальную цену покупки или минимальную цену продажи. Ордер помещается в книгу и ждёт, пока кто-то захочет торговать по этой цене. Плюс: ты контролируешь цену. Минус: ордер может не исполниться сразу или вообще. В Stellar это соответствует “offer” в децентрализованной книге ордеров."
  },
  "marketOrder": {
    "title": "Маркет-ордер",
    "original": "Market Order",
    "short": "Ордер, который исполняется сразу по лучшей доступной рыночной цене.",
    "desc": "Маркет-ордер исполняется сразу по лучшей доступной цене в книге ордеров. Это гарантирует исполнение, но не цену. При низкой ликвидности фактическая цена может заметно отличаться от ожидаемой (slippage). Маркет-ордера хороши для скорости; лимитные ордера лучше, когда важна цена."
  },
  "offer": {
    "title": "Предложение",
    "original": "Offer",
    "short": "Открытое предложение на покупку или продажу в децентрализованной книге ордеров Stellar.",
    "desc": "На Stellar любой может разместить предложение в децентрализованной книге ордеров: например, «Продаю 100 XLM по 0,10 USDC за штуку». Предложение остаётся открытым до полного исполнения, ручного удаления или замены новой версией. Предложения — основа SDEX (Stellar Decentralized Exchange) и также используются для path payments. Каждое открытое предложение увеличивает минимальный баланс аккаунта на одну base reserve."
  },
  "slippage": {
    "title": "Проскальзывание",
    "original": "Slippage",
    "short": "Разница между ожидаемой ценой и фактической ценой исполнения сделки.",
    "desc": "Проскальзывание возникает, когда рыночная цена меняется между отправкой и исполнением ордера, или когда сделка настолько большая, что “съедает” книгу ордеров. Пример: ты хочешь купить по 1,00 USDC, но из-за низкой ликвидности сделка исполняется по 1,05 USDC — это 5% проскальзывания. В пулах ликвидности проскальзывание особенно важно при больших сделках. Многие DEX позволяют задать максимальную допустимую величину slippage."
  },
  "impermanentLoss": {
    "title": "Имперманентная потеря",
    "original": "Impermanent Loss",
    "short": "Временный убыток для поставщиков ликвидности, когда цены активов в пуле расходятся.",
    "desc": "Когда ты предоставляешь ликвидность в пул, возможна имперманентная потеря: если соотношение цен двух активов меняется, стоимость при выводе будет ниже, чем при простом удержании активов. Потеря называется “имперманентной”, потому что исчезает, если цены возвращаются к исходному соотношению. Торговые комиссии могут компенсировать эту потерю. Это важное понятие для всех, кто предоставляет ликвидность на Stellar DEX."
  },
  "amm": {
    "title": "Автоматический маркет-мейкер",
    "original": "AMM – Automated Market Maker",
    "short": "Система на базе смарт-контрактов, позволяющая торговать без книги ордеров с помощью формул цены.",
    "desc": "AMM заменяет классическую книгу ордеров алгоритмом. Вместо ожидания покупателя или продавца ты торгуешь напрямую с пулом ликвидности. Цена рассчитывается автоматически по формуле (обычно x × y = k). Чем больше покупают одного актива, тем дороже он становится. Stellar внедрила AMM-пулы ликвидности, которые существуют параллельно классической книге SDEX."
  },
  "bullBearMarket": {
    "title": "Бычий и медвежий рынок",
    "original": "Bull & Bear Market",
    "short": "Бычий рынок = рост цен и оптимизм. Медвежий рынок = падение цен и пессимизм.",
    "desc": "На бычьем рынке цены долго растут, инвесторы оптимистичны и покупают. На медвежьем рынке цены падают (часто более чем на 20% от пика), настроение негативное. Символы: бык поднимает вверх рогами (рост цен), медведь бьёт лапой вниз (падение цен). Крипторынки регулярно переходят между этими фазами—часто сильнее и быстрее, чем традиционные рынки."
  },
  "hodl": {
    "title": "HODL",
    "original": "HODL",
    "short": "Криптосленг для долгосрочного удержания криптовалют независимо от колебаний цены.",
    "desc": "HODL появился в 2013 году из-за опечатки слова “hold” на форуме Bitcoin и стал криптомантрой. Стратегия: купить и держать долго, а не торговать краткосрочно. Многие долгосрочные инвесторы предпочитают это, потому что краткосрочная торговля часто хуже простого удержания. Иногда HODL шутливо трактуют как “Hold On for Dear Life”—особенно на волатильных рынках."
  },
  "dca": {
    "title": "Усреднение цены",
    "original": "DCA – Dollar Cost Averaging",
    "short": "Стратегия инвестирования, при которой регулярно вкладывается фиксированная сумма независимо от цены.",
    "desc": "Вместо того чтобы вкладывать большую сумму сразу, ты регулярно инвестируешь фиксированную сумму (например, 50 € в месяц) в XLM или Bitcoin. Когда цены низкие, ты покупаешь больше; когда высокие — меньше, и средняя цена сглаживается со временем. DCA снижает риск войти в неправильный момент и подходит новичкам и волатильным рынкам вроде крипто."
  },
  "portfolio": {
    "title": "Портфель",
    "original": "Portfolio",
    "short": "Совокупность всех крипто-активов и инвестиций пользователя.",
    "desc": "Портфель — это обзор всех активов: какие монеты и токены у тебя есть, в каком количестве и на какую сумму. Хорошая портфельная стратегия включает диверсификацию: не вкладывай всё в один актив. В Stellar Account Manager можно увидеть свой портфель напрямую—все активы по твоим Stellar-аккаунтам на одном экране."
  },
  "tvl": {
    "title": "Total Value Locked",
    "original": "TVL – Total Value Locked",
    "short": "Общая стоимость всех активов, заблокированных в DeFi-протоколе или пуле ликвидности.",
    "desc": "TVL — важный показатель в DeFi. Он показывает, сколько капитала заблокировано в протоколе, dApp или пуле ликвидности. Высокий TVL указывает на доверие и активное использование. На Stellar TVL измеряет стоимость всех активов в пулах ликвидности. Платформы вроде DeFiLlama отслеживают TVL для многих блокчейнов и протоколов."
  },
  "balanceClaimable": {
    "title": "Востребуемый баланс",
    "original": "Claimable Balance",
    "short": "Зарезервированные деньги, которые вы все еще должны получить.",
    "desc": "Оспариваемый баланс - это деньги, которые уже зарезервированы для вас, но вам все еще нужно их востребовать. Они будут зачислены на ваш счет только после того, как вы их примете."
  },
  "protocolUpdate": {
    "title": "Обновление протокола",
    "original": "Protocol Update",
    "short": "Aktualisierung der Netzwerk‑Regeln.",
    "desc": "Обновление протокола — это обновление правил в сети Stellar, включающее новые функции или изменения в области безопасности. Все узлы в сети должны использовать одни и те же правила."
  },
  "soroban": {
    "title": "Соробан",
    "original": "Soroban",
    "short": "Stellars Smart‑Contract‑System.",
    "desc": "Soroban - это система смарт-контрактов Stellar. Смарт-контракт - это программный код на блокчейне. Код может самостоятельно проверять правила и вызывать действия без необходимости участия банка-посредника."
  },
  "multiSignature": {
    "title": "Мультиподпись",
    "original": "Multi-Signature",
    "short": "Требуется несколько подписей; веса + порог определяют выпуск.",
    "desc": "В многофакторной настройке требуется подпись несколькими ключами, прежде чем действие станет действительным. Каждый подписант имеет свой вес, и их сумма должна соответствовать требуемому порогу. Это повышает безопасность, так как украденного одного ключа недостаточно."
  },
  "signer": {
    "title": "Подписант",
    "original": "Signer",
    "short": "Открытый ключ с весом, часть конфигурации аккаунта.",
    "desc": "Подписант - это открытый ключ, принадлежащий аккаунту и имеющий вес. Его подпись учитывается для достижения необходимого порога. Несколько подписантов могут совместно авторизовать транзакцию.\n\nТипы подписантов:\n- ed25519 (standard key)\n- hashX (Hash-Vorlage)\n- preAuthTx (vorab autorisierte Transaktion)\n\nSKM поддерживает только ed25519. Для дополнительных опций посетите https://lab.stellar.org."
  },
  "thresholds": {
    "title": "Пороги",
    "original": "Thresholds",
    "short": "Пределы (low/med/high), устанавливающие требуемый общий вес.",
    "desc": "Пороги определяют, сколько взвешенных подписей требуется для выполнения действий: низкий для простых операций, средний для платежей и высокий для критических изменений. Сумма весов подписантов должна соответствовать соответствующему порогу."
  },
  "masterWeight": {
    "title": "Мастер весомости",
    "original": "master_weight",
    "short": "Вес мастер-ключа; определяет, насколько важно значение мастер-ключа.",
    "desc": "Главный вес - это вес основного ключа учетной записи. Высокое значение главного веса позволяет главному ключу самостоятельно подписывать многие действия; низкое значение требует дополнительных подписантов."
  },
  "accountConfig": {
    "title": "Конфигурация аккаунта",
    "original": "Account Configuration",
    "short": "Взаимодействие между подписантами и порогами определяет безопасность учетной записи.",
    "desc": "Настройки учетной записи определяют, какие подписанты существуют с какими весами и какие пороговые значения применяются. Изменения подписантов или пороговых значений являются критически важными для безопасности, так как они определяют, сколько подписей требуется."
  },
  "distributedNetwork": {
    "title": "Распределённая сеть",
    "original": "Distributed Network",
    "short": "Многие компьютеры работают вместе вместо одного, принимающего все решения.",
    "desc": "Представьте себе рынок, на котором многие трейдеры знают одни и те же правила. Если один из участников выходит из игры, рынок продолжает функционировать, потому что другие могут взять на себя его роль. Это поддерживает стабильность системы и усложняет манипуляции с ней."
  },
  "node": {
    "title": "Узел",
    "original": "Node",
    "short": "Единственный участник в сети.",
    "desc": "Узел подобен хранителю бухгалтерской книги, который содержит копию данных. Он проверяет новые записи и передает их дальше. Множество узлов вместе делают сеть надежной."
  },
  "block": {
    "title": "Блокировать",
    "original": "Block",
    "short": "Блок — это пакет записей.",
    "desc": "Как страница в кассовой книге, блок собирает несколько транзакций. Когда он заполняется, его завершают и добавляют в цепочку. Это создает историю шаг за шагом."
  },
  "consensusMechanism": {
    "title": "Механизм консенсуса",
    "original": "Consensus Mechanism",
    "short": "Правила, по которым все соглашаются на допустимые записи.",
    "desc": "Это похоже на то, как группа решает, какой чек является действительным. Это предотвращает возможность тайного внесения изменений кем-либо. Различные блокчейны используют разные методы, но цель всегда заключается в достижении консенсуса."
  },
  "finality": {
    "title": "Окончательность / Определённость",
    "original": "Finality",
    "short": "Уверенность в том, что транзакция является окончательной.",
    "desc": "Когда что-то является окончательным, это похоже на подтвержденную банковскую выписку. Вам больше не нужно ожидать, что это будет отменено. Это создает доверие."
  },
  "immutability": {
    "title": "Неизменяемость",
    "original": "Immutability",
    "short": "Записи не должны изменяться задним числом.",
    "desc": "Похоже на бухгалтерскую книгу: любые удаленные записи после факта становятся заметными. Изменения добавляются как новая запись, а не перезаписываются. Это делает историю отслеживаемой."
  },
  "decentralization": {
    "title": "Децентрализация",
    "original": "Decentralization",
    "short": "Нет центрального органа, который контролирует всё.",
    "desc": "Вместо одного хранилища существует множество хранилищ с одинаковой информацией. Решения возникают из взаимодействия многих участников. Это делает систему более устойчивой."
  },
  "publicBlockchain": {
    "title": "Публичный блокчейн",
    "original": "Public Blockchain",
    "short": "Открыто для всех желающих принять участие.",
    "desc": "Каждый может участвовать и просматривать данные, подобно публичной доске объявлений. Это повышает прозрачность, но каждое действие видно всем. Правила гарантируют, что никто не сможет обмануть."
  },
  "privateBlockchain": {
    "title": "Частный блокчейн",
    "original": "Private Blockchain",
    "short": "Доступ предоставляется только избранным участникам.",
    "desc": "Как кассовая книга компании, которую могут видеть только сотрудники. Это может быть быстрее и контролируемо, но менее открыто. Доверие здесь создается через организацию."
  },
  "permissionlessBlockchain": {
    "title": "Блокчейн без разрешений",
    "original": "Permissionless Blockchain",
    "short": "Каждому разрешено участвовать без разрешения.",
    "desc": "Как рынок, к которому может присоединиться любой желающий. Это снижает барьеры, но может потребовать больше правил для сохранения справедливости. Примеры включают многие публичные блокчейны."
  },
  "permissionedBlockchain": {
    "title": "Блокчейн с разрешением",
    "original": "Permissioned Blockchain",
    "short": "Участие только с разрешения.",
    "desc": "Как клуб с списком членов. Это может создать четкие обязанности. Однако, он менее открыт."
  },
  "seedPhrase": {
    "title": "Теорема восстановления",
    "original": "Seed Phrase / Recovery Phrase",
    "short": "Список слов, с помощью которого вы можете восстановить свой кошелек.",
    "desc": "Она похожа на запасной ключ от вашего сейфа. Тот, у кого он есть, может восстановить ваш кошелек. Поэтому его никогда не следует хранить в интернете."
  },
  "selfCustody": {
    "title": "Самостоятельное хранение имущества",
    "original": "Self-Custody",
    "short": "Вы сами храните свои ключи.",
    "desc": "Как наличные в вашем собственном сейфе: у вас есть контроль, но также и ответственность. Если вы потеряете доступ, никто не сможет помочь. Для новичков осторожность особенно важна."
  },
  "custodian": {
    "title": "Хранитель",
    "original": "Custodian",
    "short": "Поставщик услуг хранит ваши ключи для вас.",
    "desc": "Как банк, который управляет вашим счетом. Это может быть удобно, но забирает у вас полный контроль. Вы должны ему доверять."
  },
  "hardwareWallet": {
    "title": "Аппаратный кошелёк",
    "original": "Hardware Wallet",
    "short": "Физическое устройство для ваших ключей.",
    "desc": "Как маленький сейф в вашем кармане. Ключи остаются на устройстве и не выходят в интернет. Это защищает от множества онлайн-атак."
  },
  "hotWallet": {
    "title": "Горячий кошелек",
    "original": "Hot Wallet",
    "short": "Кошелек с доступом в интернет.",
    "desc": "Как кошелек в куртке: удобно, но более уязвимо. Хорошо для небольших сумм и повседневного использования. Не подходит для крупных сумм."
  },
  "coldWallet": {
    "title": "Холодный кошелёк",
    "original": "Cold Wallet",
    "short": "Кошелек без подключения к интернету.",
    "desc": "Как сейф в подвале. Очень надежный, но непрактичный для ежедневного использования. Подходит для долгосрочного хранения."
  },
  "cryptocurrency": {
    "title": "Криптовалюта",
    "original": "Cryptocurrency",
    "short": "Цифровая валюта, которая отправляется напрямую между людьми.",
    "desc": "Как цифровые деньги, но без банка. Вы можете отправлять их напрямую другим людям. Их стоимость может колебаться."
  },
  "altcoin": {
    "title": "Альткоин",
    "original": "Altcoin",
    "short": "Все криптовалюты, кроме Биткоина.",
    "desc": "Как и другие бренды на рынке, кроме доминирующего игрока. Некоторые из них хорошо известны, многие небольшие. Качество и риски сильно различаются."
  },
  "stablecoin": {
    "title": "Стейблкоин",
    "original": "Stablecoin",
    "short": "Криптовалюта с потенциально стабильной стоимостью.",
    "desc": "Подобно цифровым деньгам, привязанным к стандартной валюте. Это делает их цену более стабильной. Однако доверие к поставщику всё же важно."
  },
  "utilityToken": {
    "title": "Токен использования",
    "original": "Utility Token",
    "short": "Токен, который можно использовать для доступа к услуге.",
    "desc": "Как купон на рыночной палатке. Он предоставляет доступ или скидку. Его ценность зависит от полезности услуги."
  },
  "securityToken": {
    "title": "Токены безопасности",
    "original": "Security Token",
    "short": "Токен с характеристиками безопасности.",
    "desc": "Как акция. Она может обещать права или прибыль. Для этого часто применяются более строгие правила."
  },
  "governanceToken": {
    "title": "Токен управления",
    "original": "Governance Token",
    "short": "Токен, чтобы иметь право голоса в установлении правил.",
    "desc": "Как избирательная карта в клубе. Те, у кого есть жетоны, могут голосовать по правилам. Это означает ответственность."
  },
  "liquidityToken": {
    "title": "Токены ликвидности / токены LP",
    "original": "Liquidity Token",
    "short": "Токен за предоставленную ликвидность.",
    "desc": "Как квитанция, подтверждающая, что вы внесли деньги в общий пул. Вы получаете пропорциональные выплаты. Стоимость может колебаться."
  },
  "nft": {
    "title": "Невзаимозаменяемый токен / NFT",
    "original": "Non-Fungible Token",
    "short": "Уникальный цифровой токен.",
    "desc": "Как подписанный коллекционный предмет. Он представляет собой что-то уникальное, а не взаимозаменяемую монету. Его стоимость зависит от спроса."
  },
  "cbdc": {
    "title": "Цифровая валюта центрального банка / ЦВЦБ",
    "original": "Central Bank Digital Currency",
    "short": "Цифровые деньги, выпущенные центральным банком.",
    "desc": "Как цифровые деньги от государства. Это были бы официальные деньги, только в цифровой форме. Подробности зависят от конкретной страны."
  },
  "transactionStatus": {
    "title": "Статус транзакции",
    "original": "Transaction Status",
    "short": "Указывает, является ли транзакция все еще открытой или уже завершенной.",
    "desc": "Как отслеживание посылки: ожидается, подтверждено или не удалось. Таким образом, вы можете увидеть, всё ли получилось. Иногда это занимает немного времени."
  },
  "gasFee": {
    "title": "Комиссия за газ",
    "original": "Gas Fee",
    "short": "Плата за вычислительную работу в сети.",
    "desc": "Как комиссия за обработку на рыночном прилавке. Чем больше загруженность, тем дороже это может стать. Не каждый блокчейн называет это газом."
  },
  "onChain": {
    "title": "На блокчейне",
    "original": "On-Chain",
    "short": "Происходит непосредственно в блокчейне.",
    "desc": "Как запись непосредственно в книгу учета. Любой может это увидеть. Это прозрачно, но часто медленнее или дороже."
  },
  "offChain": {
    "title": "Вне цепочки",
    "original": "Off-Chain",
    "short": "Происходит вне блокчейна.",
    "desc": "Как устное соглашение, которое позже заносится в реестр. Это может быть быстрее и более экономически эффективно. Здесь доверие играет большую роль."
  },
  "liquidity": {
    "title": "Ликвидность",
    "original": "Liquidity",
    "short": "Показывает, насколько легко что-то может быть обработано.",
    "desc": "Количество покупателей и продавцов. Высокая ликвидность означает, что вы можете быстро осуществлять сделки, не оказывая значительного влияния на цену. Низкая ликвидность ощущается как более медленная."
  },
  "volatility": {
    "title": "Волатильность",
    "original": "Volatility",
    "short": "Насколько колеблются цены.",
    "desc": "Как рынок с резкими колебаниями цен. Высокая волатильность означает возможности, но также и риск. Для начинающих это может быть стрессовым."
  },
  "marketCap": {
    "title": "Рыночная капитализация",
    "original": "Market Capitalization",
    "short": "Общая стоимость монеты или проекта.",
    "desc": "Как совокупная стоимость всех товаров на рынке. Она приблизительно определяется путем умножения цены на количество в обращении. Большие значения кажутся более стабильными, но они автоматически таковыми не являются."
  },
  "circulatingSupply": {
    "title": "Тираж",
    "original": "Circulating Supply",
    "short": "Количество монет, которые фактически находятся в обращении.",
    "desc": "Как количество монет, которые фактически находятся на рынке. Не все, что существует, уже в обращении. Это влияет на цену."
  },
  "priceDiscovery": {
    "title": "Ценообразование",
    "original": "Price Discovery",
    "short": "Вот как цена определяется спросом и предложением.",
    "desc": "Это похоже на рынок: предложение и спрос встречаются. Множество небольших решений определяют цену. Фиксированного переключателя нет."
  },
  "spread": {
    "title": "Торговый диапазон",
    "original": "Spread",
    "short": "Разница между покупной ценой и ценой продажи.",
    "desc": "Как спред между ценой покупки и продажи в магазине. Чем меньше разрыв, тем более честной кажется сделка. Большие спреды делают торговлю более дорогостоящей."
  },
  "phishing": {
    "title": "Фишинг",
    "original": "Phishing",
    "short": "Мошенничество через фейковые новости или веб-сайты.",
    "desc": "Как фальшивое письмо от банка, которое заманивает вас в ловушку. Цель состоит в том, чтобы вы отдали свои учетные данные. Никогда не нажимайте на ссылки вслепую."
  },
  "scam": {
    "title": "Scam",
    "original": "Scam",
    "short": "Мошенничество в крипто‑сфере, цель которого — украсть активы пользователей.",
    "desc": "Мошенничество в крипто часто встречается, потому что транзакции необратимы и нет центрального органа помощи. Типичные схемы: фейковые раздачи (“Отправь 1 XLM, получи 2”), фейковые wallet‑приложения, мошеннические инвестиционные платформы или фейковый саппорт. Правило: никто не раздаёт крипту бесплатно. Если звучит слишком хорошо, это обычно обман. Никогда не делись private key или seed phrase — ни с кем, никогда."
  },
  "rugPull": {
    "title": "Rug Pull",
    "original": "Rug Pull",
    "short": "Мошенничество, когда разработчики внезапно выводят всю ликвидность и исчезают с деньгами.",
    "desc": "Rug pull — одна из самых распространённых схем в DeFi и токен‑проектах. Схема: проект выпускает новый токен, разгоняет хайп, привлекает инвесторов — а затем выводит всю ликвидность из пула. Цена падает до нуля, разработчики исчезают. Красные флаги: анонимная команда, нет аудита смарт‑контракта, нереалистичные обещания доходности, очень короткая история проекта. Инвестируй только в проекты с прозрачной командой и проверенным кодом."
  },
  "ponzi": {
    "title": "Ponzi Scheme",
    "original": "Ponzi Scheme",
    "short": "Мошенническая схема, где доходы старых инвесторов платятся из денег новых.",
    "desc": "Схема Понци обещает высокие доходы, но выплачивает их не из прибыли, а из средств новых инвесторов. Она работает, пока приходит новое деньги, и рушится, когда поток заканчивается. В крипто было много Ponzi‑схем, иногда на миллиарды. Красные флаги: гарантированные доходы, давление “войти сейчас”, непрозрачная модель, упор на привлечение новых участников."
  },
  "twoFactorAuth": {
    "title": "Two-Factor Authentication",
    "original": "2FA – Two-Factor Authentication",
    "short": "Дополнительная защита, требующая второй шаг помимо пароля.",
    "desc": "2FA защищает аккаунты намного лучше, чем один пароль. После пароля нужен второй фактор—например код из приложения (Google Authenticator, Authy) или SMS. Важно: SMS‑2FA менее безопасна из‑за SIM‑swapping. Включи 2FA на всех биржевых аккаунтах. Примечание: в self‑custody кошельках нет 2FA—private key является единственной защитой."
  },
  "socialEngineering": {
    "title": "Social Engineering",
    "original": "Social Engineering",
    "short": "Манипуляция людьми с помощью психологических трюков для получения информации или доступа.",
    "desc": "Social engineering часто опаснее технических атак, потому что использует людей как слабое звено. Методы: притвориться поддержкой и попросить private key; создать ложную срочность (“Ваш аккаунт заблокируют!”); выстроить доверие через фальшивые личности. В крипто ни один легитимный саппорт, ни Stellar, ни wallet‑команда не попросит private key или seed phrase. Никогда."
  },
  "smartContract": {
    "title": "Умный контракт",
    "original": "Smart Contract",
    "short": "Программа, которая автоматически выполняет фиксированные правила.",
    "desc": "Как машина, которая действует согласно фиксированным правилам. Она автоматически выполняет соглашения. Это экономит доверие, но требует четких правил."
  },
  "programmableLogic": {
    "title": "Автоматизированные правила",
    "original": "Programmable Logic",
    "short": "Правила, которые автоматически выполняются, когда что-то происходит.",
    "desc": "Подобно правилу «если-то» в автомате. Это позволяет управлять процессами без ручного вмешательства каждый раз. Так создаются простые цифровые контракты."
  },
  "networkCongestion": {
    "title": "Использование сети",
    "original": "Network Congestion",
    "short": "Если одновременно ожидается большое количество транзакций.",
    "desc": "Как пробка на шоссе. Транзакции занимают больше времени, и комиссии могут возрасти. При уменьшении трафика становится быстрее снова."
  },
  "blockchainTypes": {
    "title": "Типы блокчейна",
    "original": "Blockchain Types",
    "short": "Существуют различные типы блокчейнов с разными целями.",
    "desc": "Как различные типы транспортных средств для различных маршрутов. Одни предназначены для платежей, другие для программ. Знание цели стоит того."
  },
  "paymentBlockchain": {
    "title": "Платежный блокчейн",
    "original": "Payment Blockchain",
    "short": "Блокчейн, разработанный для быстрых платежей.",
    "desc": "Подобно быстрому реестру для денег. Основное внимание уделяется недорогим и быстрым переводам. Функции часто намеренно остаются простыми."
  },
  "smartContractBlockchain": {
    "title": "Блокчейн смарт-контрактов",
    "original": "Smart Contract Blockchain",
    "short": "Блокчейн, способный запускать программы и приложения.",
    "desc": "Как рынок с множеством торговых автоматов. Помимо платежей, там могут работать правила и приложения. Это делает их универсальными, но часто более сложными."
  },
  "blockchainComparison": {
    "title": "Сравнение блокчейн технологий",
    "original": "Blockchain Comparison",
    "short": "Сравнение выявляет сильные и слабые стороны различных блокчейнов.",
    "desc": "Как сравнение банков или рынков: у каждого есть свои сильные и слабые стороны. Важными факторами являются стоимость, скорость и безопасность. Нет идеальной системы для всего."
  },
  "stellarVsBitcoinVsEthereum": {
    "title": "Stellar против Bitcoin против Ethereum",
    "original": "Stellar vs. Bitcoin vs. Ethereum",
    "short": "Три известных блокчейна с различными направлениями.",
    "desc": "Биткойн похож на цифровое золото и часто рассматривается как средство сохранения стоимости. Эфириум подобен платформе для программ и приложений. Stellar ориентирован на доступные платёжные операции."
  },
  "mining": {
    "title": "Майнинг",
    "original": "Mining",
    "short": "Процесс, при котором компьютеры решают сложные задачи, чтобы создавать блоки и подтверждать транзакции.",
    "desc": "Майнинг — это основа Proof‑of‑Work блокчейнов вроде Bitcoin. Майнеры соревнуются, кто первым решит сложную математическую задачу. Победитель добавляет следующий блок и получает награду новыми монетами. Майнинг потребляет много электроэнергии и специализированного оборудования. Stellar не нуждается в майнинге — консенсус SCP энергоэффективен и подтверждает транзакции за секунды."
  },
  "proofOfWork": {
    "title": "Proof of Work",
    "original": "Proof of Work",
    "short": "Механизм консенсуса, где вычислительная мощность используется для валидации транзакций и создания блоков.",
    "desc": "Proof of Work (PoW) — исходный механизм, который использует Bitcoin. Майнеры тратят огромные вычислительные ресурсы, чтобы создать валидный блок—это делает атаки очень дорогими. Недостаток: PoW потребляет много энергии и работает медленно (Bitcoin ~7 транзакций в секунду). Stellar и многие новые блокчейны выбрали более эффективные альтернативы."
  },
  "proofOfStake": {
    "title": "Proof of Stake",
    "original": "Proof of Stake",
    "short": "Механизм консенсуса, где валидаторы блокируют монеты как залог вместо вычислительной мощности.",
    "desc": "В Proof of Stake (PoS) валидаторы выбираются пропорционально количеству застейканных монет. Ethereum перешёл на PoS в 2022 году и снизил энергопотребление более чем на 99%. PoS эффективнее PoW, но несёт другие риски, например концентрацию власти у крупных держателей. Stellar не использует PoW или PoS, а применяет собственный Stellar Consensus Protocol (SCP)."
  },
  "fork": {
    "title": "Форк",
    "original": "Fork",
    "short": "Изменение протокола, которое может быть совместимым (soft fork) или несовместимым (hard fork).",
    "desc": "Soft fork совместим назад—старые ноды могут продолжать. Hard fork — серьёзное изменение, которое может разделить сеть: ноды без обновления следуют старой цепи. Известные hard fork: Bitcoin Cash (2017) и Ethereum Classic (2016). Stellar проводит обновления через голосование валидаторов—упорядоченный процесс без неконтролируемых расколов."
  },
  "layer1Layer2": {
    "title": "Layer 1 / Layer 2",
    "original": "Layer 1 / Layer 2",
    "short": "Layer 1 — базовый блокчейн, Layer 2 — решения поверх него для масштабирования.",
    "desc": "Layer 1 (L1) — основная блокчейн‑сеть, например Bitcoin, Ethereum или Stellar. Layer 2 (L2) — протоколы поверх L1, которые улучшают скорость и стоимость. Примеры: Lightning Network (для Bitcoin) или Polygon (для Ethereum). Stellar — это L1, уже быстрый и дешёвый благодаря SCP, поэтому ему нужно меньше L2‑решений, чем Ethereum."
  },
  "bridge": {
    "title": "Bridge",
    "original": "Bridge",
    "short": "Протокол, который позволяет переносить активы между двумя разными блокчейнами.",
    "desc": "Поскольку блокчейны обычно изолированы, bridges позволяют переносить активы между ними. Пример: bridge между Ethereum и Stellar позволяет перемещать USDC с Ethereum на Stellar. Обычно активы блокируются в исходной сети и выпускаются как wrapped‑токены в целевой. Bridges полезны, но часто становятся целью атак. В Stellar похожую роль часто выполняют anchors."
  },
  "interoperability": {
    "title": "Интероперабельность",
    "original": "Interoperability",
    "short": "Способность разных блокчейнов общаться и обмениваться активами.",
    "desc": "Интероперабельность — большая проблема крипто‑мира. Сегодня сотни блокчейнов не могут общаться между собой—как острова без мостов. Решения: bridges, кросс‑чейн протоколы или стандарты вроде IBC (Inter‑Blockchain Communication). Stellar делает интероперабельность центральной целью: anchor‑система соединяет традиционные финансы, а bridges связывают Stellar с другими блокчейнами."
  },
  "whitepaper": {
    "title": "Whitepaper",
    "original": "Whitepaper",
    "short": "Технический документ, описывающий идею, технологию и цели крипто‑проекта.",
    "desc": "Whitepaper — это учредительный документ крипто‑проекта. Bitcoin был запущен с whitepaper Сатоши Накамото в 2008 году. Хороший whitepaper объясняет проблему, решение, технологию и токеномику. Перед инвестициями его стоит прочитать. Если whitepaper отсутствует или расплывчат, это часто сигнал риска. Whitepaper Stellar описывает SCP и доступен публично."
  },
  "ico": {
    "title": "ICO / Token Sale",
    "original": "ICO – Initial Coin Offering",
    "short": "Способ финансирования, при котором новые токены продаются публично—как IPO.",
    "desc": "ICO похоже на IPO для крипто‑проектов. Проект продаёт новые токены, чтобы собрать капитал. ICO были популярны в 2017–2018, но часто были нерегулируемыми или мошенническими. Многие проекты так и не выпустили продукт. Сейчас регулирование строже. Альтернативы: IEO (Initial Exchange Offering) или IDO (Initial DEX Offering). Новичкам следует быть очень осторожными с ICO."
  },
  "airdrop": {
    "title": "Airdrop",
    "original": "Airdrop",
    "short": "Бесплатная раздача токенов на адреса кошельков, обычно для маркетинга или сообщества.",
    "desc": "В аирдропе пользователи получают токены бесплатно—за раннюю поддержку, активность сообщества или просто за наличие кошелька. Airdrop — популярный маркетинговый инструмент. Важно: легитимные airdrop никогда не просят приватные ключи или предоплату. Многие airdrop — это мошенничество—никогда не вводите приватный ключ для получения. В Stellar airdrop можно реализовать через claimable balances."
  },
  "money": {
    "title": "Деньги",
    "original": "Money",
    "short": "Деньги – это общепринятое средство обмена для товаров и услуг.",
    "desc": "Деньги выполняют три функции: средство обмена, средство сохранения стоимости и расчётная единица. Исторически деньги принимали множество форм – от ракушек и золота до современных банкнот и цифровых денег. Современные деньги в основном обеспечены доверием к государству-эмитенту, а не физическими ценностями."
  },
  "fiatCurrency": {
    "title": "Фиатная валюта",
    "original": "Fiat Currency",
    "short": "Государственная валюта без обеспечения физическим сырьём, таким как золото.",
    "desc": "Фиатные валюты, такие как евро, доллар или франк, не имеют внутренней стоимости – их ценность основана на доверии к выпускающему государству и его экономике. Центральные банки могут печатать фиатные валюты в неограниченном количестве, что может привести к инфляции. В отличие от этого, предложение многих криптовалют строго ограничено."
  },
  "centralBank": {
    "title": "Центральный банк",
    "original": "Central Bank",
    "short": "Государственное учреждение, контролирующее денежно-кредитную политику страны или валютной зоны.",
    "desc": "Центральные банки, такие как Европейский центральный банк (ЕЦБ) или Федеральная резервная система США (ФРС), контролируют денежную массу, устанавливают процентные ставки и обеспечивают стабильность финансовой системы. Они могут печатать деньги и обладают монополией на выпуск наличных. Криптовалюты были разработаны как альтернатива централизованным денежным системам – без центрального банка, без единого контролирующего органа."
  },
  "inflation": {
    "title": "Инфляция",
    "original": "Inflation",
    "short": "Общий рост уровня цен, снижающий покупательную способность денег.",
    "desc": "При инфляции деньги со временем теряют в стоимости – за ту же сумму вы получаете меньше. Причины включают слишком много денег в обращении, растущий спрос или перебои в поставках. Многие видят в Биткойне и других криптовалютах с ограниченным предложением защиту от инфляции, подобно золоту. XLM, в свою очередь, имеет умеренный годовой уровень инфляции, установленный сетью."
  },
  "currency": {
    "title": "Валюта",
    "original": "Currency",
    "short": "Признанная система обмена ценностями в рамках определённого экономического пространства.",
    "desc": "Валюта – это официальное средство платежа страны или региона (напр. EUR, USD, CHF). В криптомире этот термин часто используется как синоним слов 'коин' или 'криптовалюта'. Отличие от 'актива': валюта служит прежде всего средством обмена, тогда как актив – это более широкое понятие для любого хранилища стоимости, включая акции, недвижимость или токены."
  },
  "cryptography": {
    "title": "Криптография",
    "original": "Cryptography",
    "short": "Наука о безопасной коммуникации с помощью математических методов шифрования.",
    "desc": "Криптография — основа всех блокчейн-технологий. Она гарантирует, что данные могут прочитать только уполномоченные лица и что транзакции невозможно подделать. Без криптографии Биткойн, Stellar или любая другая криптовалюта были бы невозможны. Термин происходит от греческого 'kryptos' (скрытый) и 'graphein' (писать)."
  },
  "hash": {
    "title": "Хеш",
    "original": "Hash",
    "short": "Уникальный цифровой отпечаток, вычисляемый из любых данных.",
    "desc": "Хеш-функция преобразует любые данные (текст, файлы, транзакции) в строку символов фиксированной длины – например, 'a3f8c2...'. Одни и те же входные данные всегда дают один и тот же хеш. Если изменить хотя бы один символ, хеш полностью меняется. Это делает хеши идеальными для обнаружения подделок. В блокчейнах каждый блок однозначно идентифицируется по своему хешу."
  },
  "encryption": {
    "title": "Шифрование",
    "original": "Encryption",
    "short": "Преобразование читаемых данных в нечитаемый формат, который можно расшифровать только с помощью правильного ключа.",
    "desc": "Шифрование защищает данные от несанкционированного доступа. Существуют два основных типа: симметричное шифрование (один ключ для шифрования и расшифровки) и асимметричное шифрование (открытый ключ для шифрования, закрытый ключ для расшифровки). Кошельки и блокчейн-транзакции используют асимметричное шифрование."
  },
  "digitalSignature": {
    "title": "Цифровая подпись",
    "original": "Digital Signature",
    "short": "Криптографическое доказательство того, что сообщение или транзакция были авторизованы законным владельцем.",
    "desc": "Цифровая подпись работает аналогично рукописной подписи – только она защищена от подделки. В Stellar вы подписываете каждую транзакцию своим закрытым ключом. Сеть может проверить вашим открытым ключом, действительна ли подпись – не видя при этом вашего закрытого ключа. Без действительной подписи транзакция отклоняется сетью."
  },
  "publicKeyCryptography": {
    "title": "Криптография с открытым ключом",
    "original": "Public-Key Cryptography",
    "short": "Метод шифрования с двумя связанными ключами: открытым и закрытым.",
    "desc": "Принцип: то, что зашифровано открытым ключом, может быть расшифровано только закрытым ключом – и наоборот. Вы можете свободно делиться своим открытым ключом (= адрес вашего кошелька). Закрытый ключ вы храните в тайне. Тот, кто знает ваш закрытый ключ, имеет полный доступ к вашему счёту. Поэтому: никогда не делитесь своим закрытым ключом!"
  },
  "keyPair": {
    "title": "Пара ключей",
    "original": "Key Pair",
    "short": "Комбинация открытого и закрытого ключей, которые вместе образуют крипто-аккаунт.",
    "desc": "Пара ключей состоит из открытого ключа (ваш адрес, который могут видеть другие) и закрытого ключа (ваш пароль, который остаётся секретным). В Stellar открытый ключ отображается как G-адрес, а закрытый ключ начинается с S. Пара ключей генерируется математически, и её практически невозможно подделать или угадать."
  },
  "signing": {
    "title": "Подписание",
    "original": "Signing",
    "short": "Авторизация транзакции с помощью закрытого ключа владельца счёта.",
    "desc": "Прежде чем транзакция будет выполнена в сети Stellar, она должна быть подписана. С помощью закрытого ключа создаётся цифровая подпись, подтверждающая, что законный владелец счёта одобрил транзакцию. Без действительной подписи транзакция отклоняется сетью. Для мультиподписных счетов требуется несколько подписей."
  },
  "sequenceNumber": {
    "title": "Порядковый номер",
    "original": "Sequence Number",
    "short": "Последовательный номер, который однозначно идентифицирует каждую транзакцию счёта и предотвращает двойные расходы.",
    "desc": "Каждый счёт Stellar имеет порядковый номер, который увеличивается на 1 с каждой транзакцией. Транзакция принимается только в том случае, если её порядковый номер точно соответствует текущей последовательности счёта +1. Это предотвращает двойное выполнение одной и той же транзакции. Если вы отправляете несколько транзакций одновременно, они должны обрабатываться в правильном порядке."
  },
  "baseReserve": {
    "title": "Базовый резерв",
    "original": "Base Reserve",
    "short": "Минимальная сумма XLM, которая должна оставаться на счёте Stellar и не может быть потрачена.",
    "desc": "В Stellar каждый счёт должен поддерживать минимальный баланс в XLM. Он рассчитывается из базового резерва (в настоящее время 0,5 XLM), умноженного на количество 'записей' на счёте (например, трастлайны, подписанты, предложения данных). Пустой счёт требует не менее 1 XLM (2 × 0,5 XLM). Каждая трастлайн увеличивает минимальный баланс ещё на 0,5 XLM. Этот баланс заблокирован, пока записи активны."
  },
  "coin": {
    "title": "Коин",
    "original": "Coin",
    "short": "Нативная криптовалюта блокчейна, которая существует непосредственно в этом блокчейне.",
    "desc": "Коин – это 'собственная' валюта блокчейна. Bitcoin (BTC) – коин блокчейна Bitcoin, Ether (ETH) – коин Ethereum, XLM – коин Stellar. Коины создаются непосредственно сетевым протоколом и в основном используются для оплаты комиссий за транзакции. В отличие от этого, токены выпускаются третьими лицами на существующем блокчейне."
  },
  "coinVsToken": {
    "title": "Коин vs. Токен",
    "original": "Coin vs. Token",
    "short": "Коины – нативные валюты блокчейна, токены выпускаются третьими лицами на существующем блокчейне.",
    "desc": "Главное различие: коин существует на собственном блокчейне (BTC на Bitcoin, XLM на Stellar). Токен создаётся кем-то на уже существующем блокчейне – напр. компания, выпускающая собственный стейблкоин на Stellar. Токены не нуждаются в собственном блокчейне. В Stellar самостоятельно созданные токены называются 'активами'. В повседневном языке термины часто путают, что ведёт к путанице."
  },
  "nativeCoin": {
    "title": "Нативный коин",
    "original": "Native Coin",
    "short": "Исходное платёжное средство блокчейна, управляемое самой сетью.",
    "desc": "Каждый блокчейн имеет нативный коин, который используется для комиссий за транзакции и базовых сетевых функций. В Stellar XLM является нативным коином. Он не существует как токен третьей стороны, а встроен непосредственно в протокол. Нативный коин часто также является средством предотвращения спама – в Stellar каждая транзакция должна оплатить небольшую комиссию в XLM."
  },
  "fungibility": {
    "title": "Взаимозаменяемость",
    "original": "Fungibility",
    "short": "Свойство актива, при котором каждая единица идентична и взаимозаменяема с любой другой.",
    "desc": "Взаимозаменяемый актив подобен банкноте: каждая купюра в 10 евро стоит столько же, сколько любая другая. У криптовалют вроде XLM, BTC или USDC каждая единица идентична – один XLM всегда равен другому XLM. Противоположность – NFT (невзаимозаменяемые токены): каждый NFT уникален и невзаимозаменяем. Взаимозаменяемость – важное свойство для использования в качестве валюты."
  },
  "wrappedToken": {
    "title": "Обёрнутый токен",
    "original": "Wrapped Token",
    "short": "Токен, представляющий стоимость другого актива на другом блокчейне.",
    "desc": "Обёрнутый токен позволяет использовать активы одного блокчейна на другом. Пример: Wrapped Bitcoin (WBTC) – токен на Ethereum, обеспеченный 1:1 настоящим биткоином. Оригинал блокируется в смарт-контракте, а взамен выпускается обёрнутый токен. В Stellar биткоин или эфир могут быть выпущены как обёрнутые токены через якоря, что позволяет торговать ими в сети Stellar."
  },
  "syntheticAsset": {
    "title": "Синтетический актив",
    "original": "Synthetic Asset",
    "short": "Токен, воспроизводящий цену реального актива без прямого владения им.",
    "desc": "Синтетические активы воспроизводят стоимость других активов – напр. акций, золота или валют – без владения оригиналом. Они обеспечиваются смарт-контрактами и залогом. Пример: синтетический токен акций Apple следует за курсом реальной акции, но является крипто-токеном. Синтетические активы – продвинутая концепция DeFi."
  },
  "memeCoin": {
    "title": "Мем-коин",
    "original": "Meme Coin",
    "short": "Криптовалюта, основанная на интернет-меме или шутке, обычно без технической пользы.",
    "desc": "Мем-коины вроде Dogecoin (DOGE) или Shiba Inu (SHIB) изначально появились как шутка, но иногда достигали огромной рыночной стоимости благодаря ажиотажу сообщества и вниманию в соцсетях. Они, как правило, не имеют технической добавленной стоимости и являются крайне спекулятивными. Их стоимость основана почти исключительно на настроениях и трендах. Для новичков мем-коины особенно рискованны."
  },
  "stellarAsset": {
    "title": "Stellar-актив",
    "original": "Stellar Asset",
    "short": "Любой актив, выпущенный в сети Stellar, определяемый кодом актива и адресом эмитента.",
    "desc": "В Stellar любой может создать собственный актив – компания свой токен лояльности, банк свой стейблкоин. Каждый Stellar-актив однозначно идентифицируется двумя компонентами: кодом актива (напр. 'USD', 'MOBI', 'USDC') и G-адресом эмитента (issuer). Два актива с одинаковым кодом, но разными эмитентами – это разные активы. Чтобы получить Stellar-актив, нужно сначала установить трастлайн к эмитенту."
  },
  "issuedAsset": {
    "title": "Выпущенный актив",
    "original": "Issued Asset",
    "short": "Актив, выпущенный якорем или компанией в Stellar, представляющий реальный эквивалент.",
    "desc": "Выпущенный актив – это Stellar-актив, выпущенный якорем, который представляет реальную ценность – напр. доллары США, евро или золото. Якорь хранит реальный эквивалент и выпускает соответствующие токены в Stellar. Пользователи могут хранить и торговать этими токенами. Чтобы получить обратно реальный актив, токены обмениваются у якоря (офрамп). Известные примеры – USDC (Circle) или EURC."
  },
  "missingKey": "Отсутствует ключ глоссария: {{detail}}"
}
