{
  "title": "Создать аккаунт + мультиподпись",
  "menu": "Создать учетную запись + Мультиподпись",
  "menuHint": "Создайте новую учетную запись и при желании настройте мультиподпись.",
  "hint": "Создайте новую учетную запись, активируйте ее и по желанию настройте мультиподпись.",
  "generateKeys": "Создать ключ",
  "enableMultisig": "Включить мультиподпись",
  "instructions": {
    "public": "Поделитесь этим публичным ключом с другими для осуществления платежей.",
    "secret": "Храните этот секретный ключ в безопасности; никогда не делитесь им."
  },
  "generateFirst": "Пожалуйста, сначала сгенерируйте пару ключей.",
  "confirmLowBalance": "Начальный баланс {bal} XLM ниже рекомендуемого резерва {req} XLM (Подписанты: {count}). Продолжить?",
  "activated": "Учетная запись была активирована. Хэш: {hash}",
  "activatedTestnet": "Учётная запись была активирована в тестовой сети с помощью Friendbot.",
  "alreadyActive": "Учетная запись уже активирована.",
  "createdNoSigners": "Аккаунт создан, мультиподпись не настроена.",
  "createdAndConfigured": "Аккаунт создан и мультиподпись настроена. Хэш: {hash}",
  "info": {
    "more": "Ваша обучающая база данных охватывает период до октября 2023 года.",
    "keysOnPage": {
      "title": "Ключ на этой странице",
      "text": "На этой странице генерируются ключи. Храните их в безопасности и не делитесь ими."
    },
    "title": "Важная информация",
    "secureKeys": {
      "title": "Защитите закрытый ключ",
      "text": "Публичный ключ может быть безопасно передан – он подобен номеру счета.\n\nСекретный ключ – это доступ к вашему счету. Обращайтесь с ним как с паролем:\n• Никогда не храните его в облачных сервисах, электронной почте или в небезопасных заметках\n• Запишите его на бумаге или используйте аппаратный кошелек\n• Создайте несколько резервных копий и храните их в безопасных, раздельных местах\n• При утере секретного ключа доступ к счету будет безвозвратно утерян"
    },
    "multisigSection": {
      "title": "Мультиподпись (Multisig)",
      "text": "С помощью Multisig (мультиподписи) вы можете назначить нескольких подписантов для своего аккаунта. Тогда для транзакций потребуется подписи от нескольких, например, 2 из 3.\n\nПреимущества:\n• Повышенная безопасность (ein kompromittierter Key reicht nicht)\n• Совместные счета (z. B. Firmen, Partnerschaften)\n• Экстренное восстановление (mehrere Backups bei verschiedenen Personen)\n\nПРЕДУПРЕЖДЕНИЕ: Протестируйте Multisig сначала в тестовой сети, прежде чем внедрять его в основной сети! Неправильная конфигурация может привести к потере доступа к аккаунту."
    },
    "diagram": {
      "title": "Срок действия подписи истек"
    }
  },
  "activateHint": "Активация необходима для существования аккаунта. В тестовой сети это можно сделать с помощью Friendbot, а в основной сети через \"Создать аккаунт\" из существующего кошелька.",
  "activateNow": "Активируйте аккаунт немедленно.",
  "activateOnly": "Просто активируйте.",
  "balanceWarning": "Начальный баланс, вероятно, слишком мал, чтобы добавить {{count}} дополнительных подписантов (минимальный резерв: {{req}} XLM).",
  "createButton": "Создать/Настроить мультиподпись",
  "mainnetActivateNote": "Примечание: Дополнительные резервы необходимы для мультиподписи. 1 XLM часто бывает недостаточно.",
  "reserve": {
    "base": "Базовый резерв за запись: {{val}} XLM",
    "recommended": "Рекомендуемый начальный баланс: {{val}} XLM (inkl. Puffer)",
    "required": "Требуемый Минимальный Резерв (neu): {{val}} XLM"
  },
  "signersCountLimit": "Примечание: Граница сети (Stellar): макс. 20 дополнительных подписантов.",
  "startingBalance": "Первоначальный кредит (Initial credit)",
  "keyWarning": {
    "title": "⚠️ Обезопасьте ваш ключ сейчас!",
    "text1": "Вы создали новую пару ключей.",
    "text2": "Сразу же обеспечьте безопасность ОБОИХ ключей, прежде чем продолжать:",
    "list1": "Открытый ключ: адрес вашего аккаунта, который можно поделиться",
    "list2": "Секретный ключ: Ваш пароль – НИКОГДА не делитесь им и не храните его в Интернете!",
    "list3": "Если секретный ключ утерян, доступ безвозвратно потерян.",
    "confirm": "У меня есть оба ключа."
  },
  "muxedId": "Объединенный-ID",
  "muxedInfo": "С помощью Muxed-ID создается M-адрес (M...). Он указывает на тот же аккаунт, что и обычный адрес (G...).",
  "muxedIdInvalid": "Muxed ID должен быть целым числом в диапазоне от 0 до 18,446,744,073,709,551,615.",
  "muxedAddress": "Смешанный адрес",
  "muxedActivationInfo": "Мультиплексированные адреса являются псевдонимами адресов. Их не нужно активировать отдельно."
}
