{
  "title": "Общее объяснение корпоративного счета с мультиподписью (Multi-Signature)",
  "intro": "Компания может использовать совместный блокчейн-счет, в котором участвуют несколько уполномоченных лиц. Обычно в нем задействованы как минимум три подписанта (Signer), например, руководство, финансовый директор и специалист по соблюдению нормативных требований/резерв. Цель заключается в том, чтобы отдельные лица могли самостоятельно осуществлять платежи, не имея при этом единоличного контроля или возможности захватить управление счетом.",
  "problem": "Если подписант (Signer) имеет достаточный вес для выполнения платежей и одновременно достаточно веса для изменения учетной записи, он может убрать других подписантов (Signer) или изменить порог/вес (Thresholds), и таким образом захватить учетную запись. Наоборот, первоначальный владелец также не должен иметь возможности исключать других подписантов (Signer) без механизмов проверки и балансировки. Структура с несколькими подписями обеспечивает, что важные решения всегда поддерживаются несколькими людьми совместно.",
  "setupTitle": "Пример безопасной многоступенчатой структуры с тремя подписантами",
  "setupWeights": "В примере с тремя эквивалентными ролями все получают одинаковую силу подписи:\n- Подписант (Signer) A (management): вес 2\n- Подписант (Signer) B (Finanzen): вес 2\n- Подписант (Signer) C (Compliance/Backup): вес 2",
  "setupThresholds": "Установлены соответствующие пороги/весовые коэффициенты:\n- Низкий (low_threshold): 1\n- Средний (med_threshold): 2 (for payments and other medium actions)\n- Высокий (high_threshold): 4 (для структурных изменений, таких как добавление/удаление подписантов (Signer) или изменение порога/весового коэффициента (Thresholds))\nЭта настройка позволяет каждому уполномоченному лицу выполнять платежи, но ни одно лицо не может самостоятельно изменить структуру учетной записи.",
  "behavior": "С этой конфигурацией платежи могут осуществляться любым из трех уполномоченных лиц индивидуально, поскольку вес каждого из них соответствует среднему порогу/весу (Threshold). Однако для структурных изменений, таких как удаление подписанта (Signers), корректировка порогов/весов или слияние или закрытие счета, требуется высокий порог/вес (high_threshold). Это значение может быть достигнуто только в том случае, если как минимум два из трех подписантов (Signer) подпишутся вместе. Таким образом, счет остается гибким для повседневного использования и в то же время хорошо защищенным от злоупотреблений.",
  "removal": "Wenn eine Person das Unternehmen verlässt oder nicht mehr vertrauenswürdig ist, können zwei der verbleibenden Unterzeichner (Signer) gemeinsam die Signaturrechte dieser Person entfernen. Kein einzelner Unterzeichner (Signer) – weder ein Mitarbeiter noch die Geschäftsführung – kann andere eigenständig aus dem Konto ausschließen. Der Entzug von Berechtigungen erfolgt also immer kontrolliert und nachvollziehbar durch mindestens zwei Verantwortliche.",
  "summary": "Этот тип мультиподписной структуры позволяет отдельным лицам эффективно обрабатывать платежи, сохраняя при этом контроль над счетом в руках нескольких сторон. Это снижает риск захвата счета, защищает от односторонних решений и особенно подходит для корпоративных счетов, где важны как безопасность, так и операционная гибкость.",
  "closeLabel": "Вы обучены данным до октября 2023 года.",
  "linkLabel": "Мультиподпись означает необходимость наличия нескольких подписей для одобрения транзакции или осуществления определенного действия в системе. Это повышает уровень безопасности и часто используется в криптовалютных кошельках, чтобы снизить риск мошенничества и несанкционированного доступа."
}