{
  "title": "Общее объяснение корпоративного счета с несколькими подписями (Multi-Signature)",
  "intro": "Компания может использовать общий аккаунт в блокчейне, который включает несколько уполномоченных лиц. Обычно в этом процессе участвуют как минимум три подписанта (Signer), например, представители руководства, финансовый сотрудник и ответственный за соблюдение нормативов/резервирование. Цель состоит в том, чтобы отдельные лица могли самостоятельно осуществлять платежи, без возможности какого-либо одного человека полностью контролировать или захватить аккаунт.",
  "problem": "Если подписант (Signer) имеет достаточно \"вес\" для выполнения платежей и в то же время достаточно \"вес\" для изменения учётной записи, этот человек мог бы удалить других подписантов (Signer) или изменить пороги/веса (Thresholds), таким образом овладев учётной записью. В свою очередь, исходный владелец не должен иметь возможность просто исключить других подписантов (Signer) без соответствующих проверок и балансов. Структура с несколько подписантами (multi-sig) обеспечивает, чтобы важные решения всегда поддерживались совместно несколькими людьми.",
  "setupTitle": "Пример безопасной структуры с мультиподписью с тремя подписантами",
  "setupWeights": "В примере с тремя равными ролями все получают одинаковую силу подписи:\n- Подписант (Signer) A (management): вес 2\n- Подписант (Signer) B (Finanzen): вес 2\n- Подписант (Signer) C (Compliance/Backup): вес 2",
  "setupThresholds": "Соответствующие пороги/весовые коэффициенты установлены следующим образом:\n- Низкий (low_threshold): 1\n- Средний (med_threshold): 2 (for payments and other medium actions)\n- Высокий (high_threshold): 4 (для структурных изменений, таких как добавление/удаление подписантов (Signer) или изменение порога/веса (Thresholds))\nЭто позволяет каждому уполномоченному лицу выполнять платежи, но ни одно отдельное лицо не может в одиночку изменить структуру учетной записи.",
  "behavior": "С этой конфигурацией платежи могут проводиться индивидуально любым из трёх уполномоченных лиц, так как индивидуальный вес соответствует среднему порогу. Однако структурные изменения, такие как удаление подписанта, корректировка порогов/весов или слияние или закрытие счёта, требуют высокого порога. Эта величина может быть достигнута только тогда, когда как минимум двое из трёх подписантов подписываются вместе. Такая настройка сохраняет гибкость счёта для повседневного использования, обеспечивая при этом сильную защиту от злоупотреблений.",
  "removal": "Если человек покидает компанию или становится ненадежным, двое из оставшихся подписантов (Signer) могут совместно лишить этого человека прав на подпись. Ни один отдельный подписант (Signer) – ни сотрудник, ни руководство – не может самостоятельно исключать других из учетной записи. Таким образом, лишение полномочий всегда происходит контролируемо и прозрачно, при участии минимум двух ответственных лиц.",
  "summary": "Этот тип мультиподписной структуры позволяет отдельным лицам эффективно обрабатывать платежи, в то время как контроль над счетом остается у нескольких сторон. Это снижает риск захвата аккаунта, защищает от односторонних решений и особенно подходит для корпоративных счетов, где важны как безопасность, так и операционная гибкость.",
  "closeLabel": "Ваши данные обновлены до октября 2023 года.",
  "linkLabel": "«Мультиподпись» означает использование нескольких подписей для авторизации транзакции в блокчейне или криптовалютных системах. Это требует, чтобы несколько сторон подписали транзакцию, прежде чем она будет считаться действительной. Мультиподпись повышает безопасность и децентрализацию, так как уменьшает риск мошенничества или потери средств, если один из ключей будет скомпрометирован."
}