{
  "title": "Общее объяснение многоподписной (Multi-Signature) корпоративной учетной записи",
  "intro": "Компания может использовать общий аккаунт на блокчейне, в котором участвуют несколько уполномоченных лиц. Как правило, в процесс вовлечены, по крайней мере, три подписанта (Signer), например, представитель руководства, финансовый директор и сотрудник по вопросам соблюдения правил/резервный. Цель состоит в том, чтобы отдельные лица могли самостоятельно осуществлять платежи, при этом ни одно из лиц не могло бы контролировать или захватить аккаунт в одиночку.",
  "problem": "Если подписант (Signer) имеет достаточный вес для выполнения платежей и одновременно обладает достаточным весом для внесения изменений в учетную запись, он может удалить других подписантов (Signer) или изменить порог/вес (Thresholds) и таким образом захватить учетную запись. Наоборот, первоначальный владелец не должен иметь возможность легко исключать других подписантов (Signer) без механизмов сдержек и противовесов. Структура с несколькими подписями гарантирует, что важные решения всегда принимаются совместно несколькими людьми.",
  "setupTitle": "Пример безопасной структуры с многоподписью с тремя подписантами",
  "setupWeights": "В примере с тремя равноценными ролями, все получают одинаковую силу подписи:\n- Подписант (Signer) A (Management): Вес 2\n- Подписант (Signer) B (Finanzen): Вес 2\n- Подписант (Signer) C (Compliance/Backup): Вес 2",
  "setupThresholds": "Установлены соответствующие пороговые значения/веса:\n- Низкий (low_threshold): 1\n- Средний (med_threshold): 2 (for payments and other medium actions)\n- Высокий (high_threshold): 4 (для структурных изменений, таких как добавление/удаление подписантов (Signer) или изменение порога/веса (Thresholds))\nЭто позволяет каждому уполномоченному лицу совершать платежи, но ни один человек не может в одиночку изменить структуру учетной записи.",
  "behavior": "С этой конфигурацией платежи могут выполняться любым из трех уполномоченных лиц самостоятельно, так как индивидуальный вес всегда соответствует среднему порогу. Для структурных изменений, таких как удаление подписанта, изменение порогов/весов или слияние или закрытие счета, требуется высокий порог. Это значение может быть достигнуто только в том случае, если по крайней мере двое из трех подписантов подпишут вместе. Таким образом, счет остается гибким в повседневном использовании, одновременно будучи хорошо защищенным от злоупотреблений.",
  "removal": "Wenn eine Person das Unternehmen verlässt oder nicht mehr vertrauenswürdig ist, können zwei der verbleibenden Unterzeichner (Signer) gemeinsam die Signaturrechte dieser Person entfernen. Kein einzelner Unterzeichner (Signer) – weder ein Mitarbeiter noch die Geschäftsführung – kann andere eigenständig aus dem Konto ausschließen. Der Entzug von Berechtigungen erfolgt also immer kontrolliert und nachvollziehbar durch mindestens zwei Verantwortliche.",
  "summary": "Этот тип мультиподписи позволяет отдельным лицам эффективно обрабатывать платежи, сохраняя при этом контроль над аккаунтом несколькими сторонами. Он снижает риск захвата аккаунта, защищает от односторонних решений и особенно подходит для корпоративных аккаунтов, где важны как безопасность, так и оперативная гибкость.",
  "closeLabel": "Закрыть",
  "linkLabel": "Что означает многофакторная подпись (multi-signature)?"
}