{
  "info": "Вводите свой секретный ключ только если вы хотите подписывать транзакции. Без секретного ключа вы можете только читать.",
  "clearSession": "Удалить секрет сессии",
  "clearSessionHint": "Удалите сохраненный секретный ключ из сессии.",
  "mismatch": "Введённый секретный ключ не соответствует загруженному открытому ключу.",
  "cleared": "Секретный ключ удалён из сессии.",
  "empty": "Поле для секретного ключа пусто.",
  "invalid": "Недействительный секретный ключ.",
  "label": "Введите исходный секретный ключ (S-Key)",
  "placeholder": "например",
  "valid": "✅ Секретный ключ действителен.",
  "remember": {
    "label": "Запомните секретный ключ для этой сессии.",
    "hint": "При включении ключ будет храниться до закрытия вкладки и использоваться повторно для дальнейших платежей."
  },
  "showMultisigInfo": "Информация",
  "hideMultisigInfo": "Вы обучены на данных вплоть до октября 2023 года.",
  "multipleSignersThresholdInfo": "Порог для этого действия: {{threshold}}. Обычно требуется как минимум {{requiredSigners}} подписантов (depending on their weights).",
  "localFlow": {
    "title": "Alle Signaturen lokal eingeben & senden",
    "body": "В этом диалоге вы вводите все необходимые секретные ключи локально на этом устройстве. Затем транзакция полностью подписывается и отправляется непосредственно в сеть.",
    "stepAllKeys": "Введите все необходимые секретные ключи на этом устройстве.",
    "stepSend": "Транзакция затем полностью подписывается и отправляется непосредственно."
  },
  "multisigOptions": {
    "title": "Варианты подписи для этой мультиподписной учетной записи",
    "distributed": {
      "title": "Стандарт: Распределенный мультиподписной поток",
      "body": "По умолчанию эта сессия подписывается только вашим собственным закрытым ключом. Дополнительные подписи добавляются с помощью экспортированных файлов XDR или идентификатора задачи от других подписантов."
    },
    "localAll": {
      "title": "Введите все подписи локально.",
      "body": "Выберите этот вариант, только если вы контролируете все секретные ключи, связанные с этой учетной записью (z. B. nach einer Kontorettung mit mehreren Unterzeichnern). Затем Stellar Account Manager соберет все подписи локально и отправит транзакцию напрямую в Horizon.",
      "checkboxLabel": "Вводите все подписи локально в этом диалоге и отправляйте их напрямую.",
      "warning": "Примечание: Когда вы вводите все подписи локально, все закрытые ключи присутствуют в этой сессии. Используйте эту опцию только на доверенных устройствах."
    }
  },
  "multisigInfo": {
    "summary": {
      "single": "Этот аккаунт использует единственную подпись.",
      "multi": "Эта учётная запись использует несколько подписей (Multisig)."
    },
    "requiredThreshold": "Требуемый порог ({{level}}): {{value}}",
    "thresholdLabel": "Порог",
    "masterWeightLabel": "Вес мастер-счета",
    "masterHint": "Мастер-аккаунт — это текущий загруженный аккаунт, из которого исходит эта операция.",
    "currentWeightLabel": "Введенный вес",
    "weightLabel": "Взвешивание",
    "signers": "Список подписантов",
    "master": "Главный ключ",
    "signerDisabled": "Деактивирован подписант (вес = 0)",
    "masterExplanation": "Основная учетная запись соответствует текущей загруженной учетной записи. Изначально у нее были все права, прежде чем были добавлены дополнительные подписанты."
  },
  "jobSign": {
    "masterOnly": "Только мастер-ключ этого аккаунта может подписать этот шаг.",
    "anyActive": "Мастер-вес равен 0. Пожалуйста, введите секретный ключ одного из перечисленных подписантов с весом > 0."
  },
  "operations": {
    "payment": "Оплата",
    "setOptions": "Configuration (Signers & Thresholds)",
    "changeTrust": "Изменить кредитный лимит",
    "unknown": "Данные до октября 2023 года."
  }
}