{
  "pageTitle": "Sanasto",
  "pageIntro": "Täältä löydät tärkeitä termejä lohkoketjumaailmasta ja Stellar-verkosta. Kaikki on selitetty yksinkertaisin sanoin.",
  "searchLabel": "Hakusana",
  "searchPlaceholder": "Hakutermi (z. B. Konto, Account, Muxed)",
  "searchHint": "Haku löytää sanoja ja selityksiä.",
  "noResults": "Ei osumaa.",
  "groups": {
    "accountsKeys": "Accounts & Keys",
    "multisigSecurity": "Multisig & tilin turvallisuus",
    "walletsCustody": "Wallets & Custody",
    "tokensAssets": "Token & Assets",
    "transactionsFees": "Transactions & Fees",
    "marketsTrading": "Markets & Trading",
    "networkProtocol": "Verkko & Protokolla",
    "smartContracts": "Älysopimukset",
    "blockchainBasics": "Lohkoketjun perusteet",
    "security": "Security & Fraud",
    "moneyFinance": "Raha & Rahoitus",
    "cryptography": "Kryptografia",
    "defi": "DeFi",
    "onrampOfframp": "Onramp / Offramp"
  },
  "blockchain": {
    "title": "Lohkoketju",
    "original": "Blockchain",
    "short": "Jaettu digitaalinen pääkirja – monet tietokoneet tallentavat samat merkinnät.",
    "desc": "Lohkoketju on kuin digitaalinen pääkirja. Monet tietokoneet tallentavat samat merkinnät, varmistaen, ettei kukaan voi salaa tehdä muutoksia."
  },
  "wallet": {
    "title": "Lompakko",
    "original": "Wallet",
    "short": "Digitaalinen lompakko, joka hallitsee avaimesi.",
    "desc": "Lompakko on digitaalinen kukkarosi. Se hallitsee avaimia, joita tarvitset tilisi käyttämiseen ja tapahtumien lähettämiseen. Lompakko voi olla ohjelma, sovellus tai jopa vain paperi, jossa on yksityinen avaimesi."
  },
  "account": {
    "title": "Tili",
    "original": "Account",
    "short": "Lohkoketjutili voi pitää hallussaan varoja ja lähettää transaktioita.",
    "desc": "Tili on paikka lohkoketjussa, jossa omaisuutesi säilytetään. Tilillä on julkinen osoite, joka alkaa kirjaimella G. Useat lompakot voivat käyttää samaa tiliä, jos niillä on oikea avain."
  },
  "addressG": {
    "title": "G osoite",
    "original": "G Address",
    "short": "Stellarin tilin julkinen ensisijainen osoite (beginnt mit G).",
    "desc": "G-osoite on Stellarin tilin pääosoite. Se alkaa kirjaimella G. Annat sen toisille, jotta he voivat lähettää sinulle jotain."
  },
  "publicKey": {
    "title": "Julkinen avain",
    "original": "Public Key",
    "short": "Adresse, die du teilen darfst; bei Stellar meist die G‑Adresse.",
    "desc": "Julkinen avain on osoite, jonka saat jakaa. Stellarissa tämä on G-osoite. Muut käyttävät sitä lähettääkseen sinulle rahaa."
  },
  "privateKey": {
    "title": "Salainen avain",
    "original": "Secret Key",
    "short": "Tilin salasana – älä koskaan jaa sitä.",
    "desc": "Salainen avain on tilisi salasana. Kenellä tahansa on tämä avain, voi siirtää rahasi. Älä koskaan jaa sitä."
  },
  "addressFederation": {
    "title": "Liiton osoite",
    "original": "Federation Address",
    "short": "Kurze Adresse wie E‑Mail, zeigt auf eine G‑Adresse.",
    "desc": "Liittouman osoite näyttää sähköpostiosoitteelta. Esimerkki: nimi*domain.com. Tämä lyhyt osoite viittaa normaaliin G-osoitteeseen. Se on helpompi muistaa."
  },
  "addressMuxed": {
    "title": "Muxed-tili",
    "original": "Muxed Account",
    "short": "M‑address with additional ID – shares a base account.",
    "desc": "M-osoite viittaa olemassa olevaan Stellar-tiliin, mutta siinä on lisänumero (ID).\n\nYhdistetyt tilit = G-tili + ID (M-Adresse)\nNe tarjoavat yhdistämisen, mutta eivät tilien erottelua.\nSaldo, luottorajalinjat, allekirjoittajat ja liput ovat aina G-tilillä.\n\nStellar Development Foundation\n\nEsimerkiksi useat henkilöt tai osastot voidaan erottaa saman G-osoitteen alla. Teknisenä asiana rahat kuuluvat edelleen päätilille."
  },
  "muxedAccountsUseCases": {
    "title": "Sekoitustilien käyttötapaukset",
    "original": "Muxed accounts use cases",
    "short": "Esimerkit, edut ja rajoitukset M-osoitteista kartoitusapuna.",
    "desc": "Yritys - Esimerkki\n\nAsennus:\n- Yrityksen G-tili\n- Yksi M-osoite per asiakas/käyttötapaus (ID)\n\nProsessi:\n- Asiakas maksaa M-osoitteeseensa\n- Kaikki menee yrityksen G-tilille\n- Kirjanpito lukee tunnisteen -> yksilöllinen kohdistus\n\nSoveltuu:\n- Kaupoille, maksupalveluntarjoajille, pörsseille\n- Sisäiset viitteet ilman muistioiden riskejä\n\nYhdistys - Esimerkki\n\nAsennus:\n- Yhdistyksen G-tili\n- Jäsenten, osastojen, tarkoitusten M-osoitteet\n\nProsessi:\n- Jäsenmaksu/lahjoitus asianmukaiseen M-osoitteeseen\n- Kohdistus tunnisteen avulla, ei muistiovirheitä\n\nSoveltuu:\n- Jäsenmaksuihin\n- Korvamerkittyihin tuloihin\n- Helppoon tarkastukseen\n\nMissä Muxed Accounts loistavat:\n- Vahva syötteen kohdistus\n- Yksi tili, useita identiteettejä\n- Ei muistiovaatimusta\n- Vähemmän toimintavirheitä\n\nMissä Muxed Accounts eivät ole:\n- Eivät ole alipäällisiä\n- Ei erillistä saldoa\n- Ei yksittäisiä luottorajoja\n- Ei yksittäisiä allekirjoittajia/oikeuksia\n\nTyypillisesti soveltumattomat käyttötapaukset:\n- Palkkamaksut/palkkatilit (benoetigen eigenes G-Konto)\n- Luottamus/escrow kolmansille osapuolille (kein rechtlicher Vermoegenstrenner)\n- Roolipohjainen turvallisuus (keine getrennten Signer/Thresholds)\n- Budjetin tai rajan erottelu (keine separaten Salden/Asset-Limits)\n- Vaadittujen sääntöjen erottamat tilit (KYC/Reporting nicht sauber trennbar)\n\nVertailu (Kurz):\nMaksujen allokointi: Kyllä\nOmaisuuden erottelu: Ei\nPääsyn delegointi: Ei\nOikeudellisesti erillinen tili: Ei\nSisäinen kirjanpito: Kyllä\n\nTärkein huomio:\nMuxed Accounts koskevat maksuja - ne eivät korvaa tilejä.\nJos tarvitaan hallintaa, omistusta tai erottamista -> oma G-tili."
  },
  "multisig": {
    "title": "Moniallekirjoitus",
    "original": "Multi‑Sig",
    "short": "Tärkeät toimenpiteet vaativat enemmän kuin pelkän allekirjoituksen.",
    "desc": "Multi-Sig tarkoittaa useita allekirjoituksia. Tärkeä toimenpide vaatii useamman kuin yhden avaimen. Esimerkki: Sinun ja toisen avaimen on molempien suostuttava ennen kuin jotain lähetetään. Tämä tekee varkaudesta vaikeampaa.",
    "help": {
      "title": "Moniallekirjoitus (Multi-Signature) yritystilin yleinen selitys",
      "intro": "Yritys voi käyttää jaettua blockchain-tiliä, johon osallistuu useita valtuutettuja henkilöitä. Tyypillisesti tilillä on vähintään kolme allekirjoittajaa (Signer), esimerkiksi johto, talousjohtaja ja säännösten noudattamisesta/varajärjestelmästä vastaava henkilö. Tavoitteena on, että yksittäiset henkilöt voivat suorittaa maksuja itsenäisesti ilman että yksittäinen henkilö voi hallita tai ottaa tiliä haltuunsa yksin.",
      "problem": "Jos allekirjoittajalla (Signer) on riittävästi painoarvoa maksujen suorittamiseen ja samalla riittävästi painoarvoa tilin muutoksiin, hän voi poistaa muita allekirjoittajia (Signer) tai säätää kynnystä/painotusta (Thresholds) ja siten ottaa tilin haltuunsa. Vastaavasti alkuperäisen omistajan ei tulisi myöskään pystyä helposti sulkemaan muita allekirjoittajia (Signer) pois ilman tarkastuksia ja tasapainotuksia. Moniallekirjoitusrakenne varmistaa, että tärkeät päätökset tehdään aina kollektiivisesti useiden ihmisten toimesta.",
      "setupTitle": "Esimerkki turvallisesta moni-allekirjoitusrakenteesta, jossa on kolme allekirjoittajaa",
      "setupWeights": "Esimerkissä, jossa on kolme samanarvoista roolia, kaikki saavat saman allekirjoitusvoimakkuuden:\n- Allekirjoittaja (Signer) A (Management): Paino 2\n- Allekirjoittaja (Signer) B (Finanzen): Paino 2\n- Allekirjoittaja (Signer) C (Compliance/Backup): Paino 2",
      "setupThresholds": "Sopivat kynnykset/painot asetetaan seuraavasti:\n- Matalat (low_threshold): 1\n- Keskitaso (med_threshold): 2 (for payments and other medium actions)\n- Korkea (high_threshold): 4 (rakenneuudistuksille, kuten allekirjoittajien lisääminen/poistaminen (Signer) tai kynnyksen/painon muuttaminen (Thresholds))\nTämä varmistaa, että jokainen valtuutettu henkilö voi suorittaa maksuja, mutta yksittäinen henkilö ei voi muuttaa tilin rakennetta yksin.",
      "behavior": "Tässä kokoonpanossa maksut voivat tehdä kuka tahansa kolmesta oikeutetusta henkilöstä yksin, koska kunkin henkilön painoarvo täyttää keskitason kynnyksen/kynnysarvon. Rakenneuudistuksia varten, kuten allekirjoittajan poistaminen, kynnysten/painoarvojen säätäminen tai tilin yhdistäminen tai sulkeminen, vaaditaan korkea kynnys/korkea_kynnysarvo. Tämä arvo voidaan saavuttaa vain, kun vähintään kaksi kolmesta allekirjoittajasta allekirjoittaa yhdessä. Tämä järjestely pitää tilin joustavana päivittäiseen käyttöön, tarjoten samalla vahvan suojan väärinkäytöksiä vastaan.",
      "removal": "Jos henkilö lähtee yrityksestä tai ei ole enää luotettava, kaksi jäljelle jäävää allekirjoittajaa (Signer) voivat yhdessä poistaa kyseisen henkilön allekirjoitusoikeudet. Kukaan yksittäinen allekirjoittaja (Signer) – ei työntekijä eikä johto – voi itsenäisesti estää muita tilin käytöstä. Oikeuksien poisto tapahtuu siis aina valvotusti ja läpinäkyvästi vähintään kahden vastuuhenkilön toimesta.",
      "summary": "Tällainen monisignatuurirakenne mahdollistaa yksittäisten osapuolten tehokkaan maksujen käsittelyn samalla, kun tilin hallinta säilyy useilla osallistujilla. Se vähentää tilikaappausten riskiä, suojaa yksipuolisilta päätöksiltä ja on erityisen sopiva yritystileille, joissa sekä turvallisuus että operatiivinen joustavuus ovat tärkeitä.",
      "closeLabel": "Sulje",
      "linkLabel": "Mitä tarkoittaa Multi-Signature?",
      "glossaryLinkLabel": "Näytä sanastossa"
    }
  },
  "multisigCorporate": {
    "title": "Moniallekirjoitus - Esimerkki",
    "original": "Multi-Signature - Example",
    "short": "Esimerkki yritystilien moniallekirjoitusrakenteesta, jossa on rooleja, painotuksia ja kynnysarvoja.",
    "desc": "Esimerkki: Yritys perustaa Stellar-tilin kolmella allekirjoittajalla: toimitusjohtaja (paino 2), talousjohtaja (paino 2) ja hallituksen jäsen (paino 1). Kynnysarvot on määritetty niin, että matalan turvallisuuden toiminnot vaativat painon 1, keskitason toiminnot (esim. maksut) painon 3 ja korkean tason toiminnot (esim. allekirjoittajien muuttaminen) painon 4. Tämä tarkoittaa, että toimitusjohtaja voi yksin tarkastella tiliä, mutta hänen on tehtävä yhteistyötä talousjohtajan tai molempien muiden allekirjoittajien kanssa maksujen ja kokoonpanomuutosten osalta."
  },
  "trustline": {
    "title": "Luottolimiitti",
    "original": "Trustline",
    "short": "Sopimus tokenin hallussapidosta tietyn liikkeeseenlaskijan kanssa.",
    "desc": "Luottolimiitti on kuin \"Kyllä, hyväksyn tämän tokenin.\" Kun asetat sen, ilmoitat, että tilisi on valmis vastaanottamaan tietyn tokenin tietystä liikkeellelaskijasta. Ilman luottolimiittiä et voi vastaanottaa tätä tokenia.\n\nEsimerkki: Luottolimiitti määritellään muodossa KOODI:LIIKKEEELLELASKEJA. EURT, jolla on liikkeellelaskija GDUKMGUGDZQK6Y…, olisi EURT:GDUKMGUGDZQK6Y…"
  },
  "token": {
    "title": "Merkki",
    "original": "Token",
    "short": "Digitaalinen yksikkö – esimerkiksi raha, pisteet tai hyvitykset.",
    "desc": "Tokeni on digitaalinen yksikkö lohkoketjussa. Tokeni voi edustaa rahaa, pisteitä tai palvelun hyvityksiä."
  },
  "asset": {
    "title": "Omaisuuserä",
    "original": "Asset",
    "short": "Mikä tahansa digitaalinen arvonkantaja lohkoketjussa – kryptovaluutoista tokeneihin ja stablecoineihin.",
    "desc": "Omaisuuserä on laajimmassa merkityksessä kaikki, mikä edustaa arvoa ja on siirrettävissä. Stellarissa kuka tahansa voi laskea liikkeeseen omaisuuserän – esim. lentoyhtiö mailiensa tokeneina, pankki dollarinsa stablecoinina. Jokainen Stellar-omaisuuserä määritellään kahdella asialla: omaisuuskoodilla (esim. 'USDC') ja liikkeeseenlaskijalla (luojan G-osoite). XLM on ainoa omaisuuserä ilman liikkeeseenlaskijaa, koska se on verkon natiivi omaisuuserä."
  },
  "xlm": {
    "title": "XLM",
    "original": "XLM",
    "short": "Stellarin alkuperäisvaluutta maksuihin ja aktivointiin.",
    "desc": "XLM on Stellarin alkuperäinen valuutta. Tarvitset XLM:ää maksujen suorittamiseen ja uuden tilin avaamiseen."
  },
  "mainnet": {
    "title": "Mainnet",
    "original": "Mainnet",
    "short": "Echtes Stellar‑Netzwerk mit realem Wert.",
    "desc": "Todellinen Stellar-verkko todellisella arvolla. Tapahtumat ovat lopullisia ja maksut suoritetaan oikealla XLM:llä."
  },
  "testnet": {
    "title": "Testiverkko",
    "original": "Testnet",
    "short": "Julkinen koulutusverkosto ilman todellista arvoa.",
    "desc": "Julkinen käytäntöverkosto. Tokeneilla ei ole todellista arvoa. Ihanteellinen oppimiseen ja kokeilemiseen ilman riskiä."
  },
  "memo": {
    "title": "Muistio",
    "original": "Memo",
    "short": "Lyhyt huomautus tapahtumassa.",
    "desc": "Muistio on pieni huomautus, jonka voi lähettää tapahtuman mukana. Usein pörssi vaatii tietyn muistion tietääkseen, kenelle rahat kuuluvat."
  },
  "transaction": {
    "title": "Tapahtuma",
    "original": "Transaction",
    "short": "Toiminto lohkoketjussa, esim. maksu tai luottolimiitti.",
    "desc": "Tapahtuma on toimenpide lohkoketjussa, kuten rahan lähettäminen tai luottorajan perustaminen. Kun se on vahvistettu, tapahtuma tallennetaan pysyvästi."
  },
  "fee": {
    "title": "Maksu",
    "original": "Fee",
    "short": "Hyvin pieni summa per tapahtuma.",
    "desc": "Maksu on erittäin pieni summa, jonka maksat jokaisen tapahtuman yhteydessä. Maksu menee verkolle. Stellarissa maksut ovat erittäin alhaiset."
  },
  "operations": {
    "title": "Operaatio",
    "original": "Operation",
    "short": "Stellar-transaktion pienin yksikkö – transaktio voi sisältää enintään 100 operaatiota.",
    "desc": "Stellarissa transaktio on kontti, jossa on yksi tai useampi operaatio. Operaatio on yksi toiminto, kuten maksun lähetys, trustlinen luominen tai tarjouksen asettaminen. Enintään 100 operaatiota voidaan yhdistää yhteen transaktioon, mikä on erittäin tehokasta. Transaktiomaksu lasketaan operaatioiden määrän mukaan (oletus: 100 stroops per operaatio)."
  },
  "pathPayment": {
    "title": "Polkumaksu",
    "original": "Path Payment",
    "short": "Maksu, jossa Stellar tekee automaattisesti yhden tai useamman valuuttamuunnoksen, jotta vastaanottaja saa halutun assetin.",
    "desc": "Polkumaksuilla voit esimerkiksi lähettää XLM:ää ja vastaanottaja saa automaattisesti USDC:tä – Stellar löytää parhaan vaihtopolun hajautetun markkinan kautta. Verkko etsii saatavilla olevia kaupankäyntipareja ja likviditeettipooleja edullisimman polun löytämiseksi. Tämä on erityisen hyödyllistä rajat ylittävissä maksuissa: lähettäjä maksaa omassa valuutassaan ja vastaanottaja saa omansa. Kaikki yhdessä transaktiossa."
  },
  "clawback": {
    "title": "Takaisinotto",
    "original": "Clawback",
    "short": "Valinnainen Stellar-toiminto, jonka avulla assetin liikkeeseenlaskija voi ottaa liikkeessä olevia tokeneita takaisin tililtä.",
    "desc": "Clawback on Stellarissa erityinen ominaisuus, joka täyttää sääntelyvaatimuksia. Jos liikkeeseenlaskija aktivoi clawbackin assetia luodessaan, hän voi ottaa tokeneita takaisin miltä tahansa tililtä – esimerkiksi petoksen, rahanpesun tai lakisääteisten vaatimusten vuoksi. Säännellyille rahoitustuotteille, kuten security tokeneille, tämä on usein lain edellyttämä. Tavallisten käyttäjien ei tarvitse huolehtia, kunhan he käyttävät luotettavia liikkeeseenlaskijoita."
  },
  "sponsor": {
    "title": "Sponsorointi",
    "original": "Sponsoring",
    "short": "Stellar-toiminto, jossa yksi tili kattaa toisen tilin perusreservin.",
    "desc": "Stellarissa jokainen tili ja jokainen merkintä (trustline, data-merkintä jne.) vaatii vähimmäissaldon XLM:ää (perusreservi). Sponsorointi antaa yhden tilin kattaa tämän reservin toisen puolesta. Tämä on hyödyllistä sovelluksille, jotka haluavat ottaa uusia käyttäjiä mukaan ilman, että heidän pitää ensin ostaa XLM:ää. Esimerkki: sovellus sponsoroi tilin luomisen ja trustlinet uusille käyttäjille – he voivat aloittaa heti ilman omaa XLM:ää."
  },
  "ledger": {
    "title": "Tilikirja",
    "original": "Ledger",
    "short": "Vahvistettujen tietojen ja saldovien ketju.",
    "desc": "Pääkirja on kaikkien vahvistettujen tietojen ketju. Se näyttää, kuinka paljon tileillä on ja mitä tapahtumia on tapahtunut. Kuka tahansa voi tarkistaa pääkirjan."
  },
  "horizon": {
    "title": "Horisontti",
    "original": "Horizon",
    "short": "API‑Dienst, über den Apps mit Stellar sprechen.",
    "desc": "Horizon on palvelu, jonka kautta ohjelmat kommunikoivat Stellar-lohkoketjun kanssa. Työkalumme kysyy Horizonilta tilien saldot ja tapahtumat."
  },
  "horizonHistory": {
    "title": "Horisontti Historia",
    "original": "Horizon history depth",
    "short": "Kuvataan, kuinka pitkälle julkisten Horizon-palvelinten tarjoama tapahtumahistoria ulottuu.",
    "desc": "Julkiset Horizon-palvelimet (Mainnet und Testnet), joita Stellar Development Foundation ylläpitää, tarjoavat vain rajoitetun historian – tällä hetkellä noin yksi vuosi taaksepäin. Vanhempia tietoja ei voi enää hakea näiden ilmaisten päätepisteiden kautta. Jos tarvitset tietoja pidemmältä ajalta, sinulla on käytännössä kaksi vaihtoehtoa: (1) voit käyttää omaa Horizon-solmua koko historiallaan (inklusive History Archives), tai (2) voit käyttää kolmannen osapuolen tai maksullisia palveluja, jotka tallentavat ja tarjoavat pitkäaikaisia Stellarin historiallisia tietoja.",
    "seeAlso": "Sinulle ei annettu erityistä käännettävää tekstiä. Ole hyvä ja anna teksti, jonka haluat kääntää."
  },
  "scp": {
    "title": "Stellar Consensus Protocol",
    "original": "SCP – Stellar Consensus Protocol",
    "short": "Stellarin ainutlaatuinen konsensus, joka vahvistaa siirrot nopeasti ilman miningia.",
    "desc": "SCP on Stellarin ydin: algoritmi, joka määrittää miten osallistujat sopivat ledgerin tilasta. Toisin kuin Bitcoin (Proof of Work) tai Ethereum (Proof of Stake), Stellar käyttää federatiivista äänestystä: jokainen validaattori luottaa itse valitsemaansa validaattorijoukkoon (quorum set). Tämä rakenne mahdollistaa konsensuksen 3–5 sekunnissa ilman energiahukkaa miningista. SCP:n suunnitteli David Mazières (Stanford) ja se on todistetusti turvallinen."
  },
  "validator": {
    "title": "Validaattori",
    "original": "Validator",
    "short": "Verkkosolmu, joka tarkistaa siirrot ja osallistuu konsensukseen.",
    "desc": "Validaattorit ovat luotettavia osallistujia, jotka pitävät Stellar‑verkon toiminnassa. Ne vastaanottavat siirrot, tarkistavat ne ja äänestävät muiden validaattorien kanssa siitä, mitä kirjataan seuraavaan ledgeriin. Kuka tahansa voi ylläpitää Stellar‑validaattoria: yritykset, yliopistot tai yksityishenkilöt. Stellar Development Foundation ylläpitää joitakin validaattoreita, mutta ei ole ainoa auktoriteetti. Hajautettu validaattoriverkko tekee Stellarista kestävän häiriöitä ja sensuuria vastaan."
  },
  "quorumSet": {
    "title": "Quorum Set",
    "original": "Quorum Set",
    "short": "Validaattorijoukko, johon solmu luottaa konsensuksessa.",
    "desc": "SCP:ssä jokainen validaattori valitsee itse, keihin validaattoreihin se luottaa—tämä on sen quorum set. Konsensus syntyy, kun quorum setit menevät päällekkäin ja sopivat. Mallin nimi on Federated Byzantine Agreement (FBA). Se on joustavampi kuin perinteiset konsensusmallit: ei ole kiinteää luotettujen solmujen listaa, vaan orgaanisesti kasvava luottamusverkko. Quorum setin laatu ja hajautus vaikuttavat suoraan verkon turvallisuuteen."
  },
  "sac": {
    "title": "Stellar Asset Contract",
    "original": "SAC – Stellar Asset Contract",
    "short": "Soroban‑smart contract, joka tekee Stellar‑assetin käytettäväksi smart contracteissa.",
    "desc": "Sorobanin myötä syntyi ongelma: olemassa olevien Stellar‑assetien (kuten USDC tai XLM) piti toimia myös smart contracteissa. Stellar Asset Contract ratkaisee tämän: se on standardoitu smart‑contract‑rajapinta jokaiselle Stellar‑assetille. Näin Soroban‑dAppit voivat käyttää natiiveja Stellar‑asseteja suoraan ilman uuteen tokeniin vaihtamista. SACit ovat automaattisesti olemassa kaikille Stellar‑asseteille eikä niitä tarvitse luoda käsin."
  },
  "anchor": {
    "title": "Ankkuri",
    "original": "Anchor",
    "short": "Firma, die Fiat‑Geld mit Stellar verbindet.",
    "desc": "Ankkuri on yritys, joka yhdistää oikean rahan, kuten eurot tai dollarit, Stellariin. Esimerkiksi, annat ankkurille euroja ja saat vastineeksi eurotokenin Stellarissa."
  },
  "exchange": {
    "title": "Pörssi",
    "original": "Exchange",
    "short": "Paikka tokenien ostamiseen ja myymiseen.",
    "desc": "Pörssi on paikka, jossa voit ostaa tai myydä tokeneita. Monet pörssit vaativat KYC-prosessin, mikä tarkoittaa henkilöllisyyden vahvistamista, ennen kuin voit nostaa rahaa euroina tai frangeina."
  },
  "dex": {
    "title": "DEX (Decentralized Exchange)",
    "original": "Decentralized Exchange",
    "short": "Hajautettu pörssi suoraan lohkoketjussa.",
    "desc": "DEX tarkoittaa hajautettua pörssiä. Tässä ihmiset käyvät kauppaa suoraan toistensa kanssa lohkoketjussa. Ei ole yhtä keskitettyä toimijaa. Stellarilla on suoraan siihen sisäänrakennettu DEX."
  },
  "liquidityPool": {
    "title": "Likviditeettipooli",
    "original": "Liquidity Pool",
    "short": "Yhteinen rahasto, jossa on kaksi merkkiä välitöntä vaihtoa varten.",
    "desc": "Likviditeettipooli on yhteinen rahasto, joka sisältää kaksi tokenia. Ihmiset tallettavat siihen molempia tokeneita. Muut saavat sitten vaihdettua näitä tokeneita välittömästi. Tallettajat ansaitsevat vastineeksi pieniä palkkioita."
  },
  "onramp": {
    "title": "Onramp",
    "original": "Onramp",
    "short": "Palvelu, jonka avulla voi ostaa kryptoa fiat‑rahalla (esim. euro tai Sveitsin frangi).",
    "desc": "Onramp on sisäänkäynti kryptoon—reitti perinteisestä rahasta kryptoon. Tyypilliset tavat ovat kortti tai pankkisiirto. Palvelut kuten Kado tai Onramper mahdollistavat ostamisen suoraan sovelluksessa ilman erillistä pörssiä. Stellar Account Manager integroi onramp‑palvelut, jotta voit ostaa XLM:ää ja muita asseteja fiat‑rahalla. Onrampit vaativat yleensä KYC:n."
  },
  "offramp": {
    "title": "Offramp",
    "original": "Offramp",
    "short": "Palvelu, jonka avulla voi myydä kryptoa takaisin fiat‑rahaan.",
    "desc": "Offramp on onrampin vastakohta—reitti takaisin perinteiseen rahaan. Myyt krypto‑assetit ja saat eurot, frangit tai muun fiat‑valuutan pankkitilille. Stellarissa anchorit hoitavat usein offrampeja: he vastaanottavat esimerkiksi USDC‑tokeneita ja maksavat vastaavan fiat‑summan. Offrampeissa vaaditaan yleensä KYC."
  },
  "kyc": {
    "title": "Know Your Customer",
    "original": "KYC / AML – Know Your Customer / Anti-Money Laundering",
    "short": "Lakisääteinen henkilöllisyyden tarkistus, jota finanssipalvelut vaativat ennen käyttöä.",
    "desc": "KYC (Know Your Customer) on sääntelyprosessi, jossa käyttäjä todistaa henkilöllisyytensä asiakirjoilla ja joskus selfiellä. Tavoite on estää rahanpesu (AML), terrorismin rahoitus ja petokset. Hajautetut protokollat kuten Stellar DEX eivät vaadi KYC:tä—käyt kauppaa suoraan walletista. Onramp- ja offramp‑palvelut ovat velvoitettuja tekemään KYC:n, koska ne yhdistävät fiat- ja kryptomaailman."
  },
  "defi": {
    "title": "Hajautettu rahoitus",
    "original": "DeFi – Decentralized Finance",
    "short": "Rahoituspalvelut kuten lainat, kaupankäynti ja säästäminen—ilman pankkeja, suoraan lohkoketjuprotokollien kautta.",
    "desc": "DeFi on yleistermi rahoitussovelluksille, jotka toimivat ilman keskitettyjä instituutioita kuten pankkeja tai pörssejä. Kaikki tapahtuu automaattisesti smart contractien avulla. Käyttäjät hallitsevat itse varojaan. Tyypillisiä DeFi‑sovelluksia ovat hajautetut pörssit (DEX), lainaprotokollat ja likviditeettipoolit. Stellar tarjoaa perus‑DeFi‑toiminnot sisäänrakennetulla DEX:llä ja AMM‑pooleilla, ja Soroban‑smart contractit laajentavat niitä."
  },
  "yield": {
    "title": "Tuotto / Yield",
    "original": "Yield",
    "short": "Tuotto, jonka saat tarjoamalla pääomaa DeFi‑protokollissa.",
    "desc": "DeFi‑maailmassa yield tarkoittaa tuottoa esimerkiksi likviditeetin tarjoamisesta, stakingista tai lainaamisesta. Tuotto esitetään usein APY‑lukuna (Annual Percentage Yield). Korkeat tuotot merkitsevät usein korkeaa riskiä. Tärkeää: erittäin korkeat tuotot (esim. 1000% APY) ovat usein varoitusmerkki."
  },
  "staking": {
    "title": "Staking",
    "original": "Staking",
    "short": "Kryptojen lukitseminen verkkoon palkkioiden saamiseksi ja verkon tukemiseksi.",
    "desc": "Stakingissa coinit lukitaan proof‑of‑stake‑verkkoon tapahtumien vahvistamiseksi ja verkon suojaamiseksi. Stakerit saavat uusia coineja palkkiona. Stellar ei käytä klassista staking‑mallia—XLM‑omistajat voivat sen sijaan tarjota likviditeettiä pooliin ja ansaita kaupankäyntikuluja. Tärkeää: erottele oikea verkko‑staking keskitettyjen pörssien “staking”‑tuotteista, jotka ovat usein vain säästötilejä."
  },
  "yieldFarming": {
    "title": "Yield Farming",
    "original": "Yield Farming",
    "short": "Pääoman aktiivinen siirtäminen DeFi‑protokollien välillä parhaan tuoton saamiseksi.",
    "desc": "Yield farmerit siirtävät varojaan eri poolien ja protokollien välillä saadakseen parhaan tuoton. Se voi olla houkuttelevaa, mutta on monimutkaista ja riskialtista: impermanent loss, smart contract ‑virheet ja äkilliset tuoton laskut voivat syödä voitot. Yield farming on edistyneille eikä suositella aloittelijoille."
  },
  "dao": {
    "title": "Hajautettu autonominen organisaatio",
    "original": "DAO – Decentralized Autonomous Organization",
    "short": "Organisaatio, jota ohjataan smart contracteilla ja token‑äänestyksillä ilman keskitettyä johtoa.",
    "desc": "DAO on digitaalinen organisaatio, jota hallitaan koodilla ja token‑haltijoiden äänestyksillä. Ei ole CEO:ta tai hallitusta—päätökset tehdään hallintatoken‑äänestyksillä. Token‑haltijat voivat tehdä ehdotuksia ja äänestää. DAO:ita käytetään protokollakehitykseen, treasury‑hallintaan ja sääntömuutoksiin. Konsepti on innovatiivinen, mutta riskejä ovat matala osallistuminen tai koordinoidut hyökkäykset."
  },
  "dapp": {
    "title": "Hajautettu sovellus",
    "original": "dApp – Decentralized Application",
    "short": "Sovellus, joka toimii lohkoketjussa ilman keskitettyä hallintaa.",
    "desc": "dApp näyttää käyttäjälle normaalilta sovellukselta, mutta toimii lohkoketjussa eikä keskitettyillä palvelimilla. Koodi on smart contracteissa—julkinen eikä yhden osapuolen hallinnassa. Esimerkkejä: hajautetut pörssit, lainaprotokollat tai NFT‑markkinapaikat. Sorobanin avulla Stellar tukee dApp‑kehitystä verkossaan. dAppit vaativat yleensä wallet‑yhteyden perinteisen loginin sijaan."
  },
  "oracle": {
    "title": "Oracle",
    "original": "Oracle",
    "short": "Palvelu, joka tuo ulkomaailman dataa (esim. hinnat, sää) smart contracteille.",
    "desc": "Lohkoketjut ovat oletuksena eristettyjä—smart contract ei voi itse hakea Bitcoin‑hintaa tai EUR/USD‑kurssia. Oraclet ratkaisevat tämän tuomalla luotettavaa ulkoista dataa lohkoketjuun. Tunnettuja oraclet‑palveluita ovat Chainlink ja Pyth Network. Ilman oracleta monet DeFi‑sovellukset kuten lainaprotokollat tai synteettiset varat eivät olisi mahdollisia."
  },
  "cex": {
    "title": "Keskitetty pörssi",
    "original": "CEX – Centralized Exchange",
    "short": "Kryptopörssi, jota ylläpitää yritys ja joka toimii välittäjänä ostajien ja myyjien välillä.",
    "desc": "CEX:ssä, kuten Coinbasessa, Binancessa tai Krakenissa, et omista kolikoitasi suoraan – pörssi säilyttää ne puolestasi. Se on kätevää, mutta sisältää riskejä: jos pörssi hakeroidaan tai menee konkurssiin, varoja voi kadota (esim. FTX:n romahdus 2022). CEX:t vaativat yleensä henkilöllisyyden varmistuksen (KYC). DEX:ssä voit vaihtaa suoraan omasta lompakostasi ilman välikäsiä."
  },
  "orderBook": {
    "title": "Tilauskirja",
    "original": "Order Book",
    "short": "Lista kaikista avoimista osto- ja myyntitarjouksista tietylle kaupankäyntiparille.",
    "desc": "Tilauskirja näyttää reaaliajassa hinnat, joilla ostajat haluavat ostaa (bids) ja myyjät haluavat myydä (asks). Korkeimman ostotarjouksen ja matalimman myyntitarjouksen erotusta kutsutaan spreadiksi. Stellarissa on sisäänrakennettu hajautettu tilauskirja (SDEX – Stellar Decentralized Exchange), jossa kuka tahansa voi käydä kauppaa asseteilla. Likviditeettipoolit ovat vaihtoehto perinteiselle tilauskirjamallille."
  },
  "limitOrder": {
    "title": "Limit order",
    "original": "Limit Order",
    "short": "Toimeksianto, joka toteutuu vain tietyllä hinnalla tai sitä paremmalla.",
    "desc": "Limit orderissa määrität hinnan, jolla olet valmis ostamaan tai myymään. Orderi menee tilauskirjaan ja odottaa, että joku haluaa käydä kauppaa sillä hinnalla. Etu: hallitset hintaa. Haitta: orderi ei ehkä toteudu heti tai lainkaan. Stellarissa tämä vastaa \"offeria\" hajautetussa tilauskirjassa."
  },
  "marketOrder": {
    "title": "Market order",
    "original": "Market Order",
    "short": "Toimeksianto, joka toteutuu heti parhaaseen saatavilla olevaan markkinahintaan.",
    "desc": "Market order toteutuu heti parhaaseen hintaan tilauskirjassa. Se takaa toteutumisen, mutta ei hintaa. Matala likviditeetti voi johtaa siihen, että toteutushinta poikkeaa selvästi odotetusta (slippage). Market order on hyvä nopeuteen; limit order on parempi kun hinta on tärkeä."
  },
  "offer": {
    "title": "Tarjous",
    "original": "Offer",
    "short": "Avoin osto- tai myyntitarjous Stellar-verkon hajautetussa tilauskirjassa.",
    "desc": "Stellarissa kuka tahansa voi asettaa tarjouksen hajautettuun tilauskirjaan: esimerkiksi “Myyn 100 XLM:ää hintaan 0,10 USDC kappale”. Tarjous pysyy avoinna, kunnes se täyttyy, poistetaan käsin tai korvataan uudella versiolla. Tarjoukset ovat SDEX:n (Stellar Decentralized Exchange) perusta ja niitä käytetään myös path payments -maksuissa. Jokainen avoin tarjous kasvattaa tilin minimisummaa yhdellä base reservellä."
  },
  "slippage": {
    "title": "Slippage",
    "original": "Slippage",
    "short": "Ero odotetun hinnan ja toteutuneen hinnan välillä.",
    "desc": "Slippage syntyy, kun markkinahinta muuttuu orderin lähettämisen ja toteutuksen välillä, tai kun kauppa on niin suuri, että se “syö” tilauskirjan. Esimerkki: haluat ostaa hintaan 1,00 USDC, mutta vähäisen likviditeetin vuoksi kauppa toteutuu hintaan 1,05 USDC – se on 5% slippage. Likviditeettipoolien kanssa slippage on erityisen tärkeä suurissa kaupoissa. Monet DEX:t antavat asettaa maksimisallitun slippage-toleranssin."
  },
  "impermanentLoss": {
    "title": "Väliaikainen tappio",
    "original": "Impermanent Loss",
    "short": "Väliaikainen arvon menetys likviditeetin tarjoajille, kun poolin assettien hinnat erkanevat.",
    "desc": "Kun tarjoat likviditeettiä pooliin, voit kärsiä väliaikaisesta tappiosta: jos kahden assetin hintasuhde muuttuu, nostohetken arvo on huonompi kuin jos olisit vain pitänyt assetit. Tappio on “väliaikainen”, koska se katoaa, jos hinnat palaavat alkuperäiseen suhteeseen. Kaupankäyntipalkkiot voivat kompensoida tappion. Tämä on tärkeä käsite kaikille, jotka tarjoavat likviditeettiä Stellar DEXissä."
  },
  "amm": {
    "title": "Automaattinen markkinatakaaja",
    "original": "AMM – Automated Market Maker",
    "short": "Smart contract -pohjainen järjestelmä, joka mahdollistaa kaupankäynnin ilman tilauskirjaa hintakaavoilla.",
    "desc": "AMM korvaa perinteisen tilauskirjan algoritmilla. Sen sijaan, että odottaisit ostajaa tai myyjää, käyt kauppaa suoraan likviditeettipoolin kanssa. Hinta lasketaan automaattisesti kaavalla (yleensä x × y = k). Mitä enemmän yhtä assettia ostetaan, sitä kalliimmaksi se tulee. Stellar on tuonut AMM-pohjaiset likviditeettipoolit klassisen SDEX-tilauskirjan rinnalle."
  },
  "bullBearMarket": {
    "title": "Härkä- ja karhumarkkina",
    "original": "Bull & Bear Market",
    "short": "Härkämarkkina = nousevat hinnat ja optimismi. Karhumarkkina = laskevat hinnat ja pessimismi.",
    "desc": "Härkämarkkinassa hinnat nousevat pidempään, sijoittajat ovat optimistisia ja ostavat. Karhumarkkinassa hinnat laskevat (usein yli 20 % huipusta) ja tunnelma on negatiivinen. Symbolit: härkä puskee ylös sarvillaan (nousevat hinnat), karhu lyö alas tassullaan (laskevat hinnat). Kryptomarkkinat vaihtuvat usein näiden vaiheiden välillä—usein voimakkaammin ja nopeammin kuin perinteiset markkinat."
  },
  "hodl": {
    "title": "HODL",
    "original": "HODL",
    "short": "Krypto-slangia pitkäaikaiselle holdaamiselle, riippumatta hinnanvaihteluista.",
    "desc": "HODL syntyi vuonna 2013 kirjoitusvirheestä (“hold”) Bitcoin-foorumilla ja siitä tuli krypto-mantra. Strategia: ostaa ja pitää pitkään sen sijaan, että treidaisi lyhyellä aikavälillä. Monet pitkäaikaiset sijoittajat uskovat tähän, koska lyhyen aikavälin treidaus tuottaa usein huonommin kuin pelkkä pitäminen. HODL:ia tulkitaan joskus leikillisesti “Hold On for Dear Life”—erityisesti volatiileissa markkinoissa."
  },
  "dca": {
    "title": "Säännöllinen keskihankinta",
    "original": "DCA – Dollar Cost Averaging",
    "short": "Sijoitusstrategia, jossa sijoitetaan säännöllisesti kiinteä summa hinnasta riippumatta.",
    "desc": "Sen sijaan, että sijoittaisit suuren summan kerralla, sijoitat kiinteän summan säännöllisesti (esim. 50 € kuukaudessa) XLM:ään tai Bitcoiniin. Kun hinnat ovat alhaalla, ostat enemmän; kun hinnat ovat ylhäällä, ostat vähemmän—tämä tasaa keskihintaa ajan myötä. DCA vähentää riskiä sijoittaa väärään aikaan ja sopii erityisesti aloittelijoille ja volatileille markkinoille kuten kryptoon."
  },
  "portfolio": {
    "title": "Portfolio",
    "original": "Portfolio",
    "short": "Kaikkien käyttäjän hallussa olevien krypto-assetien ja sijoitusten kokonaisuus.",
    "desc": "Portfolio on yhteenveto kaikista omistuksistasi: mitä coin- ja token-assetia sinulla on, missä määrin ja millä arvolla. Hyvään portfolio-strategiaan kuuluu hajautus: älä laita kaikkea yhteen assetiin. Stellar Account Managerissa näet portfoliosi suoraan—kaikki Stellar-tiliesi assetit yhdellä silmäyksellä."
  },
  "tvl": {
    "title": "Total Value Locked",
    "original": "TVL – Total Value Locked",
    "short": "Kaikkien DeFi-protokollaan tai likviditeettipooliin lukittujen assetien kokonaisarvo.",
    "desc": "TVL on tärkeä mittari DeFi:ssä. Se kertoo, kuinka paljon pääomaa on lukittuna protokollaan, dAppiin tai likviditeettipooliin. Korkea TVL viittaa luottamukseen ja aktiiviseen käyttöön. Stellarissa TVL mittaa kaikkien assetien arvoa likviditeettipoolissa. Palvelut kuten DeFiLlama seuraavat TVL:ää monilla lohkoketjuilla ja protokollissa."
  },
  "balanceClaimable": {
    "title": "Vaadittavissa oleva saldo",
    "original": "Claimable Balance",
    "short": "Varatut rahat, jotka sinun on vielä saatava.",
    "desc": "Vaatimukseen oikeuttava saldo on rahaa, joka on jo varattu sinulle, mutta sinun täytyy vielä vaatia se. Se hyvitetään tilillesi vasta, kun hyväksyt sen."
  },
  "protocolUpdate": {
    "title": "Protokollipäivitys",
    "original": "Protocol Update",
    "short": "Aktualisierung der Netzwerk‑Regeln.",
    "desc": "Protokollipäivitys on sääntöjen päivitys Stellar-verkossa, kuten uusia ominaisuuksia tai tietoturvamuutoksia. Kaikkien verkon solmujen on käytettävä samoja sääntöjä."
  },
  "soroban": {
    "title": "Soroban",
    "original": "Soroban",
    "short": "Stellars Smart‑Contract‑System.",
    "desc": "Soroban on Stellarin älysopimusjärjestelmä. Älysopimus on lohkoketjussa olevaa ohjelmakoodia. Koodi voi itsenäisesti varmistaa sääntöjen noudattamisen ja käynnistää toimia ilman pankin välittäjää."
  },
  "multiSignature": {
    "title": "Moniallekirjoitus",
    "original": "Multi-Signature",
    "short": "Multiple signatures required; weights + threshold determine the release.",
    "desc": "Moniallekirjoitusjärjestelyssä useiden avainten on allekirjoitettava ennen kuin toiminto tulee päteväksi. Jokaisella allekirjoittajalla on painoarvo, ja summan on täytettävä vaadittu kynnysarvo. Tämä lisää turvallisuutta, koska yksi varastettu avain ei riitä."
  },
  "signer": {
    "title": "Allekirjoittaja",
    "original": "Signer",
    "short": "Julkinen avain painotuksella, osa tilin kokoonpanoa.",
    "desc": "Allekirjoittaja on tilille kuuluva julkinen avain ja sillä on painoarvo. Sen allekirjoitus lasketaan vaadittuun kynnysarvoon. Useat allekirjoittajat voivat yhdessä valtuuttaa tapahtuman.\n\nAllekirjoittajatyypit:\n- ed25519 (standard key)\n- hashX (Hash-Vorlage)\n- preAuthTx (vorab autorisierte Transaktion)\n\nSKM tukee ainoastaan ed25519. Lisävaihtoehtoja varten käy osoitteessa https://lab.stellar.org."
  },
  "thresholds": {
    "title": "Kynnykset",
    "original": "Thresholds",
    "short": "Rajat (low/med/high), jotka asettavat vaaditun kokonaispainon.",
    "desc": "Kynnysarvot määrittävät, kuinka monta painotettua allekirjoitusta tarvitaan toimenpiteisiin: matala yksinkertaisille toiminnoille, keskitaso maksuille ja korkea kriittisille muutoksille. Allekirjoittajien painojen summan on täytettävä kyseinen kynnysarvo."
  },
  "masterWeight": {
    "title": "Mestari paino",
    "original": "master_weight",
    "short": "Pääavaimen paino; määrittää, kuinka paljon merkitystä pääavaimella on.",
    "desc": "Pääpaino on tilin pääavaimen paino. Korkea pääpaino mahdollistaa pääavaimen allekirjoittaa monia toimia itsenäisesti; matala arvo vaatii lisäallekirjoittajia."
  },
  "accountConfig": {
    "title": "Tilin määritykset",
    "original": "Account Configuration",
    "short": "Allekirjoittajien ja kynnysten välinen vuorovaikutus määrittää tilin turvallisuuden.",
    "desc": "Tilin kokoonpano määrittelee, mitkä allekirjoittajat ovat olemassa millä painoarvoilla ja mitkä kynnykset ovat voimassa. Muutokset allekirjoittajiin tai kynnysarvoihin ovat turvallisuuskriittisiä, koska ne määrittävät, kuinka monta allekirjoitusta vaaditaan."
  },
  "distributedNetwork": {
    "title": "Hajautettu verkko",
    "original": "Distributed Network",
    "short": "Monet tietokoneet työskentelevät yhdessä sen sijaan, että yksi tekisi kaikki päätökset.",
    "desc": "Kuvittele markkinat, joissa monet kauppiaat tuntevat samat säännöt. Jos yksi osallistuja vetäytyy, se jatkaa toimintaansa, koska muut voivat ottaa sen paikan. Tämä pitää järjestelmän vakaana ja vaikeammin manipuloitavana."
  },
  "node": {
    "title": "Solmu",
    "original": "Node",
    "short": "Yksittäinen osallistuja verkostossa.",
    "desc": "Solmu on kuin kirjanpitäjä, joka pitää hallussaan kopiota tiedoista. Se vahvistaa uudet merkinnät ja välittää ne eteenpäin. Monet solmut yhdessä tekevät verkosta luotettavan."
  },
  "block": {
    "title": "Lohko",
    "original": "Block",
    "short": "Lohko on merkintöjen nippu.",
    "desc": "Kuin sivu kassakirjassa, lohko kerää useita tapahtumia. Kun se on täynnä, se viimeistellään ja lisätään ketjuun. Tämä luo historian askel askeleelta."
  },
  "consensusMechanism": {
    "title": "Konsensusmekanismi",
    "original": "Consensus Mechanism",
    "short": "Säännöt, joista kaikki sopivat koskien hyväksyttyjä merkintöjä.",
    "desc": "Se on kuin ryhmä päättää, mikä kuitti on voimassa. Tämä estää ketään tekemästä salaa muutoksia. Eri lohkoketjut käyttävät erilaisia menetelmiä, mutta tavoite on aina konsensus."
  },
  "finality": {
    "title": "Lopullisuus / Päättäväisyys",
    "original": "Finality",
    "short": "Varmuus siitä, että tapahtuma on lopullinen.",
    "desc": "Kun jokin on lopullista, se tuntuu vahvistetulta pankkitililtä. Et enää odota sen peruuttamista. Tämä luo luottamusta."
  },
  "immutability": {
    "title": "Muuttumattomuus",
    "original": "Immutability",
    "short": "Merkintöjä ei pidä muuttaa jälkikäteen.",
    "desc": "Samalla tavalla kuin kirjanpito: Kaikki jälkikäteen tehdyt poistot ovat huomattavissa. Muutokset lisätään uutena merkintänä, ei kirjoiteta päälle. Tämä tekee historiasta jäljitettävän."
  },
  "decentralization": {
    "title": "Hajauttaminen",
    "original": "Decentralization",
    "short": "Mikään keskusviranomainen ei hallitse kaikkea.",
    "desc": "Sen sijaan, että olisi yksi holvi, on useita holveja, joissa on sama tieto. Päätökset syntyvät monien osallistujien vuorovaikutuksesta. Tämä tekee järjestelmästä vankemman."
  },
  "publicBlockchain": {
    "title": "Julkinen lohkoketju",
    "original": "Public Blockchain",
    "short": "Avoin kaikille, jotka haluavat osallistua.",
    "desc": "Kaikki voivat osallistua ja tarkastella tietoja, samoin kuin julkinen ilmoitustaulu. Tämä lisää avoimuutta, mutta jokainen toiminta on kaikkien nähtävillä. Säännöt varmistavat, ettei kukaan voi huijata."
  },
  "privateBlockchain": {
    "title": "Yksityinen lohkoketju",
    "original": "Private Blockchain",
    "short": "Pääsy vain valituille osallistujille.",
    "desc": "Kuin yrityksen kassakirja, jota vain työntekijät saavat nähdä. Se voi olla nopeampi ja hallitumpi, mutta se on vähemmän avoin. Luottamus rakentuu täällä organisaation kautta."
  },
  "permissionlessBlockchain": {
    "title": "Lupaa ei vaativa lohkoketju",
    "original": "Permissionless Blockchain",
    "short": "Kaikilla on lupa osallistua ilman erillistä lupaa.",
    "desc": "Kuin markkinat, joihin kuka tahansa voi liittyä. Tämä alentaa esteitä, mutta saattaa vaatia enemmän sääntöjä oikeudenmukaisuuden säilyttämiseksi. Esimerkkejä ovat monet julkiset lohkoketjut."
  },
  "permissionedBlockchain": {
    "title": "Luvanvarainen lohkoketju",
    "original": "Permissioned Blockchain",
    "short": "Osallistuminen vain luvan kanssa.",
    "desc": "Kuin klubi, jolla on jäsenluettelo. Tämä voi luoda selkeitä vastuita. Se on kuitenkin vähemmän avoin."
  },
  "seedPhrase": {
    "title": "Palauttamisteoreema",
    "original": "Seed Phrase / Recovery Phrase",
    "short": "Sanaluettelo, jonka avulla voit palauttaa lompakkosi.",
    "desc": "Hän on kuin turvasi varavain avain. Kuka tahansa, jolla se on, voi palauttaa lompakkosi. Siksi sitä ei koskaan pitäisi säilyttää verkossa."
  },
  "selfCustody": {
    "title": "Oma säilytys",
    "original": "Self-Custody",
    "short": "Pidät avaimet itse.",
    "desc": "Kuin käteinen omassa kassakaapissasi: sinulla on hallinta, mutta myös vastuu. Jos menetät pääsyn, kukaan ei voi auttaa. Aloittelijoille varovaisuus on erityisen tärkeää."
  },
  "custodian": {
    "title": "Hoitaja",
    "original": "Custodian",
    "short": "Palveluntarjoaja säilyttää avaimiasi puolestasi.",
    "desc": "Kuin pankki, joka hallinnoi tiliäsi. Se voi olla kätevää, mutta vie sinulta täyden hallinnan. Sinun täytyy luottaa siihen."
  },
  "hardwareWallet": {
    "title": "Laitteistolompakko",
    "original": "Hardware Wallet",
    "short": "Fyysinen laite avaimillesi.",
    "desc": "Kuin pieni kassakaappi taskussasi. Avaimet pysyvät laitteessa eivätkä mene verkkoon. Tämä suojaa monilta verkkohyökkäyksiltä."
  },
  "hotWallet": {
    "title": "Kuuma lompakko",
    "original": "Hot Wallet",
    "short": "Lompakko, jossa on internetyhteys.",
    "desc": "Kuin lompakko takissa: kätevä mutta alttiimpi vaaralle. Hyvä pienille summille ja päivittäiseen käyttöön. Ei ihanteellinen suurille summille."
  },
  "coldWallet": {
    "title": "Kylmä lompakko",
    "original": "Cold Wallet",
    "short": "Lompakko ilman internet-yhteyttä.",
    "desc": "Kuin kassakaappi kellarissa. Erittäin turvallinen, mutta epäkäytännöllinen päivittäiseen käyttöön. Sopii pitkäaikaiseen säilytykseen."
  },
  "cryptocurrency": {
    "title": "Kryptovaluutta",
    "original": "Cryptocurrency",
    "short": "Digitaalinen valuutta, joka lähetetään suoraan ihmisten välillä.",
    "desc": "Kuin digitaalinen käteinen, mutta ilman pankkia. Voit lähettää sen suoraan muille. Arvo voi vaihdella."
  },
  "altcoin": {
    "title": "Altcoin",
    "original": "Altcoin",
    "short": "Kaikki kryptovaluutat paitsi Bitcoin.",
    "desc": "Kuten muut markkinoilla olevat merkit hallitsevan toimijan lisäksi. Jotkut ovat tunnettuja, monet ovat pieniä. Laatu ja riski vaihtelevat suuresti."
  },
  "stablecoin": {
    "title": "Vakaa kolikko",
    "original": "Stablecoin",
    "short": "Kryptovaluutta, jolla on mahdollisesti vakaa arvo.",
    "desc": "Kuten digitaalinen raha, joka on sidottu standardivaluuttaan. Tämä tekee sen hinnasta vakaamman. Luottamus palveluntarjoajaan on kuitenkin edelleen tärkeää."
  },
  "utilityToken": {
    "title": "Käyttötunnus",
    "original": "Utility Token",
    "short": "Tunnus, jota voidaan käyttää palvelun käyttöön.",
    "desc": "Kuin kuponki markkinakojulla. Se tarjoaa pääsyn tai alennuksen. Sen arvo riippuu palvelun hyödyllisyydestä."
  },
  "securityToken": {
    "title": "Turvallisuustunnisteet",
    "original": "Security Token",
    "short": "Varmuusominaisuuksia sisältävä tunnus.",
    "desc": "Kuten osakekirja. Se voi luvata oikeuksia tai voittoja. Tiukemmat säännöt koskevat usein tätä."
  },
  "governanceToken": {
    "title": "Hallintotoken",
    "original": "Governance Token",
    "short": "Poletin antaa sananvaltaa säännöissä.",
    "desc": "Kuten äänestyskortti klubissa. Ne, joilla on tokeneita, voivat äänestää säännöistä. Se tarkoittaa vastuuta."
  },
  "liquidityToken": {
    "title": "Likviditeettitunnukset / LP-tunnukset",
    "original": "Liquidity Token",
    "short": "Rahake tokeni annetusta likviditeetistä.",
    "desc": "Kuin kuitti, joka osoittaa, että olet osallistunut rahan antamiseen yhteiseen rahastoon. Saat suhteellisia maksuja. Arvo voi vaihdella."
  },
  "nft": {
    "title": "Ei-vaihtokelpoinen rahake / NFT",
    "original": "Non-Fungible Token",
    "short": "Ainutlaatuinen digitaalinen token.",
    "desc": "Kuin signeerattu keräilyesine. Se edustaa jotain ainutlaatuista, ei vaihdettavaa kolikkoa. Arvo riippuu kysynnästä."
  },
  "cbdc": {
    "title": "Keskuspankin digitaalinen valuutta / CBDC",
    "original": "Central Bank Digital Currency",
    "short": "Keskuspankin liikkeeseen laskema digitaalinen raha.",
    "desc": "Kuin digitaalinen käteinen valtiolta. Se olisi virallista rahaa, vain digitaalisessa muodossa. Yksityiskohdat riippuvat kyseisestä maasta."
  },
  "transactionStatus": {
    "title": "Tapahtuman tila",
    "original": "Transaction Status",
    "short": "Ilmaisee, onko tapahtuma vielä avoinna vai jo suoritettu.",
    "desc": "Kuten paketin seurannassa: odottava, vahvistettu tai epäonnistunut. Näin voit nähdä, sujuiko kaikki. Joskus se kestää hetken."
  },
  "gasFee": {
    "title": "Gasmaksu",
    "original": "Gas Fee",
    "short": "Maksu laskentatyöstä verkossa.",
    "desc": "Kuten käsittelymaksu markkinakojulla. Mitä vilkkaampaa on, sitä kalliimmaksi se voi tulla. Kaikki lohkoketjut eivät kutsu sitä kaasuksi."
  },
  "onChain": {
    "title": "On-chain",
    "original": "On-Chain",
    "short": "Tapahtuu suoraan lohkoketjussa.",
    "desc": "Kuin merkintä suoraan kirjanpitoon. Kuka tahansa voi nähdä sen. Se on läpinäkyvä, mutta usein hitaampi tai kalliimpi."
  },
  "offChain": {
    "title": "Off-chain",
    "original": "Off-Chain",
    "short": "Tapahtuu lohkoketjun ulkopuolella.",
    "desc": "Kuin suullinen sopimus, joka myöhemmin kirjataan päiväkirjaan. Tämä voi olla nopeampi ja kustannustehokkaampi. Luottamus on tässä suuremmassa roolissa."
  },
  "liquidity": {
    "title": "Likviditeetti",
    "original": "Liquidity",
    "short": "Näyttää, kuinka helposti jokin voidaan käsitellä.",
    "desc": "Ostajien ja myyjien määrä. Korkea likviditeetti tarkoittaa, että voit käydä kauppaa nopeasti vaikuttamatta merkittävästi hintaan. Matala likviditeetti tuntuu hitaalta."
  },
  "volatility": {
    "title": "Volatiliteetti",
    "original": "Volatility",
    "short": "Kuinka paljon hinnat vaihtelevat.",
    "desc": "Kuin markkina, jolla on villejä hintavaihteluita. Korkea volatiliteetti tarkoittaa mahdollisuuksia, mutta myös riskiä. Aloittelijoille tämä voi olla stressaavaa."
  },
  "marketCap": {
    "title": "Markkina-arvo",
    "original": "Market Capitalization",
    "short": "Kolikon tai projektin kokonaisarvo.",
    "desc": "Kuten kaikkien markkinoilla olevien hyödykkeiden kokonaisarvo. Se johdetaan karkeasti hinnan ja kierrossa olevan määrän tulona. Suuret arvot vaikuttavat vakaammilta, mutta ne eivät ole automaattisesti sitä."
  },
  "circulatingSupply": {
    "title": "Kiertomäärä",
    "original": "Circulating Supply",
    "short": "Rahojen määrä, joka on tosiasiallisesti liikkeessä.",
    "desc": "Kuten markkinoilla olevien kolikoiden määrä. Kaikki, mikä on olemassa, ei ole vielä kiertoon laskettu. Tämä vaikuttaa hintaan."
  },
  "priceDiscovery": {
    "title": "Hinnoittelu",
    "original": "Price Discovery",
    "short": "Näin hinta määräytyy kysynnän ja tarjonnan mukaan.",
    "desc": "Se on kuin markkinat: tarjonta ja kysyntä kohtaavat. Monet pienet päätökset määrittävät hinnan. Ei ole kiinteää kytkintä."
  },
  "spread": {
    "title": "Kaupankäyntialue",
    "original": "Spread",
    "short": "Ostohinnan ja myyntihinnan välinen ero.",
    "desc": "Kuten tarjouksen ja kysynnän välinen ero kaupassa. Mitä pienempi ero, sitä oikeudenmukaisemmalta se tuntuu. Suuret erot tekevät kaupankäynnistä kalliimpaa."
  },
  "phishing": {
    "title": "Tietojenkalastelu",
    "original": "Phishing",
    "short": "Huijaus valetiedon tai väärennettyjen verkkosivustojen kautta.",
    "desc": "Kuin väärennetty pankkisähköposti, joka houkuttelee sinut ansaan. Tavoitteena on saada sinut luovuttamaan kirjautumistietosi. Älä koskaan klikkaa linkkejä sokkona."
  },
  "scam": {
    "title": "Scam",
    "original": "Scam",
    "short": "Huijaus, jonka tarkoitus on varastaa käyttäjien krypto‑assetit.",
    "desc": "Huijauksia on kryptossa valitettavan paljon, koska siirrot ovat peruuttamattomia eikä ole keskitettyä viranomaista. Tyypillisiä huijauksia: feikki‑giveawayt (”Lähetä 1 XLM, saat 2 takaisin”), feikki‑wallet‑sovellukset, huijaussijoitusalustat tai feikki‑tuki. Nyrkkisääntö: kukaan ei jaa kryptoja ilmaiseksi. Jos se kuulostaa liian hyvältä, se ei todennäköisesti ole totta. Älä koskaan jaa private keytä tai seed phrasea kenellekään—ei koskaan."
  },
  "rugPull": {
    "title": "Rug Pull",
    "original": "Rug Pull",
    "short": "Huijaus, jossa kehittäjät vetävät likviditeetin pois ja katoavat rahoineen.",
    "desc": "Rug pull on yksi yleisimmistä DeFi‑huijauksista. Kaava: projekti julkaisee tokenin, luo hypeä, houkuttelee sijoittajia ja vetää sitten kaiken likviditeetin poolista. Hinta romahtaa nollaan ja tekijät katoavat. Varoitusmerkit: anonyymi tiimi, ei smart‑contract‑auditia, epärealistiset tuottolupaukset, hyvin lyhyt historia. Sijoita vain projekteihin, joilla on läpinäkyvä tiimi ja auditoitu koodi."
  },
  "ponzi": {
    "title": "Ponzi Scheme",
    "original": "Ponzi Scheme",
    "short": "Huijausjärjestelmä, jossa vanhojen sijoittajien tuotot maksetaan uusien rahoilla.",
    "desc": "Ponzi‑järjestelmä lupaa korkeita tuottoja mutta maksaa ne uusien sijoittajien rahasta, ei oikeista voitoista. Se toimii niin kauan kuin uutta rahaa tulee ja romahtaa sitten. Kryptossa on ollut monia Ponzi‑huijauksia, jopa miljardiluokassa. Varoitusmerkit: taatut korkeat tuotot, kiirehtiminen mukaan, hämärä liiketoimintamalli, fokus uusien jäsenten houkutteluun."
  },
  "twoFactorAuth": {
    "title": "Two-Factor Authentication",
    "original": "2FA – Two-Factor Authentication",
    "short": "Lisäturva, joka vaatii toisen vahvistuksen salasanan lisäksi.",
    "desc": "2FA suojaa tilin paljon paremmin kuin pelkkä salasana. Salasanan jälkeen vaaditaan toinen tekijä—esim. koodi authenticator‑sovelluksesta (Google Authenticator, Authy) tai SMS. Tärkeää: SMS‑2FA on heikompi SIM‑swapping‑hyökkäysten vuoksi. Ota 2FA käyttöön kaikissa pörssitileissä. Huom: self‑custody‑lompakoissa ei ole 2FA:ta—private key on ainoa suoja."
  },
  "socialEngineering": {
    "title": "Social Engineering",
    "original": "Social Engineering",
    "short": "Ihmisten manipulointi psykologisilla keinoilla tiedon tai pääsyn saamiseksi.",
    "desc": "Social engineering on usein vaarallisempaa kuin tekniset hyökkäykset, koska se hyödyntää ihmisiä. Keinot: esittäytyä tukena ja pyytää private key; luoda tekaistu kiire (\"Tilisi lukitaan!\"); rakentaa luottamus valeidentiteeteillä. Kryptossa mikään oikea tuki, Stellar‑henkilö tai wallet‑sovellus ei koskaan pyydä private keytä tai seed phrasea. Ei koskaan."
  },
  "smartContract": {
    "title": "Älysopimus",
    "original": "Smart Contract",
    "short": "Ohjelma, joka suorittaa kiinteitä sääntöjä automaattisesti.",
    "desc": "Kuin kone, joka toimii kiinteiden sääntöjen mukaisesti. Se toteuttaa sopimukset automaattisesti. Tämä säästää luottamusta, mutta vaatii selkeitä sääntöjä."
  },
  "programmableLogic": {
    "title": "Automatisoidut säännöt",
    "original": "Programmable Logic",
    "short": "Säännöt, jotka toteutuvat automaattisesti, kun jotain tapahtuu.",
    "desc": "Kuin jos-niin-sääntö automaatissa. Tämä mahdollistaa prosessien hallinnan ilman manuaalista väliintuloa joka kerta. Näin luodaan yksinkertaisia digitaalisia sopimuksia."
  },
  "networkCongestion": {
    "title": "Verkon käyttöaste",
    "original": "Network Congestion",
    "short": "Jos samanaikaisesti on suuri määrä vireillä olevia tapahtumia.",
    "desc": "Kuten liikenneruuhka moottoritiellä. Tapahtumat kestävät kauemmin ja maksut voivat nousta. Vähemmän liikennettä, se nopeutuu jälleen."
  },
  "blockchainTypes": {
    "title": "Lohkoketjutyyppit",
    "original": "Blockchain Types",
    "short": "On olemassa erilaisia lohkoketjuja, joilla on erilaisia tavoitteita.",
    "desc": "Kuten eri ajoneuvotyypit eri reiteille. Jotkut on rakennettu maksuille, toiset ohjelmille. On hyvä tietää tarkoitus."
  },
  "paymentBlockchain": {
    "title": "Maksulohkoketju",
    "original": "Payment Blockchain",
    "short": "Lohkoketju, joka on suunniteltu nopeisiin maksuihin.",
    "desc": "Kuin nopea rahakirjanpito. Keskitytään edullisiin ja nopeisiin siirtoihin. Ominaisuudet pidetään usein tarkoituksella yksinkertaisina."
  },
  "smartContractBlockchain": {
    "title": "Älykkäiden sopimusten lohkoketju",
    "original": "Smart Contract Blockchain",
    "short": "Lohkoketju, joka pystyy suorittamaan ohjelmia ja sovelluksia.",
    "desc": "Kuin markkinat, joissa on paljon myyntiautomaatteja. Maksujen lisäksi siellä voi toimia sääntöjä ja sovelluksia. Tämä tekee niistä monipuolisia, mutta usein monimutkaisempia."
  },
  "blockchainComparison": {
    "title": "Lohkoketjujen vertailu",
    "original": "Blockchain Comparison",
    "short": "Vertailu paljastaa erilaisten lohkoketjujen vahvuudet ja heikkoudet.",
    "desc": "Kuten pankkien tai markkinoiden vertailu: Jokaisella on omat vahvuutensa ja heikkoutensa. Tärkeitä tekijöitä ovat kustannukset, nopeus ja turvallisuus. Täydellistä järjestelmää kaikelle ei ole olemassa."
  },
  "stellarVsBitcoinVsEthereum": {
    "title": "Stellar vs. Bitcoin vs. Ethereum",
    "original": "Stellar vs. Bitcoin vs. Ethereum",
    "short": "Kolme tunnettua lohkoketjua, joilla on erilaiset painopisteet.",
    "desc": "Bitcoin on kuin digitaalinen kulta ja sitä pidetään usein arvon säilyttäjänä. Ethereum on kuin alusta ohjelmille ja sovelluksille. Stellar keskittyy edullisiin maksuihin."
  },
  "mining": {
    "title": "Mining",
    "original": "Mining",
    "short": "Prosessi, jossa tietokoneet ratkaisevat vaikeita laskuja luodakseen uusia lohkoja ja vahvistaakseen siirtoja.",
    "desc": "Mining on Proof‑of‑Work‑lohkoketjujen kuten Bitcoinin ydin. Minerit kilpailevat ratkaistakseen vaikean matemaattisen ongelman. Voittaja lisää seuraavan lohkon ja saa palkkion uusina coineina. Mining kuluttaa valtavasti sähköä ja erikoislaitteita. Stellar ei tarvitse miningia—SCP on energiatehokas ja vahvistaa siirrot sekunneissa."
  },
  "proofOfWork": {
    "title": "Proof of Work",
    "original": "Proof of Work",
    "short": "Konsensusmekanismi, jossa laskentatehoa käytetään siirtojen validointiin ja lohkojen luontiin.",
    "desc": "Proof of Work (PoW) on alkuperäinen mekanismi, jota Bitcoin käyttää. Minereiden pitää käyttää valtavasti laskentatehoa validin lohkon luomiseen—se tekee hyökkäyksistä erittäin kalliita. Haitta: PoW kuluttaa paljon energiaa ja on hidas (Bitcoin ~7 siirtoa sekunnissa). Stellar ja monet uudemmat lohkoketjut valitsivat tehokkaampia vaihtoehtoja."
  },
  "proofOfStake": {
    "title": "Proof of Stake",
    "original": "Proof of Stake",
    "short": "Konsensus, jossa validaattorit lukitsevat coineja vakuudeksi laskentatehon sijaan.",
    "desc": "Proof of Stake (PoS) -mallissa validaattorit valitaan luomaan lohkoja heidän stakaamiensa coinien perusteella. Ethereum siirtyi PoS:ään vuonna 2022 ja vähensi energiankulutusta yli 99 %. PoS on tehokkaampi kuin PoW, mutta siihen liittyy riskejä kuten vallan keskittyminen suurille omistajille. Stellar käyttää ei PoW:ta eikä PoS:ää, vaan omaa SCP‑konsensustaan."
  },
  "fork": {
    "title": "Fork",
    "original": "Fork",
    "short": "Protokollamuutos, joka voi olla taaksepäin yhteensopiva (soft fork) tai yhteensopimaton (hard fork).",
    "desc": "Soft fork on taaksepäin yhteensopiva—vanhat nodet voivat jatkaa. Hard fork on suuri muutos, joka voi jakaa verkon: päivittämättömät nodet seuraavat vanhaa ketjua. Tunnettuja hard forkkeja: Bitcoin Cash (2017) ja Ethereum Classic (2016). Stellar tekee päivitykset validaattoriäänestyksillä—hallittu prosessi ilman hallitsemattomia jakautumisia."
  },
  "layer1Layer2": {
    "title": "Layer 1 / Layer 2",
    "original": "Layer 1 / Layer 2",
    "short": "Layer 1 on peruslohkoketju; Layer 2 on sen päälle rakennettu skaalausratkaisu.",
    "desc": "Layer 1 (L1) on päälohkoketju—esim. Bitcoin, Ethereum tai Stellar. Layer 2 (L2) on L1:n päälle rakennettu protokolla, joka parantaa nopeutta ja kustannuksia. Esimerkkejä: Lightning Network (Bitcoin) tai Polygon (Ethereum). Stellar on L1‑ketju, joka on SCP:n ansiosta jo nopea ja edullinen, joten se tarvitsee vähemmän L2‑ratkaisuja."
  },
  "bridge": {
    "title": "Bridge",
    "original": "Bridge",
    "short": "Protokolla, joka siirtää assetteja kahden eri lohkoketjun välillä.",
    "desc": "Koska lohkoketjut ovat yleensä erillisiä, bridget mahdollistavat assettien siirron ketjujen välillä. Esimerkki: Ethereum–Stellar‑bridge voi siirtää USDC:tä Ethereumista Stellariin. Teknisesti assetit lukitaan lähdeketjussa ja luodaan wrapped‑tokeneina kohdeketjussa. Bridget ovat hyödyllisiä mutta myös usein hyökkäysten kohteena. Stellarissa anchorit hoitavat usein vastaavaa roolia."
  },
  "interoperability": {
    "title": "Interoperabiliteetti",
    "original": "Interoperability",
    "short": "Eri lohkoketjujen kyky kommunikoida ja vaihtaa assetteja.",
    "desc": "Interoperabiliteetti on yksi kryptomaailman suurista haasteista. Tänään on satoja lohkoketjuja, jotka eivät keskustele keskenään—kuin saaria ilman siltoja. Ratkaisuja ovat bridget, cross‑chain‑protokollat tai standardit kuten IBC. Stellarilla interoperabiliteetti on ydintavoite: anchor‑järjestelmä yhdistää perinteiseen finanssiin ja bridgit yhdistävät Stellar‑verkon muihin ketjuihin."
  },
  "whitepaper": {
    "title": "Whitepaper",
    "original": "Whitepaper",
    "short": "Tekninen dokumentti, joka kuvaa projektin idean, teknologian ja tavoitteet.",
    "desc": "Whitepaper on kryptoprojektin perustamisdokumentti. Bitcoin syntyi Satoshi Nakamoton vuonna 2008 julkaistusta whitepaperista. Hyvä whitepaper selittää ongelman, ratkaisun, teknologian ja tokenomicsin. Ennen sijoittamista whitepaper kannattaa lukea. Jos se puuttuu tai on epämääräinen, se on usein varoitusmerkki. Stellar‑whitepaper kuvaa SCP:tä ja on julkinen."
  },
  "ico": {
    "title": "ICO / Token Sale",
    "original": "ICO – Initial Coin Offering",
    "short": "Rahoitusmenetelmä, jossa uusia tokeneita myydään julkisesti—kuten IPO.",
    "desc": "ICO on kuin IPO kryptoprojekteille. Projekti myy uusia tokeneita kerätäkseen pääomaa. ICO:t olivat suosittuja 2017–2018, mutta usein sääntelemättömiä tai huijauksia. Monet projektit eivät koskaan toimittaneet tuotetta. Nykyään sääntely on tiukempaa. Vaihtoehtoja: IEO (Initial Exchange Offering) tai IDO (Initial DEX Offering). Aloittelijoiden kannattaa olla erittäin varovaisia ICO‑sijoitusten kanssa."
  },
  "airdrop": {
    "title": "Airdrop",
    "original": "Airdrop",
    "short": "Ilmainen tokeneiden jakelu lompakko‑osoitteille, yleensä markkinointia varten.",
    "desc": "Airdropissa käyttäjät saavat tokeneita ilmaiseksi—palkintona varhaisesta tuesta, yhteisöaktiviteetista tai pelkästään tietyn lompakon omistamisesta. Airdropit ovat suosittu markkinointikeino. Tärkeää: aidot airdropit eivät koskaan pyydä yksityisiä avaimia tai etumaksuja. Monet airdropit ovat huijauksia—älä koskaan syötä yksityistä avainta airdropin saamiseksi. Stellarissa airdropit voidaan toteuttaa siististi claimable balances -toiminnolla."
  },
  "money": {
    "title": "Raha",
    "original": "Money",
    "short": "Raha on yleisesti hyväksytty vaihtoväline tavaroille ja palveluille.",
    "desc": "Rahalla on kolme tehtävää: se on vaihtoväline, arvon säilyttäjä ja laskentayksikkö. Historiallisesti raha on esiintynyt monissa muodoissa – simpukoista kultaan ja nykyisiin seteleihin sekä digitaaliseen rahaan. Nykyaikainen raha perustuu pääasiassa luottamukseen liikkeeseenlaskevaan valtioon, ei fyysisiin arvoihin."
  },
  "fiatCurrency": {
    "title": "Fiat-valuutta",
    "original": "Fiat Currency",
    "short": "Valtion liikkeeseen laskema valuutta ilman fyysisen raaka-aineen, kuten kullan, katetta.",
    "desc": "Fiat-valuutoilla kuten eurolla, dollarilla tai frangilla ei ole sisäistä arvoa – niiden arvo perustuu luottamukseen liikkeeseenlaskevaan valtioon ja sen talouteen. Keskuspankit voivat painaa fiat-valuuttoja rajattomasti, mikä voi johtaa inflaatioon. Sen sijaan monien kryptovaluuttojen tarjonta on tiukasti rajattu."
  },
  "centralBank": {
    "title": "Keskuspankki",
    "original": "Central Bank",
    "short": "Valtion instituutio, joka hallitsee maan tai valuutta-alueen rahapolitiikkaa.",
    "desc": "Keskuspankit kuten Euroopan keskuspankki (EKP) tai Yhdysvaltain keskuspankki (Fed) hallitsevat rahan tarjontaa, asettavat korkotasoja ja varmistavat rahoitusjärjestelmän vakauden. Ne voivat painaa rahaa, ja niillä on monopoli käteisen liikkeeseenlaskuun. Kryptovaluutat kehitettiin vaihtoehdoksi keskitetyille rahajärjestelmille – ilman keskuspankkia, ilman yhtä hallitsevaa tahoa."
  },
  "inflation": {
    "title": "Inflaatio",
    "original": "Inflation",
    "short": "Yleinen hintatason nousu, joka vähentää rahan ostovoimaa.",
    "desc": "Inflaatiossa raha menettää arvoaan ajan myötä – samalla summalla saa vähemmän. Syitä ovat mm. liikaa rahaa kierrossa, kasvava kysyntä tai toimitushäiriöt. Monet näkevät Bitcoinin ja muut rajatun tarjonnan kryptovaluutat suojana inflaatiota vastaan, samaan tapaan kuin kulta. XLM:llä puolestaan on maltillinen vuotuinen inflaatioaste, jonka verkko määrittää."
  },
  "currency": {
    "title": "Valuutta",
    "original": "Currency",
    "short": "Tunnustettu arvonvaihtojärjestelmä tietyn talousalueen sisällä.",
    "desc": "Valuutta on maan tai alueen virallinen maksuväline (esim. EUR, USD, CHF). Kryptovaluuttojen maailmassa termiä käytetään usein synonyyminä sanalle 'kolikko' tai 'kryptovaluutta'. Ero 'omaisuuserään': valuutta toimii ensisijaisesti vaihtovälineenä, kun taas omaisuuserä on laajempi käsite kaikille arvon säilyttäjille – mukaan lukien osakkeet, kiinteistöt tai tokenit."
  },
  "cryptography": {
    "title": "Kryptografia",
    "original": "Cryptography",
    "short": "Turvallisen viestinnän tiede matemaattisten salausmenetelmien avulla.",
    "desc": "Kryptografia on kaikkien lohkoketjuteknologioiden perusta. Se varmistaa, että tietoja voivat lukea vain valtuutetut henkilöt ja että tapahtumia ei voida väärentää. Ilman kryptografiaa Bitcoin, Stellar tai mikään muu kryptovaluutta ei olisi mahdollinen. Termi tulee kreikan sanoista 'kryptos' (kätketty) ja 'graphein' (kirjoittaa)."
  },
  "hash": {
    "title": "Tiiviste",
    "original": "Hash",
    "short": "Ainutlaatuinen digitaalinen sormenjälki, joka lasketaan mistä tahansa datasta.",
    "desc": "Tiivistefunktio muuntaa minkä tahansa datan (tekstin, tiedostot, tapahtumat) kiinteäksi merkkijonoksi – esim. 'a3f8c2...'. Samat syötetiedot tuottavat aina saman tiivisteen. Jos edes yksi merkki muuttuu, tiiviste muuttuu kokonaan. Tämä tekee tiivisteistä ihanteellisia manipuloinnin havaitsemiseen. Lohkoketjuissa jokainen lohko tunnistetaan yksilöllisesti tiivisteensä perusteella."
  },
  "encryption": {
    "title": "Salaus",
    "original": "Encryption",
    "short": "Luettavan datan muuntaminen lukukelvottomaan muotoon, joka voidaan purkaa vain oikealla avaimella.",
    "desc": "Salaus suojaa dataa luvattomalta pääsyltä. Päätyyppejä on kaksi: symmetrinen salaus (yksi avain salaukseen ja purkamiseen) ja epäsymmetrinen salaus (julkinen avain salaamiseen, yksityinen avain purkamiseen). Lompakot ja lohkoketjutapahtumat käyttävät epäsymmetristä salausta."
  },
  "digitalSignature": {
    "title": "Digitaalinen allekirjoitus",
    "original": "Digital Signature",
    "short": "Kryptografinen todiste siitä, että viestin tai tapahtuman on valtuuttanut sen oikea omistaja.",
    "desc": "Digitaalinen allekirjoitus toimii samaan tapaan kuin käsin kirjoitettu allekirjoitus – mutta se on väärentämisen kestävä. Stellarissa allekirjoitat jokaisen tapahtuman yksityisellä avaimellasi. Verkko voi julkisella avaimellasi tarkistaa, onko allekirjoitus kelvollinen – näkemättä koskaan yksityistä avaintasi. Ilman kelvollista allekirjoitusta verkko hylkää tapahtuman."
  },
  "publicKeyCryptography": {
    "title": "Julkisen avaimen kryptografia",
    "original": "Public-Key Cryptography",
    "short": "Salausmenetelmä kahdella toisiinsa liitetyllä avaimella: julkisella ja yksityisellä.",
    "desc": "Periaate: julkisella avaimella salattu voidaan purkaa vain yksityisellä avaimella – ja päinvastoin. Voit jakaa julkisen avaimesi (= lompakko-osoitteesi) vapaasti. Yksityinen avaimesi pysyy salassa. Kuka tahansa, joka tuntee yksityisen avaimesi, saa täyden pääsyn tiliisi. Siksi: älä koskaan jaa yksityistä avaintasi!"
  },
  "keyPair": {
    "title": "Avainpari",
    "original": "Key Pair",
    "short": "Julkisen ja yksityisen avaimen yhdistelmä, jotka yhdessä muodostavat kryptotilin.",
    "desc": "Avainpari koostuu julkisesta avaimesta (osoitteesi, jonka muut saavat nähdä) ja yksityisestä avaimesta (salasanasi, joka pysyy salassa). Stellarissa julkinen avain esitetään G-osoitteena, yksityinen avain alkaa S-kirjaimella. Avainpari luodaan matemaattisesti, ja sitä on käytännössä mahdotonta väärentää tai arvata."
  },
  "signing": {
    "title": "Allekirjoittaminen",
    "original": "Signing",
    "short": "Tapahtuman valtuuttaminen tilinomistajan yksityisellä avaimella.",
    "desc": "Ennen kuin tapahtuma suoritetaan Stellar-verkossa, se on allekirjoitettava. Yksityisellä avaimella luodaan digitaalinen allekirjoitus, joka todistaa, että tilin oikea omistaja on hyväksynyt tapahtuman. Ilman kelvollista allekirjoitusta verkko hylkää tapahtuman. Multisig-tileillä tarvitaan useita allekirjoituksia."
  },
  "sequenceNumber": {
    "title": "Järjestysnumero",
    "original": "Sequence Number",
    "short": "Juokseva numero, joka yksilöi tilin jokaisen tapahtuman ja estää kaksinkertaisen kulutuksen.",
    "desc": "Jokaisella Stellar-tilillä on järjestysnumero, joka kasvaa yhdellä jokaisen tapahtuman myötä. Tapahtuma hyväksytään vain, jos sen järjestysnumero vastaa tarkasti tilin nykyistä sekvenssiä +1. Tämä estää saman tapahtuman suorittamisen kahdesti. Jos lähetät useita tapahtumia samanaikaisesti, ne on käsiteltävä oikeassa järjestyksessä."
  },
  "baseReserve": {
    "title": "Perusvaranto",
    "original": "Base Reserve",
    "short": "XLM:n vähimmäismäärä, joka Stellar-tilillä on säilytettävä eikä sitä voi käyttää.",
    "desc": "Stellarissa jokaisen tilin on pidettävä vähimmäissaldo XLM:ssä. Tämä lasketaan perusvarannosta (tällä hetkellä 0,5 XLM) kerrottuna tilin 'merkintöjen' lukumäärällä (esim. trustlinet, allekirjoittajat, datatarjoukset). Tyhjä tili tarvitsee vähintään 1 XLM (2 × 0,5 XLM). Jokainen trustline nostaa vähimmäissaldoa 0,5 XLM:llä. Tämä saldo on lukittu niin kauan kuin merkinnät ovat aktiivisia."
  },
  "coin": {
    "title": "Kolikko",
    "original": "Coin",
    "short": "Lohkoketjun natiivi kryptovaluutta, joka on olemassa suoraan kyseisessä lohkoketjussa.",
    "desc": "Kolikko on lohkoketjun 'oma' valuutta. Bitcoin (BTC) on Bitcoin-lohkoketjun kolikko, Ether (ETH) Ethereumin kolikko, XLM Stellarin kolikko. Kolikot luodaan suoraan verkkoprotokollan kautta, ja niitä käytetään pääasiassa tapahtumamaksujen maksamiseen. Sen sijaan tokenit lasketaan liikkeeseen kolmansien osapuolten toimesta olemassa olevalla lohkoketjulla."
  },
  "coinVsToken": {
    "title": "Coin vs. Token",
    "original": "Coin vs. Token",
    "short": "Kolikot ovat lohkoketjun natiiveja valuuttoja, tokenit lasketaan liikkeeseen kolmansien osapuolten toimesta olemassa olevalla lohkoketjulla.",
    "desc": "Pääero: kolikko on olemassa omalla lohkoketjullaan (BTC Bitcoinissa, XLM Stellarissa). Token luodaan jonkun toimesta jo olemassa olevalle lohkoketjulle – esim. yritys, joka laskee liikkeeseen oman stablecoininsa Stellarissa. Tokenit eivät tarvitse omaa lohkoketjua. Stellarissa itse luodut tokenit kutsutaan 'asseteiksi'. Arkikielessä termit sekoitetaan usein, mikä aiheuttaa hämmennystä."
  },
  "nativeCoin": {
    "title": "Natiivi kolikko",
    "original": "Native Coin",
    "short": "Lohkoketjun alkuperäinen maksuväline, jota verkko itse hallinnoi.",
    "desc": "Jokaisella lohkoketjulla on natiivi kolikko, jota käytetään tapahtumamaksuihin ja verkon perustoimintoihin. Stellarissa XLM on natiivi kolikko. Se ei ole kolmannen osapuolen token, vaan se on rakennettu suoraan protokollaan. Natiivi kolikko on usein myös roskapostin estämisen keino – Stellarissa jokaisen tapahtuman on maksettava pieni XLM-maksu."
  },
  "fungibility": {
    "title": "Vaihdettavuus",
    "original": "Fungibility",
    "short": "Omaisuuserän ominaisuus, jossa jokainen yksikkö on identtinen ja vaihdettavissa mihin tahansa toiseen.",
    "desc": "Vaihdettava omaisuuserä on kuin seteli: jokainen 10 euron seteli on yhtä arvokas kuin mikä tahansa muu. Kryptovaluutoissa kuten XLM, BTC tai USDC jokainen yksikkö on identtinen – yksi XLM on aina yhtä kuin toinen XLM. Vastakohta ovat NFT:t (ei-vaihdettavat tokenit): jokainen NFT on ainutlaatuinen eikä vaihdettavissa. Vaihdettavuus on tärkeä ominaisuus valuuttakäytössä."
  },
  "wrappedToken": {
    "title": "Wrapped Token",
    "original": "Wrapped Token",
    "short": "Token, joka edustaa toisen omaisuuserän arvoa eri lohkoketjussa.",
    "desc": "Wrapped token mahdollistaa yhden lohkoketjun omaisuuserien käytön toisella. Esimerkki: Wrapped Bitcoin (WBTC) on token Ethereumissa, joka on 1:1 katettu oikealla Bitcoinilla. Alkuperäinen lukitaan älysopimukseen ja vastineeksi lasketaan liikkeeseen wrapped token. Stellarissa Bitcoin tai Ether voidaan laskea liikkeeseen wrapped tokeneina ankkurien kautta, jolloin niillä voi käydä kauppaa Stellar-verkossa."
  },
  "syntheticAsset": {
    "title": "Synteettinen omaisuuserä",
    "original": "Synthetic Asset",
    "short": "Token, joka jäljittelee todellisen omaisuuserän hintaa ilman, että sitä suoraan omistetaan.",
    "desc": "Synteettiset omaisuuserät jäljittelevät muiden omaisuuserien arvoa – esim. osakkeita, kultaa tai valuuttoja – omistamatta alkuperäistä. Ne turvataan älysopimusten ja vakuuksien avulla. Esimerkki: synteettinen Apple-osaketoken seuraa oikean osakkeen kurssia, mutta on kryptotoken. Synteettiset omaisuuserät ovat edistynyt DeFi-konsepti."
  },
  "memeCoin": {
    "title": "Meemikolikko",
    "original": "Meme Coin",
    "short": "Kryptovaluutta, joka perustuu internet-meemiin tai vitsiin eikä yleensä ole teknisesti hyödyllinen.",
    "desc": "Meemikolikot kuten Dogecoin (DOGE) tai Shiba Inu (SHIB) syntyivät alun perin vitsinä, mutta saavuttivat toisinaan valtavia markkina-arvoja yhteisön innostuksen ja sosiaalisen median huomion ansiosta. Niillä ei yleensä ole teknistä lisäarvoa ja ne ovat erittäin spekulatiivisia. Niiden arvo perustuu lähes yksinomaan tunnelmaan ja trendeihin. Aloittelijoille meemikolikot ovat erityisen riskialttiita."
  },
  "stellarAsset": {
    "title": "Stellar-omaisuuserä",
    "original": "Stellar Asset",
    "short": "Mikä tahansa Stellar-verkossa liikkeeseen laskettu omaisuuserä, joka määritellään omaisuuskoodilla ja liikkeeseenlaskijan osoitteella.",
    "desc": "Stellarissa kuka tahansa voi luoda oman omaisuuserän – yritys oman kanta-asiakastokeninsa, pankki oman stablecoininsa. Jokainen Stellar-omaisuuserä tunnistetaan yksilöllisesti kahdella komponentilla: omaisuuskoodilla (esim. 'USD', 'MOBI', 'USDC') ja liikkeeseenlaskijan G-osoitteella (issuer). Kaksi omaisuuserää samalla koodilla mutta eri liikkeeseenlaskijalla ovat eri omaisuuseriä. Stellar-omaisuuserän vastaanottamiseksi on ensin luotava trustline liikkeeseenlaskijalle."
  },
  "issuedAsset": {
    "title": "Liikkeeseen laskettu omaisuuserä",
    "original": "Issued Asset",
    "short": "Ankkurin tai yrityksen Stellarissa liikkeeseen laskema omaisuuserä, joka edustaa todellista vastinetta.",
    "desc": "Liikkeeseen laskettu omaisuuserä on ankkurin liikkeeseen laskema Stellar-omaisuuserä, joka edustaa todellista arvoa – esim. Yhdysvaltain dollareita, euroja tai kultaa. Ankkuri säilyttää todellisen vastineen ja laskee liikkeeseen vastaavat tokenit Stellarissa. Käyttäjät voivat pitää hallussaan ja käydä kauppaa näillä tokeneilla. Saadakseen todellisen omaisuuserän takaisin, tokenit lunastetaan ankkurilta (offramp). Tunnettuja esimerkkejä ovat USDC (Circle) tai EURC."
  },
  "missingKey": "Sanastosta puuttuu avain: {{detail}}",
  "zkp": {
    "title": "Nollatietotodistus",
    "original": "Zero-Knowledge Proof (ZKP)",
    "short": "Todistaa vaittaman oikeaksi paljastamatta taustalla olevia tietoja.",
    "desc": "Kuvittele, etta haluat todistaa olevasi tarpeeksi vanha ilman henkilokorttisi nayttamista. Nollatietotodistus (ZKP) tekee juuri sen: todistaa vaitteen oikeaksi paljastamatta taustalla olevia tietoja.\n\nArkiesimerkki:\nTodistan verkkosivustolle olevani yli 18 ilman nimea, syntymaikaa tai kuvaa. Sivusto saa tietaa vain: Kylla, tarpeeksi vanha.\n\nMerkitys Stellarille ja lohkoketjulle:\n- Yksityisyyden suojaavat maksut\n- KYC-todistus ilman henkilotietojen jakamista\n- Skaalaus pakatuilla todistuksilla (zk-SNARKs, zk-STARKs)\n\nLuotettavien ZKP-lahteiden tunnistaminen:\n- Suosi .org- tai .edu-verkkotunnuksia\n- Tarkista projektin GitHub-aktiivisuus\n- Etsi akateemisia viittauksia tai whitepapereia",
    "externalDomains": [
      "ethereum.org/en/zero-knowledge-proofs",
      "zkhack.dev",
      "zkproof.org"
    ],
    "domainsHeading": "Lisalukemista (kirjoita osoite itse):"
  },
  "walletWatcher": {
    "title": "Wallet Watcher / Drainer",
    "original": "Wallet Watcher / Drainer",
    "short": "Automaattinen skripti, joka valvoo vaarantunutta tiliä ja nostaa välittömästi jokaisen uuden talletuksen.",
    "desc": "Kun huijarit saavat pääsyn salaavaimeen, he asentavat usein automaattisen tarkkailijan. Se valvoo tiliä ympäri vuorokauden ja siirtää jokaisen uuden talletuksen välittömästi huijarin tilille – usein muutamassa sekunnissa. Tili on pysyvästi vaarantunut. Ainoa ratkaisu: luo välittömästi uusi lompakko täysin uusilla avaimilla äläkä käytä vanhaa tiliä enää koskaan."
  }
}
