{
  "pageTitle": "Sanasto",
  "pageIntro": "Täältä löydät tärkeitä sanoja lohkoketjumaailmasta ja Stellar-verkostosta. Kaikki on selitetty yksinkertaisin termein.",
  "searchLabel": "Hakusana",
  "searchPlaceholder": "Hakuehto (z. B. Konto, Account, Muxed)",
  "searchHint": "Haku löytää sanoja ja selityksiä.",
  "noResults": "Ei vastinetta.",
  "groups": {
    "accountsKeys": "Tilit ja avaimet",
    "multisigSecurity": "Multisig ja tilin turvallisuus",
    "walletsCustody": "Lompakot ja säilytys",
    "tokensAssets": "Tokenit ja assetit",
    "transactionsFees": "Transaktiot ja maksut",
    "marketsTrading": "Markkinat ja treidaus",
    "networkProtocol": "Verkko ja protokolla",
    "smartContracts": "Älysopimukset",
    "blockchainBasics": "Lohkoketjun perusteet",
    "security": "Turvallisuus ja huijaukset"
  },
  "blockchain": {
    "title": "Lohkoketju",
    "original": "Blockchain",
    "short": "Yhteinen digitaalinen kirjanpito – monet tietokoneet tallentavat samat merkinnät.",
    "desc": "Lohkoketju on kuin digitaalinen kirjanpito. Monet tietokoneet tallentavat samat merkinnät, joten kukaan ei voi salaa muuttaa mitään."
  },
  "wallet": {
    "title": "Lompakko",
    "original": "Wallet",
    "short": "Digitaalinen lompakko, joka hallitsee avaimiasi.",
    "desc": "Lompakko on digitaalinen kukkarosi. Se hallinnoi avaimia, joita tarvitset käyttääksesi tiliäsi ja lähettääksesi tapahtumia. Lompakko voi olla ohjelma, sovellus tai jopa pelkkä paperi, jossa on yksityinen avaimesi."
  },
  "account": {
    "title": "Tili",
    "original": "Account",
    "short": "Lohkoketjutili voi pitää hallussaan varoja ja lähettää siirtoja.",
    "desc": "Tili on paikka lohkoketjussa, jossa varasi säilytetään. Tilillä on julkinen osoite, joka alkaa kirjaimella G. Useat lompakot voivat käyttää samaa tiliä, jos niillä on oikea avain."
  },
  "addressG": {
    "title": "G-osoite",
    "original": "G Address",
    "short": "Stellar-tilin julkinen avain (beginnt mit G).",
    "desc": "G-osoite on Stellar-tilin pääosoite. Se alkaa kirjaimella G. Annat sen muille, jotta he voivat lähettää sinulle jotain."
  },
  "publicKey": {
    "title": "Julkinen avain",
    "original": "Public Key",
    "short": "Adresse, die du teilen darfst; bei Stellar meist die G‑Adresse.",
    "desc": "Julkinen avain on osoite, jonka voit jakaa. Stellarissa tämä on G-osoite. Muut käyttävät sitä lähettääkseen sinulle rahaa."
  },
  "privateKey": {
    "title": "Salainen avain",
    "original": "Secret Key",
    "short": "Tilin salasanaa – älä koskaan jaa.",
    "desc": "Salainen avain on tilisi salasana. Jokainen, jolla on tämä avain, voi siirtää rahasi. Älä jaa sitä koskaan."
  },
  "addressFederation": {
    "title": "Federationin osoite",
    "original": "Federation Address",
    "short": "Kurze Adresse wie E‑Mail, zeigt auf eine G‑Adresse.",
    "desc": "Federation-osoite näyttää sähköpostilta. Esimerkki: nimi*domain.com. Tämä lyhyt osoite viittaa normaaliin G-osoitteeseen. Se on helpompi muistaa."
  },
  "addressMuxed": {
    "title": "Yhdistetty tili",
    "original": "Muxed Account",
    "short": "M‑osoite lisä-ID:llä – jakaa perustilin.",
    "desc": "M-osoite viittaa olemassa olevaan Stellar-tiliin, mutta siinä on lisänä yksilöllinen tunniste (ID). Tämä mahdollistaa esimerkiksi useiden henkilöiden tai osastojen erottamisen saman G-osoitteen alla. Teknisesti varat kuuluvat silti päätilille."
  },
  "multisig": {
    "title": "Moniallekirjoitus",
    "original": "Multi‑Sig",
    "short": "Tärkeät toimet vaativat enemmän kuin pelkän allekirjoituksen.",
    "desc": "Multi-Sig tarkoittaa useita allekirjoituksia. Tärkeä toimenpide vaatii useampaa kuin yhtä avainta. Esimerkiksi sinun ja toisen avaimen täytyy molempien hyväksyä, ennen kuin jotain voidaan lähettää. Tämä tekee varkaudesta vaikeampaa.",
    "help": {
      "title": "Yleinen selitys moniallekirjoitustilistä (Multi-Signature) yritystiliin liittyen.",
      "intro": "Yritys voi käyttää yhteistä lohkoketjutiliä, johon kuuluu useita valtuutettuja henkilöitä. Tyypillisesti mukana on vähintään kolme allekirjoittajaa (Signer), kuten johto, talousjohtaja ja compliance-/varahenkilö. Tavoitteena on, että yksittäiset henkilöt voivat itsenäisesti suorittaa maksuja ilman, että yhdelläkään henkilöllä on yksinään tilin hallintaa tai haltuunottoa.",
      "problem": "Jos allekirjoittajalla (Signer) on riittävästi painoarvoa maksujen suorittamiseen ja samanaikaisesti riittävästi painoarvoa tilin muutosten tekemiseen, voi kyseinen henkilö poistaa muita allekirjoittajia (Signer) tai säätää kynnysarvoa/painotusta (Thresholds) ja siten ottaa tilin hallintaansa. Toisaalta alkuperäisen omistajan ei myöskään pitäisi voida sulkea muita allekirjoittajia (Signer) pois ilman tarkastuksia ja tasapainotuksia. Multi-sig-rakenne varmistaa, että tärkeät päätökset saavat aina useiden henkilöiden yhteisen tuen.",
      "setupTitle": "Esimerkki turvallisesta multi-sig-rakenteesta, jossa on kolme allekirjoittajaa.",
      "setupWeights": "Esimerkissä, jossa on kolme vastaavaa roolia, kaikki saavat saman allekirjoitusvoimakkuuden:\n- Allekirjoittaja (Signer) A (management): paino 2\n- Allekirjoittaja (Signer) B (Finanzen): paino 2\n- Allekirjoittaja (Signer) C (Compliance/Backup): paino 2",
      "setupThresholds": "Sopivat kynnysarvot/painotukset on asetettu:\n- Low (low_threshold): 1\n- Medium (med_threshold): 2 (for payments and other medium actions)\n- High (high_threshold): 4 (rakenteellisten muutosten, kuten allekirjoittajien lisääminen/poistaminen (Signer) tai kynnysarvon/painotuksen muuttaminen (Thresholds))\nTämä asetus mahdollistaa jokaiselle valtuutetulle henkilölle maksujen suorittamisen, mutta yksikään henkilö ei voi yksin muuttaa tilin rakennetta.",
      "behavior": "Tämän konfiguraation avulla maksut voidaan suorittaa minkä tahansa kolmen valtuutetun henkilön toimesta yksin, koska kunkin henkilön painoarvo täyttää keskitason kynnyksen/painoarvon (Threshold). Kuitenkin rakenteellisiin muutoksiin, kuten allekirjoittajan poistamiseen (Signers), kynnysten/painoarvojen säätämiseen tai tilin yhdistämiseen tai sulkemiseen, vaaditaan korkea kynnys/painoarvo (high_threshold). Tämä arvo voidaan saavuttaa vain, jos vähintään kaksi kolmesta allekirjoittajasta (Signer) allekirjoittaa yhdessä. Tällä tavalla tili pysyy joustavana päivittäisessä käytössä ja on hyvin suojattu väärinkäytöksiä vastaan.",
      "removal": "Jos henkilö poistuu yrityksestä tai ei ole enää luotettava, kaksi jäljellä olevaa allekirjoittajaa (Signer) voivat yhdessä poistaa tämän henkilön allekirjoitusoikeudet. Yksittäinen allekirjoittaja (Signer) – ei työntekijä eikä johto – voi itsenäisesti sulkea muita pois tililtä. Oikeuksien poistaminen tapahtuu siis aina hallitusti ja jäljitettävästi vähintään kahden vastuuhenkilön toimesta.",
      "summary": "Tällainen multisignatuuri-rakenne mahdollistaa yksittäisten henkilöiden suorittaa maksuja tehokkaasti samalla kun tilin hallinta säilyy useiden osapuolten käsissä. Se vähentää tilin kaappausten riskiä, suojaa yksipuolisilta päätöksiltä ja on erityisen sopiva yritystileille, joissa sekä turvallisuus että operatiivinen joustavuus ovat tärkeitä.",
      "closeLabel": "Sulje",
      "linkLabel": "Mitä tarkoittaa Multi-Signature?",
      "glossaryLinkLabel": "Katso sanastosta"
    }
  },
  "multisigCorporate": {
    "title": "Multisig yrityksissä",
    "original": "Multi-Signature (corporate example)",
    "short": "Esimerkki multisig-rakenteesta yritystileille rooleineen, painoineen ja kynnyksineen."
  },
  "trustline": {
    "title": "Trustline",
    "original": "Trustline",
    "short": "Sopimus tietyn liikkeeseenlaskijan tokenin hallussapidosta.",
    "desc": "Luottolinja on kuin sanomalla kyllä, hyväksyn tämän tokenin. Näin tehdessäsi osoitat, että tilisi on valmis pitämään tietyn tokenin tietystä liikkeellelaskijasta. Ilman luottolinjaa et voi vastaanottaa tätä tokenia.\n\nEsimerkki: Luottolinja ilmoitetaan muodossa KOODI:LIIKKEELLELASKIJA. EURT:n tapauksessa liikkeellelaskijalta GDUKMGUGDZQK6Y…, se on EURT:GDUKMGUGDZQK6Y…"
  },
  "token": {
    "title": "Poletto",
    "original": "Token",
    "short": "Digitaalinen yksikkö – esim. rahaa, pisteitä tai hyvityksiä.",
    "desc": "Token on lohkoketjussa oleva digitaalinen yksikkö. Token voi edustaa rahaa, pisteitä tai palvelun hyvitystä."
  },
  "asset": {
    "title": "Varallisuus",
    "original": "Asset",
    "short": "Stellar-verkossa olevat tokenit ovat aina yhteydessä liikkeeseenlaskijaan.",
    "desc": "Stellarissa tokeneita kutsutaan varoiksi. Omaisuus on aina liitetty liikkeeseenlaskevaan tiliin. Esimerkiksi tili voi laskea liikkeelle euro-tokeneita. Tämä euro-token on sitten omaisuus."
  },
  "xlm": {
    "title": "XLM",
    "original": "XLM",
    "short": "Stellarin alkuperäisvaluutta maksuille ja aktivoinnille.",
    "desc": "XLM on Stellarin oma valuutta. Tarvitset XLM:ää maksujen suorittamiseen ja uuden tilin avaamiseen."
  },
  "mainnet": {
    "title": "Pääverkko",
    "original": "Mainnet",
    "short": "Echtes Stellar‑Netzwerk mit realem Wert.",
    "desc": "Todellinen Stellarin verkko, jolla on todellista arvoa. Tapahtumat ovat lopullisia, ja maksut suoritetaan todellisella XLM:llä."
  },
  "testnet": {
    "title": "Testiverkko",
    "original": "Testnet",
    "short": "Julkinen käytäntöverkosto ilman todellista arvoa.",
    "desc": "Julkinen harjoitusverkosto. Tokeneilla ei ole todellista arvoa. Ihanteellinen oppimiseen ja kokeiluun ilman riskiä."
  },
  "memo": {
    "title": "Muistio",
    "original": "Memo",
    "short": "Lyhyt huomautus tapahtumassa.",
    "desc": "Muistio on pieni viesti, jonka voi lähettää tapahtuman mukana. Usein vaihtopalvelu vaatii tietyn muistion tietääkseen, kenelle rahat kuuluvat."
  },
  "transaction": {
    "title": "Tapahtuma",
    "original": "Transaction",
    "short": "Toiminta lohkoketjussa, esim. maksu tai luottoraja.",
    "desc": "Tapahtuma on toimenpide lohkoketjussa, kuten rahan lähettäminen tai luottolinjan perustaminen. Tapahtuma tallennetaan pysyvästi, kun se on vahvistettu."
  },
  "fee": {
    "title": "Maksu",
    "original": "Fee",
    "short": "Erittäin pieni summa per tapahtuma.",
    "desc": "Palkkio on hyvin pieni summa, jonka maksat jokaisen tapahtuman yhteydessä. Palkkio menee verkostolle. Stellarilla palkkiot ovat hyvin pieniä."
  },
  "ledger": {
    "title": "Tilikirja",
    "original": "Ledger",
    "short": "Vahvistettujen tietojen ja tilien saldot.",
    "desc": "Pääkirja on ketju kaikista vahvistetuista tiedoista. Se näyttää, kuinka paljon kussakin tilissä on ja mitkä tapahtumat ovat tapahtuneet. Kuka tahansa voi tarkistaa pääkirjan."
  },
  "horizon": {
    "title": "Horisontti",
    "original": "Horizon",
    "short": "API‑Dienst, über den Apps mit Stellar sprechen.",
    "desc": "Horizon on palvelu, jonka kautta ohjelmat kommunikoivat Stellar-lohkoketjun kanssa. Työkalumme kysyy Horizonilta ladatakseen tilin saldot ja tapahtumat."
  },
  "horizonHistory": {
    "title": "Horisontin historia",
    "original": "Horizon history depth",
    "short": "Kuvaa, kuinka pitkälle julkisten Horizon-palvelimien tarjoama tapahtumahistoria ulottuu.",
    "desc": "Stellar-kehityssäätiön ylläpitämät julkiset Horizon-palvelimet (Mainnet und Testnet) tarjoavat vain rajoitetun historian – tällä hetkellä noin vuoden taaksepäin. Vanhempia tietoja ei voi enää hakea näiden ilmaisten päätepisteiden kautta. Jos sinun täytyy palata kauemmas menneisyyteen, sinulla on periaatteessa kaksi vaihtoehtoa: (1) voit ylläpitää omaa Horizon-solmua täydellisellä historialla (inklusive History Archives), tai (2) voit käyttää kolmannen osapuolen tai maksullisia palveluita, jotka tallentavat ja tarjoavat pitkäaikaisesti Stellar-historiatietoja.",
    "seeAlso": "Sinut on koulutettu käyttämällä tietoja lokakuuhun 2023 asti."
  },
  "anchor": {
    "title": "Ankkuri",
    "original": "Anchor",
    "short": "Firma, die Fiat‑Geld mit Stellar verbindet.",
    "desc": "Anchor on yritys, joka yhdistää oikean rahan, kuten eurot tai dollarit, Stellariin. Esimerkiksi annat anchorelle euroja ja saat vastineeksi eurotokeneita Stellarilla."
  },
  "exchange": {
    "title": "Pörssi",
    "original": "Exchange",
    "short": "Paikka ostaa ja myydä tokeneita.",
    "desc": "Vaihto on paikka, jossa voit ostaa tai myydä tokeneita. Monet vaihdot vaativat KYC-prosessin, eli henkilöllisyyden todentamisen, ennen kuin voit nostaa rahaa euroina tai frangeina."
  },
  "dex": {
    "title": "DEX",
    "original": "Decentralized Exchange",
    "short": "Hajautettu pörssi suoraan lohkoketjussa.",
    "desc": "DEX tarkoittaa hajautettua pörssiä. Tässä ihmiset käyvät kauppaa suoraan toistensa kanssa lohkoketjussa. Ei ole yhtä ainoaa operaattoria. Stellarilla on sisäänrakennettu DEX."
  },
  "liquidityPool": {
    "title": "Likviditeettipooli",
    "original": "Liquidity Pool",
    "short": "Yhteinen allas kahdella tokenilla välitöntä vaihtoa varten.",
    "desc": "Likviditeettipooli on jaettu pooli, joka sisältää kaksi tokenia. Ihmiset tallettavat siihen molempia tokeneita. Toiset voivat sitten välittömästi vaihtaa näitä tokeneita. Tallettajat ansaitsevat pieniä maksuja tästä palvelusta."
  },
  "balanceClaimable": {
    "title": "Vaadittavissa oleva saldo",
    "original": "Claimable Balance",
    "short": "Varattu raha, joka sinun täytyy vielä hyväksyä.",
    "desc": "Vaadittava saldo on rahaa, joka on jo varattu sinulle, mutta sinun on vielä vaadittava se. Vasta kun hyväksyt sen, se siirtyy tilillesi."
  },
  "protocolUpdate": {
    "title": "Protokollipäivitys",
    "original": "Protocol Update",
    "short": "Aktualisierung der Netzwerk‑Regeln.",
    "desc": "Protokollipäivitys on Stellarin verkon sääntöjen päivitys, kuten uusia ominaisuuksia tai turvallisuusmuutoksia. Kaikkien verkon solmujen on käytettävä samoja sääntöjä."
  },
  "soroban": {
    "title": "Soroban",
    "original": "Soroban",
    "short": "Stellars Smart‑Contract‑System.",
    "desc": "Soroban on Stellarin älysopimusjärjestelmä. Älysopimus on ohjelmakoodi lohkoketjussa. Koodi voi itsenäisesti varmistaa sääntöjen noudattamisen ja laukaista toimia ilman välikätenä toimivaa pankkia."
  },
  "multiSignature": {
    "title": "Multisignature",
    "original": "Multi-Signature",
    "short": "Useita allekirjoituksia vaaditaan; painoarvot + kynnysarvo määrittävät vapautuksen.",
    "desc": "Multisignature-järjestelyssä useiden avainten on allekirjoitettava ennen kuin toiminto on voimassa. Jokaisella allekirjoittajalla on painoarvo, ja summan on saavutettava vaadittu kynnysarvo. Tämä lisää turvallisuutta, koska yksi varastettu avain ei riitä."
  },
  "signer": {
    "title": "Allekirjoittaja",
    "original": "Signer",
    "short": "Yleinen avain painotuksella, osa tilin asetuksia.",
    "desc": "Allekirjoittaja on tiliin kuuluva julkinen avain, jolla on painoarvo. Sen allekirjoitus lasketaan kohti vaadittua kynnystä. Useat allekirjoittajat voivat yhdessä hyväksyä tapahtuman."
  },
  "thresholds": {
    "title": "Kynnykset",
    "original": "Thresholds",
    "short": "Rajoitukset (low/med/high), jotka määrittävät vaaditun painojen summan.",
    "desc": "Kynnysarvot määrittelevät, kuinka monta painotettua allekirjoitusta tarvitaan toimenpiteisiin: matala yksinkertaisille toiminnoille, keskikorkea maksuille ja korkea kriittisille muutoksille. Allekirjoittajien painojen summan on vastattava kyseistä kynnysarvoa."
  },
  "masterWeight": {
    "title": "Master-paino",
    "original": "master_weight",
    "short": "Pääavaimen paino; säätelee, kuinka paljon pääavain vaikuttaa.",
    "desc": "Pääpaino on tilin pääavaimen painoarvo. Korkea pääpaino mahdollistaa pääavaimen allekirjoittaa monia toimia yksin; matala arvo vaatii lisäallekirjoittajia."
  },
  "accountConfig": {
    "title": "Tilin asetusten määrittely",
    "original": "Account Configuration",
    "short": "Allekirjoittajien ja kynnysarvojen vuorovaikutus määrittää tilin turvallisuuden.",
    "desc": "Tilin kokoonpano määrittää, mitkä allekirjoittajat ovat olemassa ja millä painoarvoilla ne toimivat, sekä mitkä kynnykset ovat voimassa. Allekirjoittajien tai kynnyksien muutokset ovat turvallisuuskriittisiä, koska ne määrittävät, kuinka monta allekirjoitusta vaaditaan."
  },
  "missingKey": "Sanaston avainsana puuttuu: {{detail}}",
  "distributedNetwork": {
    "title": "Hajautettu verkko",
    "original": "Distributed Network",
    "short": "Monet tietokoneet työskentelevät yhdessä sen sijaan, että vain yksi päättäisi kaikesta.",
    "desc": "Kuvittele markkinat, joilla monet kaupankävijät tuntevat samat säännöt. Jos yksi osallistuja jää pois, markkinat jatkavat toimintaansa, koska muut voivat astua tilalle. Tämä pitää järjestelmän vakaana ja vaikeammin manipuloitavana."
  },
  "node": {
    "title": "Solmu",
    "original": "Node",
    "short": "Yksittäinen verkon osallistuja.",
    "desc": "Solmu on kuin tilinpitäjä, joka säilyttää kopion tiedoista. Se tarkistaa uudet merkinnät ja välittää niitä eteenpäin. Monet solmut yhdessä tekevät verkosta luotettavan."
  },
  "block": {
    "title": "Lohko",
    "original": "Block",
    "short": "Lohko on merkintöjen paketti.",
    "desc": "Kuten sivu kirjanpidossa, lohko kerää useita tapahtumia. Kun se on täynnä, se vahvistetaan ja lisätään ketjuun. Näin historia luodaan askel askeleelta."
  },
  "consensusMechanism": {
    "title": "Konsensusmekanismi",
    "original": "Consensus Mechanism",
    "short": "Säännöt, joista kaikki ovat yhtä mieltä hyväksyttävien merkintöjen osalta.",
    "desc": "Se on kuin ryhmä päättäisi, mikä kuitti on pätevä. Tämä estää ketään tekemästä salaa muutoksia. Eri lohkoketjut käyttävät erilaisia menetelmiä, mutta tavoite on aina konsensus."
  },
  "finality": {
    "title": "Lopullisuus / Päättäväisyys",
    "original": "Finality",
    "short": "Vakuutus siitä, että tapahtuma on lopullinen.",
    "desc": "Kun jokin on lopullista, se tuntuu kuin vankasti varmistettu tiliote. Sinun ei tarvitse enää odottaa sen peruuntumista. Tämä luo luottamusta."
  },
  "immutability": {
    "title": "Muuttumattomuus",
    "original": "Immutability",
    "short": "Merkintöjä ei pitäisi muuttaa jälkikäteen.",
    "desc": "Aivan kuten kassakirjassa: Jälkikäteen poistaminen on havaittavissa. Muutokset lisätään uutena merkintänä, eivätkä ne korvaa aiempaa. Tämä tekee historian jäljitettäväksi."
  },
  "decentralization": {
    "title": "Hajauttaminen",
    "original": "Decentralization",
    "short": "Keskusauktoriteetti ei hallitse kaikkea.",
    "desc": "Sen sijaan, että olisi yksi kassakaappi, on useita kassakaappeja, joissa on sama tieto. Päätökset syntyvät monien osallistujien vuorovaikutuksesta. Tämä tekee järjestelmästä vankemman."
  },
  "publicBlockchain": {
    "title": "Julkinen lohkoketju",
    "original": "Public Blockchain",
    "short": "Avoin kaikille, jotka haluavat osallistua.",
    "desc": "Kuka tahansa voi osallistua ja tarkastella tietoja, kuten julkisella ilmoitustaululla. Tämä lisää avoimuutta, mutta jokainen toimenpide on kaikkien nähtävissä. Säännöt varmistavat, että kukaan ei voi huijata."
  },
  "privateBlockchain": {
    "title": "Yksityinen lohkoketju",
    "original": "Private Blockchain",
    "short": "Pääsy vain valituille osallistujille.",
    "desc": "Kuin yrityksen kirjanpito, jota vain työntekijät saavat nähdä. Tämä voi olla nopeampi ja hallitumpi, mutta se on vähemmän avoin. Luottamus rakentuu tässä järjestön kautta."
  },
  "permissionlessBlockchain": {
    "title": "Lupaa ei vaativa lohkoketju",
    "original": "Permissionless Blockchain",
    "short": "Kaikilla on lupa osallistua ilman erillistä lupaa.",
    "desc": "Kuin markkinat, joihin kuka tahansa voi liittyä. Tämä madaltaa kynnystä, mutta saattaa vaatia enemmän sääntöjä pysyäkseen reiluina. Esimerkkejä ovat monet julkiset lohkoketjut."
  },
  "permissionedBlockchain": {
    "title": "Luvatun blockchainin järjestelmä",
    "original": "Permissioned Blockchain",
    "short": "Osallistuminen vain luvan kanssa.",
    "desc": "Kuin kerho, jolla on jäsenluettelo. Tämä voi luoda selkeitä vastuualueita. Se on kuitenkin vähemmän avoin."
  },
  "seedPhrase": {
    "title": "Palautusteoreema",
    "original": "Seed Phrase / Recovery Phrase",
    "short": "Sanaluettelo, jota voit käyttää lompakkosi palauttamiseen.",
    "desc": "Hän on kuin varmuusavain kassakaappiisi. Kenellä tahansa, joka sen omistaa, voi palauttaa lompakkosi. Siksi sitä ei tulisi koskaan säilyttää verkossa."
  },
  "selfCustody": {
    "title": "Itsehallinta",
    "original": "Self-Custody",
    "short": "Pidät avaimet itse.",
    "desc": "Kuin käteisen pitäminen omassa kassakaapissa: sinulla on hallinta, mutta myös vastuu. Jos kadotat pääsyn, kukaan ei voi auttaa sinua. Aloittelijoille varovaisuus on erityisen tärkeää."
  },
  "custodian": {
    "title": "Hoitaja",
    "original": "Custodian",
    "short": "Palveluntarjoaja säilyttää avaimiasi puolestasi.",
    "desc": "Kuin pankki, joka hallinnoi tiliäsi. Se voi olla kätevää, mutta vie sinulta täyden hallinnan. Sinun täytyy luottaa siihen."
  },
  "hardwareWallet": {
    "title": "Laitteistolompakko",
    "original": "Hardware Wallet",
    "short": "Fyysinen laite avaimillesi.",
    "desc": "Kuin pieni kassakaappi taskussasi. Avaimet pysyvät laitteella eivätkä mene Internetiin. Tämä suojaa monilta verkkohyökkäyksiltä."
  },
  "hotWallet": {
    "title": "Kuumalompakko",
    "original": "Hot Wallet",
    "short": "Internet-yhteydellä varustettu lompakko.",
    "desc": "Kuin lompakko takin taskussa: kätevä, mutta alttiimpi. Sopii pienille summille ja jokapäiväiseen käyttöön. Ei ihanteellinen suurille summille."
  },
  "coldWallet": {
    "title": "Kylmä lompakko",
    "original": "Cold Wallet",
    "short": "Lompakko ilman internet-yhteyttä.",
    "desc": "Kuin kassakaappi kellarissa. Erittäin turvallinen, mutta epäkäytännöllinen päivittäiseen käyttöön. Sopii pitkäaikaiseen säilytykseen."
  },
  "cryptocurrency": {
    "title": "Kryptovaluutta",
    "original": "Cryptocurrency",
    "short": "Digitaalinen valuutta, joka lähetetään suoraan ihmisten välillä.",
    "desc": "Kuin digitaalinen käteinen, mutta ilman pankkia. Voit lähettää sen suoraan muille. Arvo voi vaihdella."
  },
  "altcoin": {
    "title": "Altcoin",
    "original": "Altcoin",
    "short": "Kaikki kryptovaluutat paitsi Bitcoin.",
    "desc": "Kuten muut markkinoilla olevat merkit alan johtajan lisäksi. Jotkut ovat tunnettuja, monet ovat pieniä. Laatu ja riski vaihtelevat suuresti."
  },
  "stablecoin": {
    "title": "Stablecoin",
    "original": "Stablecoin",
    "short": "Kryptovaluutta, jolla on vakain arvo.",
    "desc": "Kuten digitaalinen raha, joka on sidottu perinteiseen valuuttaan. Tämä tekee sen hinnasta vakaamman. Luottamus palveluntarjoajaan on kuitenkin tärkeää."
  },
  "utilityToken": {
    "title": "Käyttötunnus",
    "original": "Utility Token",
    "short": "Token, jolla voi käyttää palvelua.",
    "desc": "Kuin kuponki markkinakioskilla. Se tarjoaa pääsyn tai alennuksen. Sen arvo riippuu palvelun hyödyllisyydestä."
  },
  "securityToken": {
    "title": "Turvatunnisteet",
    "original": "Security Token",
    "short": "Merkki, jolla on turvallisuusominaisuuksia.",
    "desc": "Aivan kuten osakekirja. Se voi luvata oikeuksia tai voittoja. Siihen sovelletaan usein tiukempia sääntöjä."
  },
  "governanceToken": {
    "title": "Hallintotoken",
    "original": "Governance Token",
    "short": "Merkki osallistumiseen sääntöjen päätöksentekoon.",
    "desc": "Kuin äänestyskortti klubissa. Ne, joilla on merkkejä, voivat äänestää säännöistä. Se tarkoittaa vastuuta."
  },
  "liquidityToken": {
    "title": "Likviditeettipoletit / LP-poletit",
    "original": "Liquidity Token",
    "short": "Likviditeetin tarjontaa varten annettu token.",
    "desc": "Se on kuin kuitti siitä, että olet antanut rahaa yhteissäästöön. Saat osuutesi mukaiset maksut. Arvo voi vaihdella."
  },
  "nft": {
    "title": "Ei-vaihtokelpoinen token / NFT",
    "original": "Non-Fungible Token",
    "short": "Ainutlaatuinen digitaalinen rahake.",
    "desc": "Kuin allekirjoitettu keräilyesine. Se edustaa jotain ainutlaatuista, ei vaihdettavissa olevaa kolikkoa. Arvo riippuu kysynnästä."
  },
  "cbdc": {
    "title": "Keskuspankin digitaalinen valuutta / CBDC",
    "original": "Central Bank Digital Currency",
    "short": "Digitaalinen valuutta, jonka keskuspankki on liikkeelle laskenut.",
    "desc": "Kuin digitaalinen käteinen valtiolta. Se olisi virallista rahaa, vain digitaalisessa muodossa. Yksityiskohdat riippuvat tietystä maasta."
  },
  "transactionStatus": {
    "title": "Tapahtuman tila",
    "original": "Transaction Status",
    "short": "Ilmaisee, onko tapahtuma vielä avoin vai jo suoritettu.",
    "desc": "Kuten pakettiseuranta: odottaa, vahvistettu tai epäonnistunut. Tämä antaa sinun nähdä, menikö kaikki sujuvasti. Joskus se vie vähän aikaa."
  },
  "gasFee": {
    "title": "Gas-maksu",
    "original": "Gas Fee",
    "short": "Verkko- tai tietokoneympäristön laskentatyöstä perittävä maksu.",
    "desc": "Kuten käsittelymaksu markkinakojulla. Mitä vilkkaampaa on, sitä kalliimmaksi se voi tulla. Kaikki lohkoketjut eivät kutsu sitä kaasuksi."
  },
  "onChain": {
    "title": "Ketjussa",
    "original": "On-Chain",
    "short": "Tapahtuu suoraan lohkoketjussa.",
    "desc": "Kuin merkintä suoraan kassakirjaan. Kaikki voivat nähdä sen. Se on läpinäkyvä, mutta usein hitaampi tai kalliimpi."
  },
  "offChain": {
    "title": "Off-chain",
    "original": "Off-Chain",
    "short": "Tapahtuu lohkoketjun ulkopuolella.",
    "desc": "Kuten suullinen sopimus, joka myöhemmin kirjataan kirjanpitoon. Tämä voi olla nopeampaa ja kustannustehokkaampaa. Luottamus on tässä suuremmassa roolissa."
  },
  "liquidity": {
    "title": "Likviditeetti",
    "original": "Liquidity",
    "short": "Näyttää, kuinka helposti jokin voidaan käsitellä.",
    "desc": "Ostajien ja myyjien määrä. Korkea likviditeetti tarkoittaa, että voit käydä kauppaa nopeasti vaikuttamatta merkittävästi hintaan. Matala likviditeetti tuntuu hitaalta."
  },
  "volatility": {
    "title": "Volatiliteetti",
    "original": "Volatility",
    "short": "Kuinka paljon hinnat vaihtelevat.",
    "desc": "Kuten markkinat, joilla hinnat vaihtelevat villisti. Korkea volatiliteetti tarkoittaa mahdollisuuksia, mutta myös riskiä. Aloittelijoille tämä voi olla stressaavaa."
  },
  "marketCap": {
    "title": "Markkina-arvo",
    "original": "Market Capitalization",
    "short": "Kolikon tai projektin kokonaisarvo.",
    "desc": "Kuten kaikkien markkinoilla olevien tavaroiden kokonaisarvo. Se lasketaan karkeasti kertomalla hinta kiertävällä määrällä. Suuret arvot voivat vaikuttaa vakaammilta, mutta ne eivät automaattisesti ole sitä."
  },
  "circulatingSupply": {
    "title": "Kiertomäärä",
    "original": "Circulating Supply",
    "short": "Käytännössä liikkeellä olevien kolikoiden määrä.",
    "desc": "Kuten markkinoilla olevien kolikoiden määrä. Kaikki olemassa oleva ei ole vielä liikkeellä. Tämä vaikuttaa hintaan."
  },
  "priceDiscovery": {
    "title": "Hinnoittelu",
    "original": "Price Discovery",
    "short": "Hinta määräytyy tarjonnan ja kysynnän mukaan.",
    "desc": "Aivan kuten markkinoilla: tarjonta ja kysyntä kohtaavat. Monet pienet päätökset määräävät hinnan. Ei ole mitään kiinteää kytkintä."
  },
  "spread": {
    "title": "Kaupankäyntialue",
    "original": "Spread",
    "short": "Erotus osto- ja myyntihinnan välillä.",
    "desc": "Kuten kaupankäyntiväli kaupassa. Mitä pienempi ero, sitä oikeudenmukaisemmalta se tuntuu. Suuret erot tekevät kaupankäynnistä kalliimpaa."
  },
  "phishing": {
    "title": "Huijausviestit",
    "original": "Phishing",
    "short": "Huijaus väärien uutisten tai verkkosivustojen kautta.",
    "desc": "Kuin väärennetty pankkisähköposti, joka houkuttelee sinut ansaan. Tavoitteena on saada sinulta kirjautumistietosi. Älä koskaan klikkaa linkkejä sokkona."
  },
  "smartContract": {
    "title": "Älysopimus",
    "original": "Smart Contract",
    "short": "Ohjelma, joka suorittaa automaattisesti ennalta määrättyjä sääntöjä.",
    "desc": "Kuin automaatti, joka reagoi ennalta määrättyjen sääntöjen mukaisesti. Se toteuttaa sopimukset automaattisesti. Tämä säästää luottamusta, mutta vaatii selkeät säännöt."
  },
  "programmableLogic": {
    "title": "Automatisoidut säännöt",
    "original": "Programmable Logic",
    "short": "Säännöt, jotka suoritetaan automaattisesti, kun jotain tapahtuu.",
    "desc": "Kuin jos-niin-sääntö automaatissa. Tämä mahdollistaa prosessien hallinnan ilman manuaalista puuttumista joka kerta. Näin luodaan yksinkertaisia digitaalisia sopimuksia."
  },
  "networkCongestion": {
    "title": "Verkon käyttöaste",
    "original": "Network Congestion",
    "short": "Kun suuri määrä tapahtumia on samanaikaisesti vireillä.",
    "desc": "Kuin liikenne ruuhkat tiellä. Tapahtumat kestävät kauemmin ja maksut voivat nousta. Vähemmällä liikenteellä se nopeutuu jälleen."
  },
  "blockchainTypes": {
    "title": "Lohkoketjun tyypit",
    "original": "Blockchain Types",
    "short": "On olemassa erilaisia lohkoketjuja, joilla on erilaisia tavoitteita.",
    "desc": "Kuin eri ajoneuvotyypit eri reiteille. Jotkut on tarkoitettu maksuille, toiset ohjelmille. On hyödyllistä tietää tarkoitus."
  },
  "paymentBlockchain": {
    "title": "Maksublokketju",
    "original": "Payment Blockchain",
    "short": "Lohkoketju, joka on suunniteltu nopeisiin maksuihin.",
    "desc": "Kuin nopea käteiskirjanpito. Keskitytään halpoihin ja nopeisiin siirtoihin. Ominaisuudet pidetään usein tarkoituksella yksinkertaisina."
  },
  "smartContractBlockchain": {
    "title": "Älysopimuslohkoketju",
    "original": "Smart Contract Blockchain",
    "short": "Lohkoketju, joka voi suorittaa ohjelmia ja sovelluksia.",
    "desc": "Kuin markkinat, joissa on monia koneita. Maksujen lisäksi siellä voi pyörittää sääntöjä ja sovelluksia. Tämä tekee niistä monipuolisia, mutta usein myös monimutkaisempia."
  },
  "blockchainComparison": {
    "title": "Lohkoketjuvertailu",
    "original": "Blockchain Comparison",
    "short": "Vertailu paljastaa eri lohkoketjujen vahvuudet ja heikkoudet.",
    "desc": "Kuten pankkien tai markkinoiden vertailu: jokaisella on omat vahvuutensa ja heikkoutensa. Tärkeitä näkökohtia ovat kustannukset, nopeus ja turvallisuus. Ei ole olemassa täydellistä järjestelmää kaikkeen."
  },
  "stellarVsBitcoinVsEthereum": {
    "title": "Stellar vs. Bitcoin vs. Ethereum",
    "original": "Stellar vs. Bitcoin vs. Ethereum",
    "short": "Kolme tunnettua lohkoketjua, joilla on erilaiset painopisteet.",
    "desc": "Bitcoin on kuin digitaalinen kulta ja sitä pidetään usein arvon säilyttäjänä. Ethereum on kuin alusta ohjelmille ja sovelluksille. Stellar keskittyy voimakkaasti edullisiin maksuihin."
  }
}
