{
  "title": "Yleinen selitys moniallekirjoitustilistä (Multi-Signature) yritystiliin liittyen.",
  "intro": "Yritys voi käyttää yhteistä lohkoketjutiliä, johon kuuluu useita valtuutettuja henkilöitä. Tyypillisesti mukana on vähintään kolme allekirjoittajaa (Signer), kuten johto, talousjohtaja ja compliance-/varahenkilö. Tavoitteena on, että yksittäiset henkilöt voivat itsenäisesti suorittaa maksuja ilman, että yhdelläkään henkilöllä on yksinään tilin hallintaa tai haltuunottoa.",
  "problem": "Jos allekirjoittajalla (Signer) on riittävästi painoarvoa maksujen suorittamiseen ja samanaikaisesti riittävästi painoarvoa tilin muutosten tekemiseen, voi kyseinen henkilö poistaa muita allekirjoittajia (Signer) tai säätää kynnysarvoa/painotusta (Thresholds) ja siten ottaa tilin hallintaansa. Toisaalta alkuperäisen omistajan ei myöskään pitäisi voida sulkea muita allekirjoittajia (Signer) pois ilman tarkastuksia ja tasapainotuksia. Multi-sig-rakenne varmistaa, että tärkeät päätökset saavat aina useiden henkilöiden yhteisen tuen.",
  "setupTitle": "Esimerkki turvallisesta multi-sig-rakenteesta, jossa on kolme allekirjoittajaa.",
  "setupWeights": "Esimerkissä, jossa on kolme vastaavaa roolia, kaikki saavat saman allekirjoitusvoimakkuuden:\n- Allekirjoittaja (Signer) A (management): paino 2\n- Allekirjoittaja (Signer) B (Finanzen): paino 2\n- Allekirjoittaja (Signer) C (Compliance/Backup): paino 2",
  "setupThresholds": "Sopivat kynnysarvot/painotukset on asetettu:\n- Low (low_threshold): 1\n- Medium (med_threshold): 2 (for payments and other medium actions)\n- High (high_threshold): 4 (rakenteellisten muutosten, kuten allekirjoittajien lisääminen/poistaminen (Signer) tai kynnysarvon/painotuksen muuttaminen (Thresholds))\nTämä asetus mahdollistaa jokaiselle valtuutetulle henkilölle maksujen suorittamisen, mutta yksikään henkilö ei voi yksin muuttaa tilin rakennetta.",
  "behavior": "Tämän konfiguraation avulla maksut voidaan suorittaa minkä tahansa kolmen valtuutetun henkilön toimesta yksin, koska kunkin henkilön painoarvo täyttää keskitason kynnyksen/painoarvon (Threshold). Kuitenkin rakenteellisiin muutoksiin, kuten allekirjoittajan poistamiseen (Signers), kynnysten/painoarvojen säätämiseen tai tilin yhdistämiseen tai sulkemiseen, vaaditaan korkea kynnys/painoarvo (high_threshold). Tämä arvo voidaan saavuttaa vain, jos vähintään kaksi kolmesta allekirjoittajasta (Signer) allekirjoittaa yhdessä. Tällä tavalla tili pysyy joustavana päivittäisessä käytössä ja on hyvin suojattu väärinkäytöksiä vastaan.",
  "removal": "Jos henkilö poistuu yrityksestä tai ei ole enää luotettava, kaksi jäljellä olevaa allekirjoittajaa (Signer) voivat yhdessä poistaa tämän henkilön allekirjoitusoikeudet. Yksittäinen allekirjoittaja (Signer) – ei työntekijä eikä johto – voi itsenäisesti sulkea muita pois tililtä. Oikeuksien poistaminen tapahtuu siis aina hallitusti ja jäljitettävästi vähintään kahden vastuuhenkilön toimesta.",
  "summary": "Tällainen multisignatuuri-rakenne mahdollistaa yksittäisten henkilöiden suorittaa maksuja tehokkaasti samalla kun tilin hallinta säilyy useiden osapuolten käsissä. Se vähentää tilin kaappausten riskiä, suojaa yksipuolisilta päätöksiltä ja on erityisen sopiva yritystileille, joissa sekä turvallisuus että operatiivinen joustavuus ovat tärkeitä.",
  "closeLabel": "Sulje",
  "linkLabel": "Mitä tarkoittaa Multi-Signature?"
}