{
  "title": "Moniallekirjoituksellinen (Multi-Signature) yritystili -yleisselitys",
  "intro": "Yritys voi käyttää jaettua blockchain-tiliä, johon osallistuu useita valtuutettuja henkilöitä. Tyypillisesti mukana on vähintään kolme allekirjoittajaa (Signer), esimerkiksi yritysjohto, talousjohtaja ja tarkastus/varahenkilö. Tavoitteena on, että yksittäiset henkilöt voivat suorittaa maksuja itsenäisesti, ilman että yksikään henkilö voisi hallita tai ottaa tiliä haltuunsa yksin.",
  "problem": "Jos allekirjoittajalla (Signer) on riittävästi painoarvoa maksujen suorittamiseen ja samalla tarpeeksi painoarvoa tilin muutoksiin, tämä henkilö voisi poistaa muita allekirjoittajia (Signer) tai säätää kynnysarvoa/painotusta (Thresholds) ja näin ottaa tilin haltuunsa. Toisaalta alkuperäisen omistajan ei pitäisi voida helposti sulkea muita allekirjoittajia (Signer) pois ilman tarkistus- ja tasapainojärjestelmiä. Moniallekirjoitusrakenne varmistaa, että tärkeitä päätöksiä tehdään aina useiden ihmisten toimesta yhdessä.",
  "setupTitle": "Esimerkki turvallisesta moniallekirjoitusrakenteesta, jossa on kolme allekirjoittajaa.",
  "setupWeights": "Esimerkissä, jossa on kolme yhtä tärkeää roolia, kaikki saavat saman allekirjoituksen vahvuuden:\n- Allekirjoittaja (Signer) A (Management): Paino 2\n- Allekirjoittaja (Signer) B (Finanzen): Paino 2\n- Allekirjoittaja (Signer) C (Compliance/Backup): Paino 2",
  "setupThresholds": "Sopivat kynnys-/painoarvot asetetaan seuraavasti:\n- Matala (low_threshold): 1\n- Keskitaso (med_threshold): 2 (for payments and other medium actions)\n- Korkea (high_threshold): 4 (rakenteellisiin muutoksiin, kuten allekirjoittajien lisääminen/poistaminen (Signer) tai kynnysarvon/painoarvon muuttaminen (Thresholds))\nTämä mahdollistaa jokaisen valtuutetun henkilön suorittaa maksuja, mutta kukaan ei yksin voi muuttaa tilin rakennetta.",
  "behavior": "Tällä kokoonpanolla maksut voidaan suorittaa minkä tahansa kolmen valtuutetun henkilön toimesta yksin, sillä yksittäisen henkilön painoarvo täyttää aina keskitason kynnyksen/kynnysarvon. Rakenteellisiin muutoksiin, kuten allekirjoittajan poistamiseen, kynnysarvojen/painoarvojen säätämiseen tai tilin yhdistämiseen tai sulkemiseen, vaaditaan korkea kynnysarvo/korkea_kynnysarvo. Tämän arvon voi saavuttaa vain, jos vähintään kaksi kolmesta allekirjoittajasta allekirjoittavat yhdessä. Näin tili säilyy joustavana päivittäisessä käytössä ja on samalla hyvin suojattu väärinkäytöksiltä.",
  "removal": "Wenn eine Person das Unternehmen verlässt oder nicht mehr vertrauenswürdig ist, können zwei der verbleibenden Unterzeichner (Signer) gemeinsam die Signaturrechte dieser Person entfernen. Kein einzelner Unterzeichner (Signer) – weder ein Mitarbeiter noch die Geschäftsführung – kann andere eigenständig aus dem Konto ausschließen. Der Entzug von Berechtigungen erfolgt also immer kontrolliert und nachvollziehbar durch mindestens zwei Verantwortliche.",
  "summary": "Tämän tyyppinen moniallekirjoitusrakenne mahdollistaa yksityishenkilöille maksujen tehokkaan käsittelyn, samalla kun tilin hallinta pysyy useammilla osapuolilla. Se vähentää tilien kaappaamisen riskiä, suojaa yksipuolisilta päätöksiltä ja soveltuu erityisesti yritystileihin, joissa sekä turvallisuus että toiminnallinen joustavuus ovat tärkeitä.",
  "closeLabel": "Sulje",
  "linkLabel": "Mitä tarkoittaa multi-sig?"
}