{
  "title": "Moniallekirjoitustili yrityksen tilille (Multiple Signature Corporate Account) yleinen selitys",
  "intro": "Yritys voi käyttää jaettua lohkoketjutiliä, johon liittyy useita valtuutettuja henkilöitä. Tyypillisesti mukana on vähintään kolme allekirjoittajaa (Signer), kuten johto, talousjohtaja ja sääntöjenmukaisuuden varmistaja/varahenkilö. Tavoitteena on, että yksilöt voivat suorittaa maksuja itsenäisesti ilman, että kukaan yksittäinen henkilö voi yksin hallita tai ottaa tiliä haltuunsa.",
  "problem": "Jos allekirjoittajalla (Signer) on riittävästi painoarvoa maksujen suorittamiseen ja samalla riittävästi painoarvoa tilimuutoksiin, tämä henkilö voisi poistaa muita allekirjoittajia (Signer) tai säätää kynnystä/painotusta (Thresholds), ja näin ottaa tilin haltuunsa. Toisaalta alkuperäisen omistajan ei pitäisi pystyä yksinkertaisesti sulkemaan muita allekirjoittajia (Signer) pois ilman tarkastuksia ja tasapainotuksia. Usean allekirjoittajan rakenne varmistaa, että tärkeät päätökset saavat aina monen henkilön yhteisen tuen.",
  "setupTitle": "Esimerkki turvallisesta moniallekirjoitusrakenteesta, jossa on kolme allekirjoittajaa",
  "setupWeights": "Esimerkissä, jossa on kolme tasavertaista roolia, kaikki saavat saman allekirjoituksen vahvuuden:\n- Allekirjoittaja (Signer) A (management): painoarvo 2\n- Allekirjoittaja (Signer) B (Finanzen): painoarvo 2\n- Allekirjoittaja (Signer) C (Compliance/Backup): painoarvo 2",
  "setupThresholds": "Sopivat kynnysarvot/painotukset asetetaan seuraavasti:\n- Matala (low_threshold): 1\n- Keskitaso (med_threshold): 2 (for payments and other medium actions)\n- Korkea (high_threshold): 4 (rakenteellisiin muutoksiin, kuten allekirjoittajien lisäämiseen/poistamiseen (Signer) tai kynnysarvon/painotuksen muuttamiseen (Thresholds))\nTämän avulla jokainen valtuutettu henkilö voi suorittaa maksuja, mutta kukaan yksittäinen henkilö ei voi muuttaa tilin rakennetta yksinään.",
  "behavior": "Tämän kokoonpanon avulla maksut voidaan suorittaa erikseen kuka tahansa kolmesta valtuutetusta henkilöstä, sillä yksilöllinen painotus täyttää keskitason kynnyksen/kynnyksen. Kuitenkin rakenteelliset muutokset, kuten allekirjoittajan/allekirjoittajien poistaminen, kynnysten/painotusten säätäminen tai tilin yhdistäminen tai sulkeminen, vaativat korkean kynnyksen/korkean kynnyksen. Tämä arvo voidaan saavuttaa vain, kun vähintään kaksi kolmesta allekirjoittajasta/Allekirjoittaja allekirjoittaa yhdessä. Tämä järjestely pitää tilin joustavana jokapäiväiseen käyttöön, samalla kun se tarjoaa vahvan suojan väärinkäytöksiltä.",
  "removal": "Jos henkilö poistuu yrityksestä tai häntä ei enää pidetä luotettavana, voivat kaksi jäljellä olevaa allekirjoittajaa (Signer) yhdessä poistaa tämän henkilön allekirjoitusoikeudet. Yksittäinen allekirjoittaja (Signer) – olipa kyseessä työntekijä tai johto – ei voi itsenäisesti sulkea muita tililtä. Oikeuksien poistaminen tapahtuu aina hallitusti ja vähintään kahden vastuuhenkilön toimesta, jotta se on jäljitettävissä.",
  "summary": "Tämäntyyppinen moniallekirjoitusrakenne sallii yksittäisten henkilöiden käsitellä maksuja tehokkaasti, samalla kun useampi osapuoli säilyttää tilin hallinnan. Se vähentää tilikaappausten riskiä, suojaa yksipuolisilta päätöksiltä ja on erityisen sopiva yritystileille, joissa sekä turvallisuus että toiminnallinen joustavuus ovat tärkeitä.",
  "closeLabel": "Sulje",
  "linkLabel": "Mitä Multi-Signature tarkoittaa?"
}