{
  "title": "Crea un account + multisig",
  "menu": "Crea account + Multisig",
  "menuHint": "Crea un nuovo account e opzionalmente configura la multisignatura.",
  "hint": "Crea un nuovo account, attivalo e configura opzionalmente la firma multipla.",
  "generateKeys": "Genera chiave",
  "enableMultisig": "Abilita multisig",
  "signersTitle": "Firmatario",
  "signersInfo": "Aggiungi firmatari aggiuntivi e imposta soglie appropriate.",
  "signersCount": "Numero di firmatari",
  "bestPractices": {
    "title": "Migliori Pratiche",
    "text": "Tieni le chiavi segrete al sicuro e non distribuirle inutilmente."
  },
  "instructions": {
    "public": "Condividi questa chiave pubblica con altri per i pagamenti.",
    "secret": "Mantieni questa chiave segreta al sicuro; non condividerla mai."
  },
  "generateFirst": "Genera prima una coppia di chiavi, per favore.",
  "confirmLowBalance": "Il saldo iniziale {bal} XLM è inferiore alla riserva raccomandata {req} XLM (Firmatari: {count}). Procedere?",
  "activated": "L'account è stato attivato. Hash: {hash}",
  "activatedTestnet": "L'account è stato attivato sul testnet tramite Friendbot.",
  "alreadyActive": "L'account è già attivato.",
  "createdNoSigners": "Account creato, multisig non configurato.",
  "createdAndConfigured": "Account creato e multisig configurato. Hash: {hash}",
  "info": {
    "more": "Più informazioni",
    "keysOnPage": {
      "title": "Chiave su questa pagina",
      "text": "⚠️ IMPORTANTE: Questo sito web NON memorizza MAI la tua chiave segreta!\n\nLa chiave segreta visualizzata qui esiste solo nel tuo browser (lokal im Arbeitsspeicher). Una volta ricaricata o lasciata la pagina, è persa irrimediabilmente.\n\nCopia o annota la chiave segreta immediatamente dopo la generazione prima di chiudere la pagina.\n\nVerifica: Puoi usare gli strumenti per sviluppatori del browser (F12 → Rete) per verificare che nessuna chiave segreta venga trasmessa esternamente. Vengono inviate solo transazioni firmate, mai la tua chiave segreta."
    },
    "title": "Informazioni importanti",
    "secureKeys": {
      "title": "Chiave segreta sicura",
      "text": "La chiave pubblica può essere condivisa in sicurezza – è come un numero di conto.\n\nLa chiave segreta consente l'accesso al tuo conto. Trattala come una password:\n• NON conservarla mai in servizi cloud, e-mail o note non sicure\n• Trascrivila su carta o utilizza un portafoglio hardware\n• Crea più copie di backup e conservale in posizioni sicure e separate\n• Se la chiave segreta viene persa, l'accesso al conto è perso per sempre"
    },
    "multisigSection": {
      "title": "Multisig (Mehrfachsignatur)",
      "text": "Con il multisig, puoi definire più firmatari per il tuo account. Le transazioni richiedono quindi firme da più chiavi (multisig).\n\nVantaggi:\n• Maggiore sicurezza (security)\n• Conti condivisi (shared accounts)\n• Recupero di emergenza (emergency recovery)\n\nATTENZIONE: Testa il multisig prima sulla testnet prima di implementarlo sulla mainnet! Una configurazione errata può comportare la perdita dell'accesso all'account."
    },
    "diagram": {
      "title": "Scadenza della firma"
    }
  },
  "activateHint": "L'attivazione è necessaria affinché l'account esista. Nel Testnet, tramite Friendbot; nel Mainnet, tramite \"Crea Account\" da un wallet esistente.",
  "activateNow": "Attiva immediatamente l'account",
  "activateOnly": "Basta attivare",
  "balanceWarning": "Il saldo iniziale è probabilmente troppo basso per aggiungere i {{count}} firmatari aggiuntivi (riserva minima: {{req}} XLM).",
  "createButton": "Crea / Imposta Multisig",
  "mainnetActivateNote": "Nota: Sono necessarie riserve aggiuntive per Multisig. 1 XLM spesso non è sufficiente.",
  "reserve": {
    "base": "Riserva base per voce: {{val}} XLM",
    "recommended": "Saldo iniziale consigliato: {{val}} XLM (inkl. Puffer)",
    "required": "Riserva Minima Obbligatoria (neu): {{val}} XLM"
  },
  "signersCountHint": "Imposti il numero minimo di firme di seguito sotto \"Required Signatures\" (niedrig/mittel/hoch).",
  "signersCountLimit": "Nota: Limite di Rete (Stellar): max. 20 firmatari aggiuntivi.",
  "startingBalance": "Saldo iniziale (XLM)",
  "keyWarning": {
    "title": "⚠️ Acquisisci la chiave sicura ora!",
    "text1": "Hai generato una nuova coppia di chiavi.",
    "text2": "Assicurati di avere ENTRAMBI le chiavi IMMEDIATAMENTE prima di procedere:",
    "list1": "Chiave pubblica: l'indirizzo del tuo account, può essere condiviso",
    "list2": "Chiave segreta: la tua password – NON condividerla mai né salvarla online!",
    "list3": "Se la chiave segreta viene persa, l'accesso è irrevocabilmente perso.",
    "confirm": "Ho ottenuto entrambe le chiavi."
  },
  "muxedId": "Muxed-ID",
  "muxedInfo": "Con l'ID-Muxed, viene creata un'M-Adresse (M...). Essa punta allo stesso account dell'indirizzo regolare (G...).",
  "muxedIdInvalid": "L'ID multiplexato deve essere un numero intero compreso tra 0 e 18.446.744.073.709.551.615.",
  "muxedAddress": "Indirizzo muxed",
  "muxedActivationInfo": "Gli indirizzi \"muxed\" sono indirizzi alias. Non è necessario attivarli separatamente."
}