{
  "pageTitle": "Glossario",
  "pageIntro": "Qui troverai parole importanti del mondo della blockchain e del network Stellar. Tutto è spiegato in termini semplici.",
  "searchLabel": "Termine di ricerca",
  "searchPlaceholder": "termine di ricerca (z. B. Konto, Account, Muxed)",
  "searchHint": "La ricerca trova parole e spiegazioni.",
  "noResults": "Nessuna corrispondenza.",
  "blockchain": {
    "title": "Blockchain",
    "original": "Blockchain",
    "short": "Libro cassa digitale condiviso – molti computer memorizzano gli stessi registri.",
    "desc": "Una blockchain è come un registro digitale. Molti computer memorizzano le stesse voci, quindi nessuno può modificarle segretamente."
  },
  "wallet": {
    "title": "Portafoglio",
    "original": "Wallet",
    "short": "Portafoglio digitale che gestisce le tue chiavi.",
    "desc": "Un portafoglio è la tua borsa digitale. Gestisce le chiavi di cui hai bisogno per accedere al tuo account e inviare transazioni. Un portafoglio può essere un programma, un'app o persino solo un pezzo di carta con la tua chiave privata."
  },
  "account": {
    "title": "Account",
    "original": "Account",
    "short": "Un account blockchain può detenere asset e inviare transazioni.",
    "desc": "Un account è il luogo sulla blockchain in cui sono detenuti i tuoi beni. Un account ha un indirizzo pubblico che inizia con G. Più portafogli possono accedere allo stesso account se dispongono della chiave corretta."
  },
  "addressG": {
    "title": "G-indirizzo",
    "original": "G Address",
    "short": "La chiave pubblica (beginnt mit G) di un conto Stellar.",
    "desc": "L'indirizzo G è l'indirizzo principale di un account Stellar. Inizia con la lettera G. Lo fornisci ad altri affinché possano inviarti qualcosa."
  },
  "publicKey": {
    "title": "Chiave pubblica",
    "original": "Public Key",
    "short": "Adresse, die du teilen darfst; bei Stellar meist die G‑Adresse.",
    "desc": "La chiave pubblica è l'indirizzo che sei autorizzato a condividere. In Stellar, questo è l'indirizzo G. Altri lo usano per inviarti denaro."
  },
  "privateKey": {
    "title": "Chiave segreta",
    "original": "Secret Key",
    "short": "Password to the account – never share.",
    "desc": "La chiave segreta è la tua password per l'account. Chiunque possieda questa chiave può spostare i tuoi soldi. Non condividerla mai."
  },
  "addressFederation": {
    "title": "Indirizzo della federazione",
    "original": "Federation Address",
    "short": "Kurze Adresse wie E‑Mail, zeigt auf eine G‑Adresse.",
    "desc": "Un indirizzo di federazione assomiglia a un'email. Esempio: nome*dominio.com. Questo indirizzo breve punta a un indirizzo G normale. È più facile da ricordare."
  },
  "addressMuxed": {
    "title": "Account multiplexato",
    "original": "Muxed Account",
    "short": "M‑indirizzo con ID aggiuntivo – condivide un account base.",
    "desc": "Un M-address punta a un account Stellar esistente ma ha un identificatore unico aggiuntivo (ID). Questo permette, ad esempio, la differenziazione di più persone o dipartimenti sotto lo stesso G-address. Tecnicamente, i fondi appartengono ancora all'account principale."
  },
  "multisig": {
    "title": "Multifirma",
    "original": "Multi‑Sig",
    "short": "Le azioni importanti richiedono più di una semplice firma.",
    "desc": "Multi-Sig sta per firme multiple. Un'azione importante richiede più di una chiave. Ad esempio, tu e una seconda chiave dovete entrambi concordare prima che qualcosa possa essere inviato. Questo rende il furto più difficile."
  },
  "trustline": {
    "title": "Trustline",
    "original": "Trustline",
    "short": "Accordo per detenere un token da un emittente specifico.",
    "desc": "Una trustline è come dire sì, accetto questo token. Facendo così, indichi che il tuo account è pronto a detenere un token specifico da un emittente specifico. Senza una trustline, non puoi ricevere questo token.\n\nEsempio: Una trustline è specificata come CODICE:EMITTENTE. Per EURT dall'emittente GDUKMGUGDZQK6Y…, è EURT:GDUKMGUGDZQK6Y…"
  },
  "token": {
    "title": "Gettone",
    "original": "Token",
    "short": "Unità digitale – ad esempio, denaro, punti o crediti.",
    "desc": "Un token è un'unità digitale sulla blockchain. Un token può rappresentare denaro, punti o crediti per un servizio."
  },
  "asset": {
    "title": "Bene patrimoniale",
    "original": "Asset",
    "short": "I token su Stellar sono sempre collegati all'emittente.",
    "desc": "Su Stellar, un token viene chiamato risorsa. Una risorsa è sempre collegata a un conto emittente. Ad esempio, un conto può emettere un token Euro. Questo token Euro è quindi una risorsa."
  },
  "xlm": {
    "title": "XLM (Stellar Lumens)",
    "original": "XLM",
    "short": "Valuta nativa di Stellar per commissioni e attivazione.",
    "desc": "XLM è la valuta nativa di Stellar. Hai bisogno di XLM per pagare le commissioni e per aprire un nuovo conto."
  },
  "mainnet": {
    "title": "Rete principale",
    "original": "Mainnet",
    "short": "Echtes Stellar‑Netzwerk mit realem Wert.",
    "desc": "La rete Stellar reale con valore effettivo. Le transazioni sono definitive e le commissioni vengono pagate in XLM reali."
  },
  "testnet": {
    "title": "Rete di test",
    "original": "Testnet",
    "short": "Rete di pratica pubblica senza valore reale.",
    "desc": "Una rete di pratica pubblica. I token non hanno un valore reale. Ideale per apprendere e sperimentare senza rischi."
  },
  "memo": {
    "title": "Promemoria",
    "original": "Memo",
    "short": "Breve nota in una transazione.",
    "desc": "Un promemoria è una piccola nota che puoi inviare insieme a una transazione. Spesso, una piattaforma di scambio richiede un promemoria specifico per sapere a chi appartiene il denaro."
  },
  "transaction": {
    "title": "Transazione",
    "original": "Transaction",
    "short": "Azione sulla blockchain, ad esempio, pagamento o linea di fiducia.",
    "desc": "Una transazione è un'azione sulla blockchain, come inviare denaro o stabilire una linea di fiducia. Una transazione viene memorizzata in modo permanente una volta confermata."
  },
  "fee": {
    "title": "Commissione",
    "original": "Fee",
    "short": "Quantità molto piccola per transazione.",
    "desc": "La commissione è un importo molto piccolo che paghi ad ogni transazione. La commissione va alla rete. Su Stellar, le commissioni sono molto basse."
  },
  "ledger": {
    "title": "Registro",
    "original": "Ledger",
    "short": "Catena di dati confermati e saldi dei conti.",
    "desc": "Il registro è la catena di tutti i dati confermati. Mostra quali conti possiedono quanto e quali transazioni sono avvenute. Chiunque può controllare il registro."
  },
  "horizon": {
    "title": "Orizzonte",
    "original": "Horizon",
    "short": "API‑Dienst, über den Apps mit Stellar sprechen.",
    "desc": "Horizon è il servizio attraverso il quale i programmi comunicano con la blockchain Stellar. Il nostro strumento interroga Horizon per caricare i saldi degli account e le transazioni."
  },
  "horizonHistory": {
    "title": "Storia dell'Orizzonte",
    "original": "Horizon history depth",
    "short": "Descrive fino a che punto si estende la cronologia delle transazioni fornita dai server pubblici Horizon.",
    "desc": "I server pubblici Horizon gestiti dalla Stellar Development Foundation (Mainnet und Testnet) forniscono solo una cronologia limitata – attualmente circa un anno a ritroso. I dati più vecchi non sono più accessibili attraverso questi endpoint gratuiti. Se hai bisogno di andare più indietro nel tempo, hai fondamentalmente due opzioni: (1) gestire un nodo Horizon autonomo con la cronologia completa (inklusive History Archives), oppure (2) utilizzare servizi di terzi o a pagamento che archiviano e forniscono dati storici di Stellar a lungo termine.",
    "seeAlso": "Entschuldigung, es wurde kein Text zum Übersetzen bereitgestellt. Könnten Sie bitte den Text angeben, den Sie übersetzen lassen möchten?"
  },
  "anchor": {
    "title": "Ancora",
    "original": "Anchor",
    "short": "Firma, die Fiat‑Geld mit Stellar verbindet.",
    "desc": "Un'ancora è un'azienda che collega denaro reale, come euro o dollari, con Stellar. Ad esempio, dai all'ancora degli euro e ricevi in cambio un euro token su Stellar."
  },
  "exchange": {
    "title": "Borsa valori",
    "original": "Exchange",
    "short": "Luogo per acquistare e vendere token.",
    "desc": "Un exchange è un luogo dove puoi acquistare o vendere token. Molti exchange richiedono un processo KYC, ovvero la verifica dell'identità, prima di poter prelevare denaro in euro o franchi."
  },
  "dex": {
    "title": "DEX",
    "original": "Decentralized Exchange",
    "short": "Scambio decentralizzato direttamente sulla blockchain.",
    "desc": "DEX sta per Exchange Decentralizzato. Qui, le persone scambiano direttamente tra loro sulla blockchain. Non c'è un operatore unico. Stellar ha un DEX integrato direttamente."
  },
  "liquidityPool": {
    "title": "Pool di liquidità",
    "original": "Liquidity Pool",
    "short": "Pool congiunto con due token per scambio immediato.",
    "desc": "Una pool di liquidità è una riserva condivisa contenente due token. Le persone depositano entrambi i token al suo interno. Altri possono quindi scambiare immediatamente questi token. I depositanti guadagnano piccole commissioni per questo servizio."
  },
  "balanceClaimable": {
    "title": "Saldo Reclamabile",
    "original": "Claimable Balance",
    "short": "Denaro riservato che devi ancora accettare.",
    "desc": "Un saldo reclamabile è denaro che è già stato riservato per te, ma devi ancora reclamarlo. Solo quando lo accetti, entra nel tuo conto."
  },
  "protocolUpdate": {
    "title": "Aggiornamento del Protocollo",
    "original": "Protocol Update",
    "short": "Aktualisierung der Netzwerk‑Regeln.",
    "desc": "Un aggiornamento del protocollo è un miglioramento delle regole nella rete Stellar, come nuove funzionalità o modifiche di sicurezza. Tutti i nodi nella rete devono utilizzare le stesse regole."
  },
  "soroban": {
    "title": "Soroban",
    "original": "Soroban",
    "short": "Stellars Smart‑Contract‑System.",
    "desc": "Soroban è il sistema di contratti smart di Stellar. Un contratto intelligente è un codice di programma sulla blockchain. Il codice può verificare autonomamente le regole e innescare azioni senza una banca intermediaria."
  },
  "multiSignature": {
    "title": "Multisignature (Multi-Signature)",
    "original": "Multi-Signature",
    "short": "Multiple signatures required; weights + threshold determine the release.",
    "desc": "In una configurazione multi-firma, devono firmare più chiavi prima che un'azione diventi valida. Ogni firmatario ha un peso, e la somma deve raggiungere la soglia richiesta. Questo aumenta la sicurezza perché una singola chiave rubata non è sufficiente."
  },
  "signer": {
    "title": "Firmatario (Signer)",
    "original": "Signer",
    "short": "Chiave pubblica con peso, parte della configurazione dell'account.",
    "desc": "Un firmatario è una chiave pubblica che appartiene a un conto e ha un peso. La sua firma contribuisce al raggiungimento della soglia richiesta. Più firmatari possono autorizzare collettivamente una transazione."
  },
  "thresholds": {
    "title": "Soglie (Thresholds)",
    "original": "Thresholds",
    "short": "Limiti (low/med/high) che determinano la somma richiesta dei pesi.",
    "desc": "Le soglie definiscono quante firme ponderate sono necessarie per le azioni: basse per operazioni semplici, medie per i pagamenti, alte per cambiamenti critici. La somma dei pesi dei firmatari deve soddisfare la soglia rispettiva."
  },
  "masterWeight": {
    "title": "Peso master (master_weight)",
    "original": "master_weight",
    "short": "Peso della chiave principale; controlla quanto conta la chiave principale.",
    "desc": "Il peso principale è il peso della chiave maestra di un account. Un alto peso principale permette alla chiave maestra di firmare molte azioni da sola; un valore basso necessita di firmatari aggiuntivi."
  },
  "accountConfig": {
    "title": "Configurazione dell'account (Account Configuration)",
    "original": "Account Configuration",
    "short": "L'interazione tra i firmatari e le soglie determina la sicurezza dell'account.",
    "desc": "La configurazione del conto specifica quali firmatari esistono con quali pesi e quali soglie si applicano. Modifiche ai firmatari o alle soglie sono critiche per la sicurezza perché determinano quante firme sono necessarie."
  },
  "missingKey": "Chiave del glossario mancante: {{detail}}"
}