{
  "title": "Spiegazione Generale di un Conto Aziendale Multisignature (Multi-Signature)",
  "intro": "Una azienda può utilizzare un conto blockchain condiviso che coinvolge più individui autorizzati. In genere, sono coinvolti almeno tre firmatari (Signer), ad esempio, la direzione, l'ufficiale finanziario e la gestione della conformità/ripristino. L'obiettivo è che le singole persone possano eseguire pagamenti in modo indipendente, senza che nessuna persona singola possa controllare o assumere il controllo del conto da sola.",
  "problem": "Se un firmatario (Signer) ha peso sufficiente per eseguire pagamenti e contemporaneamente possiede abbastanza peso per apportare modifiche al conto, questa persona potrebbe rimuovere altri firmatari (Signer) o regolare la soglia/peso (Thresholds) e da lì assumere il controllo del conto. Al contrario, il proprietario originale non dovrebbe poter escludere facilmente altri firmatari (Signer) senza controlli ed equilibri. Una struttura multi-firma assicura che le decisioni importanti siano sempre prese congiuntamente da più persone.",
  "setupTitle": "Esempio di una struttura multi-firma sicura con tre firmatari.",
  "setupWeights": "In un esempio con tre ruoli di uguale importanza, tutti ricevono la stessa forza di firma:\n- Firmatario (Signer) A (Management): Peso 2\n- Firmatario (Signer) B (Finanzen): Peso 2\n- Firmatario (Signer) C (Compliance/Backup): Peso 2",
  "setupThresholds": "Sono impostate soglie/pesi appropriati:\n- Basso (low_threshold): 1\n- Medio (med_threshold): 2 (for payments and other medium actions)\n- Alto (high_threshold): 4 (per cambiamenti strutturali come aggiungere/rimuovere firmatari (Signer) o modificare la soglia/il peso (Thresholds))\nQuesto consente a ciascuna persona autorizzata di eseguire pagamenti, ma nessuna singola persona può modificare la struttura dell'account da sola.",
  "behavior": "Con questa configurazione, i pagamenti possono essere eseguiti da uno qualsiasi dei tre individui autorizzati da solo, poiché il peso individuale soddisfa sempre la soglia media/Soglia. Per cambiamenti strutturali come la rimozione di un firmatario/Firmatari, l'adeguamento delle soglie/pesi, o la fusione o chiusura del conto, è richiesta la soglia alta/soglia_alta. Questo valore può essere raggiunto solo se almeno due dei tre firmatari/Firmatari firmano insieme. In questo modo, il conto rimane flessibile nell'uso quotidiano pur essendo ben protetto contro l'uso improprio.",
  "removal": "Wenn eine Person das Unternehmen verlässt oder nicht mehr vertrauenswürdig ist, können zwei der verbleibenden Unterzeichner (Signer) gemeinsam die Signaturrechte dieser Person entfernen. Kein einzelner Unterzeichner (Signer) – weder ein Mitarbeiter noch die Geschäftsführung – kann andere eigenständig aus dem Konto ausschließen. Der Entzug von Berechtigungen erfolgt also immer kontrolliert und nachvollziehbar durch mindestens zwei Verantwortliche.",
  "summary": "Questo tipo di struttura multi-firma consente alle singole persone di elaborare pagamenti in modo efficiente, mantenendo il controllo del conto con più parti. Riduce il rischio di appropriazione indebita dell'account, protegge dalle decisioni unilaterali ed è particolarmente adatto per i conti aziendali dove sia la sicurezza che la flessibilità operativa sono importanti.",
  "closeLabel": "Chiudi",
  "linkLabel": "Cosa significa multi-firma?"
}