{
  "title": "Creare un account multisig",
  "menu": "Crea un account + Multisig",
  "menuHint": "Crea un nuovo account e imposta opzionalmente Multisig.",
  "hint": "Crea un nuovo account, attivalo e configura opzionalmente Multisig.",
  "generateKeys": "Generare chiave",
  "enableMultisig": "Attivare Multisig",
  "signersTitle": "Firmatario",
  "signersInfo": "Aggiungi ulteriori firmatari e imposta soglie adeguate.",
  "signersCount": "Numero di firmatari",
  "bestPractices": {
    "title": "Migliori pratiche",
    "text": "Conserva le chiavi segrete in modo sicuro e non distribuirle inutilmente."
  },
  "instructions": {
    "public": "Condividi questa chiave pubblica con altri per i pagamenti.",
    "secret": "Conserva questa chiave segreta in modo sicuro; non divulgarla mai."
  },
  "generateFirst": "Si prega di generare prima una coppia di chiavi.",
  "confirmLowBalance": "Il saldo iniziale {bal} XLM è inferiore alla riserva raccomandata {req} XLM (firmatari: {count}). Continuare?",
  "activated": "L'account è stato attivato. Hash: {hash}",
  "activatedTestnet": "L'account è stato attivato nel Testnet tramite Friendbot.",
  "alreadyActive": "L'account è già attivato.",
  "createdNoSigners": "Account creato, Multisig non configurato.",
  "createdAndConfigured": "Account creato e Multisig configurato. Hash: {hash}",
  "info": {
    "more": "Più informazioni",
    "keysOnPage": {
      "title": "Chiave su questa pagina.",
      "text": "Su questa pagina vengono generati i codici. Conservali in modo sicuro e non condividerli."
    },
    "title": "Informazioni importanti",
    "secureKeys": {
      "title": "Proteggere la chiave segreta",
      "text": "La chiave pubblica può essere condivisa in sicurezza – è come un numero di conto.\n\nLa chiave segreta è l'accesso al tuo conto. Trattala come una password:\n• NON memorizzarla MAI in servizi cloud, email o note non sicure\n• Annotala su carta o utilizza un portafoglio hardware\n• Crea più backup e conservali in luoghi sicuri e separati\n• In caso di perdita della chiave segreta, l'accesso al conto è irrimediabilmente perso"
    },
    "multisigSection": {
      "title": "Multisig (firma multipla)",
      "text": "Con Multisig puoi definire più firmatari per il tuo conto. Le transazioni richiedono quindi firme da più chiavi (ad esempio, 2 su 3).\n\nVantaggi:\n• Maggiore sicurezza (una chiave compromessa non è sufficiente)\n• Conti condivisi (ad esempio, aziende, partnership)\n• Ripristino di emergenza (più backup presso persone diverse)\n\nATTENZIONE: Testa il Multisig prima nel testnet, prima di utilizzarlo nel mainnet! Una configurazione errata può causare la perdita dell'accesso al conto."
    },
    "diagram": {
      "title": "Scadenza della firma"
    }
  },
  "activateHint": "L'attivazione è necessaria affinché l'account esista. Nel Testnet tramite Friendbot, nel Mainnet tramite \"Crea Account\" da un portafoglio esistente.",
  "activateNow": "Attiva subito il conto.",
  "activateOnly": "Solo attivare",
  "balanceWarning": "Il saldo iniziale è probabilmente troppo basso per aggiungere i {{count}} firmatari aggiuntivi (riserva minima: {{req}} XLM)",
  "createButton": "Creare / Impostare Multisig",
  "hints": {
    "byteRange": "(0-255)"
  },
  "mainnetActivateNote": "Nota: Per Multisig sono necessarie riserve aggiuntive. 1 XLM spesso non è sufficiente.",
  "reserve": {
    "base": "Riserva di base per voce: {{val}} XLM",
    "recommended": "Credito iniziale consigliato: {{val}} XLM (incluso margine di sicurezza)",
    "required": "Riserve minime richieste (nuove): {{val}} XLM"
  },
  "signersCountHint": "Imposti il numero minimo di firme in basso sotto \"Firme richieste\" (basso/medio/alto).",
  "signersCountLimit": "Nota: Limite di rete (Stellar): massimo 20 firmatari aggiuntivi.",
  "startingBalance": "Saldo iniziale (XLM)",
  "threshold": "Firme richieste (bassa/media/alta)",
  "thresholdLow": "basso",
  "thresholdMed": "medio",
  "thresholdHigh": "alto",
  "thresholdCurrent": "Attualmente selezionato: basso={{low}}, medio={{med}}, alto={{high}} su {{total}} firme",
  "thresholdHelp": "Soglia: Numero di firme richieste (Maestro + Firmatari) affinché una transazione sia valida.",
  "thresholdInfo": "Raccomandazione: {{req}} di {{total}} firme (incluso master)",
  "thresholdLevelsHint": "Tipicamente si applica: basso = modifiche semplici (ad es. promemoria, prezzo), medio = pagamenti/commercio, alto = modifiche critiche per la sicurezza (ad es. firmatari/soglie).",
  "thresholdStatic": "Necessario: {{val}} di {{total}} firme (basso/medio/alto)",
  "thresholdSum": "Somma dei pesi: {{sum}}",
  "thresholdTooHigh": "Nota: Una soglia non deve superare la somma dei pesi. Si prega di regolare i valori.",
  "keyWarning": {
    "title": "⚠️ Proteggi la chiave ora!",
    "text1": "Hai generato una nuova coppia di chiavi.",
    "text2": "Assicurati ENTRAMBE le chiavi IMMEDIATAMENTE prima di procedere:",
    "list1": "Chiave pubblica: il tuo indirizzo dell'account, può essere condiviso.",
    "list2": "Chiave segreta (Secret Key): la tua password – NON condividerla mai né salvarla online!",
    "list3": "In caso di perdita della chiave segreta, l'accesso è irrimediabilmente perduto.",
    "confirm": "Ho messo al sicuro entrambe le chiavi."
  },
  "tooltips": {
    "high": "Elevato: modifiche critiche per la sicurezza (ad es. firmatario/soglie).",
    "low": "Basso: modifiche semplici (ad es. promemoria, prezzo).",
    "masterWeight": "Peso del titolare del conto (Master) (0-255): La chiave principale del conto ha un diritto di voto. Maggiore è il suo peso, più voti conta la sua firma. Questi voti vengono conteggiati insieme ai voti di altri firmatari per verificare se è stata raggiunta la maggioranza necessaria.",
    "med": "Mezzi: Pagamenti e azioni commerciali.",
    "signerWeight": "Peso dei firmatari (0–255): Anche i firmatari aggiuntivi hanno diritti di voto. Il peso determina quante voti contribuiscono la loro firma. Quando viene inviata una transazione, tutti i voti espressi vengono sommati. Se viene raggiunto il numero minimo di voti stabilito (soglia), la transazione è considerata autorizzata.",
    "signerWeightHint": "Nota: I pesi del master e dei firmatari formano la somma; le soglie (bassa/media/alta) non devono superare questa somma."
  },
  "units": {
    "signatures": "Firma(e)"
  }
}