{
  "title": "Crea account + multfirma",
  "menu": "Crea un account + Multisig",
  "menuHint": "Crea un nuovo account e, facoltativamente, configura la firma multipla.",
  "hint": "Crea un nuovo account, attivalo e configura facoltativamente la firma multipla.",
  "generateKeys": "Genera chiave",
  "enableMultisig": "Abilita multisig",
  "instructions": {
    "public": "Condividi questa chiave pubblica con altri per i pagamenti.",
    "secret": "Tieni questa chiave segreta al sicuro; non condividerla mai."
  },
  "generateFirst": "Si prega di generare prima una coppia di chiavi.",
  "confirmLowBalance": "Il saldo iniziale di {bal} XLM è inferiore alla riserva raccomandata di {req} XLM (Firmatari: {count}). Continuare?",
  "activated": "L'account è stato attivato. Hash: {hash}",
  "activatedTestnet": "L'account è stato attivato sulla testnet tramite Friendbot.",
  "alreadyActive": "L'account è già attivato.",
  "createdNoSigners": "Account creato, multisig non configurato.",
  "createdAndConfigured": "Account creato e multisig configurato. Hash: {hash}",
  "info": {
    "more": "Ulteriori informazioni",
    "keysOnPage": {
      "title": "Chiave su questa pagina",
      "text": "Questa pagina genera chiavi. Mantienile al sicuro e non condividerle."
    },
    "title": "Informazioni importanti",
    "secureKeys": {
      "title": "Chiave segreta sicura",
      "text": "The Public Key can be safely shared – it's like an account number.\n\nThe Secret Key is the access to your account. Treat it like a password:\n• NEVER store it on cloud services, emails, or insecure notes\n• Write it down on paper or use a hardware wallet\n• Create multiple backups and store them in secure, separate locations\n• If the Secret Key is lost, access to the account is irrevocably lost"
    },
    "multisigSection": {
      "title": "Multifirma",
      "text": "Con multisig, puoi definire più firmatari per il tuo account. Le transazioni richiederanno quindi firme multiple, ad esempio 2 su 3.\n\nVantaggi:\n• Maggiore sicurezza, una chiave compromessa non è sufficiente\n• Condivisione per esempio in aziende, partnership\n• più backup tra persone diverse per il recupero\n\nATTENZIONE: Testa il multisig prima sul testnet prima di utilizzarlo sul mainnet! Una configurazione errata può portare alla perdita di accesso all'account."
    },
    "diagram": {
      "title": "Scadenza della firma"
    }
  },
  "activateHint": "L'attivazione è necessaria affinché l'account esista. Nel Testnet, questo può essere fatto tramite Friendbot, mentre nel Mainnet, attraverso \"Crea Account\" da un portafoglio esistente.",
  "activateNow": "Attiva l'account immediatamente.",
  "activateOnly": "Attiva solo",
  "balanceWarning": "Il saldo iniziale è probabilmente troppo basso per aggiungere i {{count}} firmatari aggiuntivi (Riserva minima: {{req}} XLM)",
  "createButton": "Creare / Impostare Multisig",
  "mainnetActivateNote": "Nota: Sono necessarie riserve aggiuntive per il multisig. 1 XLM spesso non è sufficiente.",
  "reserve": {
    "base": "Riserve di base per voce: {{val}} XLM",
    "recommended": "Saldo iniziale raccomandato: {{val}} XLM (inkl. Puffer)",
    "required": "Riserva Minima Obbligatoria (neu): {{val}} XLM"
  },
  "signersCountLimit": "Nota: Limite della rete (Stellar): massimo 20 firmatari aggiuntivi.",
  "startingBalance": "Credito iniziale (XLM)",
  "keyWarning": {
    "title": "⚠️ Proteggi subito la tua chiave!",
    "text1": "Hai generato una nuova coppia di chiavi.",
    "text2": "Assicurati SUBITO entrambe le chiavi prima di procedere:",
    "list1": "Chiave pubblica: l'indirizzo del tuo account, può essere condiviso",
    "list2": "Chiave segreta: La tua password – NON condividerla o memorizzarla mai online!",
    "list3": "Se la chiave segreta viene persa, l'accesso è perso irrevocabilmente.",
    "confirm": "Ho ottenuto entrambe le chiavi."
  },
  "muxedId": "ID Muxed",
  "muxedInfo": "Con l'ID multiplexato, viene creata un M-Address (M...). Esso punta allo stesso account dell'indirizzo regolare (G...).",
  "muxedIdInvalid": "L'ID Muxed deve essere un numero intero compreso tra 0 e 18.446.744.073.709.551.615.",
  "muxedAddress": "Indirizzo muxed",
  "muxedActivationInfo": "Gli indirizzi muxed sono indirizzi alias. Non hanno bisogno di essere attivati separatamente."
}