{
  "title": "Spiegazione generale di un conto aziendale con firma multipla (Multi-Signature)",
  "intro": "Un'azienda può utilizzare un conto blockchain condiviso che coinvolge più persone autorizzate. Di solito, sono coinvolti almeno tre firmatari (Signer), come la direzione, l'ufficiale finanziario e la persona responsabile della conformità/sostituzione. L'obiettivo è che le persone possano eseguire pagamenti in modo indipendente, senza che una sola persona possa controllare o prendere il controllo del conto da sola.",
  "problem": "Se un firmatario (Signer) ha abbastanza peso per eseguire pagamenti e allo stesso tempo abbastanza peso per apportare modifiche all'account, questa persona potrebbe rimuovere altri firmatari (Signer) o regolare la soglia/peso (Thresholds), prendendo così il controllo dell'account. Al contrario, il proprietario originale non dovrebbe essere in grado di escludere semplicemente altri firmatari (Signer) senza controlli ed equilibri. Una struttura multi-sig assicura che le decisioni importanti siano sempre supportate collaborativamente da più persone.",
  "setupTitle": "Esempio di una struttura multi-firma sicura con tre firmatari",
  "setupWeights": "In un esempio con tre ruoli uguali, tutti ricevono la stessa forza di firma:\n- Firmatario (Signer) A (management): peso 2\n- Firmatario (Signer) B (Finanzen): peso 2\n- Firmatario (Signer) C (Compliance/Backup): peso 2",
  "setupThresholds": "Le soglie/pesi appropriati sono impostati come segue:\n- Basso (low_threshold): 1\n- Medio (med_threshold): 2 (for payments and other medium actions)\n- Alto (high_threshold): 4 (per modifiche strutturali come l'aggiunta/rimozione di firmatari (Signer) o la modifica della soglia/peso (Thresholds))\nQuesto consente a ogni persona autorizzata di eseguire pagamenti, ma nessuna persona singola può modificare la struttura del conto da sola.",
  "behavior": "Con questa configurazione, i pagamenti possono essere effettuati individualmente da una qualsiasi delle tre persone autorizzate, poiché il peso individuale soddisfa la soglia media. Tuttavia, modifiche strutturali, come la rimozione di un firmatario, l'adeguamento delle soglie/pesi, o la fusione o chiusura del conto, richiedono una soglia alta. Questo valore può essere raggiunto solo quando almeno due dei tre firmatari firmano insieme. Questa configurazione mantiene il conto flessibile per l'uso quotidiano, fornendo al contempo una forte protezione contro l'uso improprio.",
  "removal": "Se una persona lascia l'azienda o non è più affidabile, due dei sottoscrittori rimanenti (Signer) possono congiuntamente rimuovere i diritti di firma di questa persona. Nessun singolo firmatario (Signer) – né un dipendente né la direzione – può escludere autonomamente altri dall'account. La revoca delle autorizzazioni avviene quindi sempre in modo controllato e tracciabile da parte di almeno due responsabili.",
  "summary": "Questo tipo di struttura a firma multipla consente a persone individuali di elaborare pagamenti in modo efficiente mentre il controllo sull'account resta a più parti. Riduce il rischio di acquisizione dell'account, protegge contro decisioni unilaterali ed è particolarmente adatta per i conti aziendali dove sia la sicurezza sia la flessibilità operativa sono importanti.",
  "closeLabel": "Vicino",
  "linkLabel": "Cosa significa Multi-Signature?"
}