{
  "title": "Spiegazione generale di un conto aziendale multi-signature (Multi-Signature)",
  "intro": "Una azienda può utilizzare un conto blockchain congiunto che coinvolge diverse persone autorizzate. Tipicamente, sono coinvolti almeno tre firmatari (Signer), come la direzione, il responsabile finanziario e la conformità/riserve. L'obiettivo è che le singole persone possano eseguire pagamenti indipendentemente senza che una sola persona abbia il controllo esclusivo o prenda il controllo del conto.",
  "problem": "Se un firmatario (Signer) ha peso sufficiente per eseguire pagamenti e contemporaneamente peso sufficiente per modifiche dell'account, quella persona potrebbe rimuovere altri firmatari (Signer) o regolare la soglia/peso (Thresholds) e quindi prendere il controllo dell'account. Al contrario, anche il proprietario originale non dovrebbe essere in grado di escludere altri firmatari (Signer) senza verifiche ed equilibri. Una struttura multi-sig assicura che decisioni importanti siano sempre supportate collettivamente da più persone.",
  "setupTitle": "Esempio di una struttura multi-firma sicura con tre firmatari",
  "setupWeights": "In un esempio con tre ruoli equivalenti, tutti ricevono la stessa forza di firma:\n- Firmatario (Signer) A (management): peso 2\n- Firmatario (Signer) B (Finanzen): peso 2\n- Firmatario (Signer) C (Compliance/Backup): peso 2",
  "setupThresholds": "Soglie/pesi appropriati sono impostati:\n- Basso (low_threshold): 1\n- Medio (med_threshold): 2 (for payments and other medium actions)\n- Alto (high_threshold): 4 (per modifiche strutturali come aggiungere/rimuovere firmatari (Signer) o cambiare la soglia/peso (Thresholds))\nQuesta configurazione permette a ciascuna persona autorizzata di eseguire pagamenti, ma nessuna persona singolarmente può modificare la struttura dell'account.",
  "behavior": "Con questa configurazione, i pagamenti possono essere effettuati individualmente da una qualsiasi delle tre persone autorizzate, poiché il peso di ciascuna soddisfa la soglia media/Threshold. Tuttavia, per i cambiamenti strutturali, come la rimozione di un firmatario (Signers), la regolazione delle soglie/pesi o la fusione o chiusura del conto, è richiesta la soglia alta/high_threshold. Questo valore può essere raggiunto solo se almeno due dei tre firmatari (Signer) firmano insieme. In questo modo, il conto rimane flessibile per l'uso quotidiano, pur essendo ben protetto contro l'uso improprio.",
  "removal": "Wenn eine Person das Unternehmen verlässt oder nicht mehr vertrauenswürdig ist, können zwei der verbleibenden Unterzeichner (Signer) gemeinsam die Signaturrechte dieser Person entfernen. Kein einzelner Unterzeichner (Signer) – weder ein Mitarbeiter noch die Geschäftsführung – kann andere eigenständig aus dem Konto ausschließen. Der Entzug von Berechtigungen erfolgt also immer kontrolliert und nachvollziehbar durch mindestens zwei Verantwortliche.",
  "summary": "Questo tipo di struttura multi-firma consente a singole persone di elaborare pagamenti in modo efficiente, mantenendo il controllo del conto nelle mani di più parti. Riduce il rischio di appropriazioni indebite del conto, protegge da decisioni unilaterali ed è particolarmente adatta per conti aziendali dove sia la sicurezza che la flessibilità operativa sono importanti.",
  "closeLabel": "Chiudi",
  "linkLabel": "Cosa significa Multi-Signature?"
}