{
  "title": "Multisig & Sicurezza",
  "introText": "Metti alla prova le tue conoscenze su firme, soglie e archiviazione sicura.",
  "q1": {
    "question": "Perché utilizzare multisig?",
    "hint": "Pensa alla responsabilità condivisa.",
    "a1": "Per ridurre il rischio di perdere chiavi individuali.",
    "a1fb": "Corretto: Più firme riducono il rischio individuale.",
    "a2": "Risparmiare sulle commissioni.",
    "a2fb": "Errato: Multisig aumenta la sicurezza, non le commissioni.",
    "a3": "Per inviare più velocemente.",
    "a3fb": "Errato: Multisig non è progettato per la velocità."
  },
  "q2": {
    "question": "Quando è valida una transazione su un account multisig?",
    "hint": "Guarda le firme ponderate.",
    "a1": "Se le firme raggiungono la soglia richiesta.",
    "a1fb": "Corretto: La somma dei pesi deve soddisfare la soglia.",
    "a2": "Non appena è presente una firma.",
    "a2fb": "Non corretto: Una singola firma non è sufficiente quando la soglia è più alta.",
    "a3": "Solo con la chiave maestra, indipendentemente dalla soglia.",
    "a3fb": "Non corretto: Anche la chiave maestra è soggetta alle soglie."
  },
  "q3": {
    "question": "Cosa succede se le soglie sono impostate in modo errato?",
    "hint": "Valori che sono troppo alti o troppo bassi hanno conseguenze.",
    "a1": "Le transazioni potrebbero essere bloccate o autorizzate troppo facilmente.",
    "a1fb": "Corretto: Soglie errate portano a blocchi o a una sicurezza insufficiente.",
    "a2": "Per niente, le soglie sono solo informazioni.",
    "a2fb": "Errato: Le soglie controllano quante firme sono necessarie.",
    "a3": "Il numero di sequenza del conto viene reimpostato.",
    "a3fb": "Errato: Le soglie non hanno alcun impatto sulla sequenza."
  },
  "q4": {
    "question": "Quante firme sono necessarie per una transazione al livello soglia medio?",
    "hint": "soglia media = soglia media.",
    "a1": "I pesi delle firme devono almeno raggiungere la soglia media.",
    "a1fb": "Corretto: La soglia media si applica ai pagamenti.",
    "a2": "Solo una firma alla volta.",
    "a2fb": "Errato: Dipende da pesi e soglie.",
    "a3": "Sempre tutti i firmatari.",
    "a3fb": "Errato: Solo firme sufficienti per raggiungere la soglia."
  },
  "q5": {
    "question": "Come dovrebbero essere conservate le chiavi segrete in configurazioni multisig reali?",
    "hint": "La separazione è sicurezza.",
    "a1": "Separati su diversi dispositivi/luoghi.",
    "a1fb": "Corretto: Le firme dovrebbero essere raccolte separatamente.",
    "a2": "Tutto sullo stesso laptop per comodità.",
    "a2fb": "Errato: Un dispositivo comporta un singolo punto di guasto.",
    "a3": "Condividi in testo semplice in una chat.",
    "a3fb": "Errato: Mai condividere chiavi segrete."
  }
}