{
  "title": "Multisig & Sicurezza",
  "introText": "Metti alla prova la tua conoscenza su firme, soglie e archiviazione sicura.",
  "q1": {
    "question": "Perché si utilizza il multisig?",
    "hint": "Pensa alla responsabilità condivisa.",
    "a1": "Per ridurre il rischio di perdite individuali di chiavi.",
    "a1fb": "Corretto: Molteplici firme riducono il rischio individuale.",
    "a2": "Per risparmiare sulle commissioni.",
    "a2fb": "Errato: Multisig aumenta la sicurezza, non le commissioni.",
    "a3": "Per inviare più rapidamente.",
    "a3fb": "Falso: Multisig non è progettato per la velocità."
  },
  "q2": {
    "question": "Quando è valida una transazione su un conto multisig?",
    "hint": "Guarda le firme ponderate.",
    "a1": "Se le firme raggiungono la soglia richiesta.",
    "a1fb": "Corretto: La somma dei pesi deve raggiungere la soglia.",
    "a2": "Non appena è presente una firma.",
    "a2fb": "Errato: Una sola firma non è sufficiente se la soglia è più alta.",
    "a3": "Solo con la chiave principale, indipendentemente dalla soglia.",
    "a3fb": "Errato: La chiave principale è anche soggetta a soglie."
  },
  "q3": {
    "question": "Cosa succede quando le soglie sono impostate in modo errato?",
    "hint": "Valori che sono troppo alti o troppo bassi hanno conseguenze.",
    "a1": "Le transazioni potrebbero essere bloccate o rilasciate troppo facilmente.",
    "a1fb": "Corretto: Soglie errate portano a blocchi o a sicurezza insufficiente.",
    "a2": "Per niente, le soglie sono solo informazioni.",
    "a2fb": "Errato: Le soglie controllano quante firme sono necessarie.",
    "a3": "Il numero di sequenza dell'account viene reimpostato.",
    "a3fb": "Errato: Le soglie non hanno alcun impatto sulla sequenza."
  },
  "q4": {
    "question": "Quante firme richiede una transazione con la soglia med?",
    "hint": "soglia media = soglia media.",
    "a1": "I pesi delle firme devono almeno raggiungere la soglia media.",
    "a1fb": "Corretto: La soglia mediana si applica ai pagamenti.",
    "a2": "Sempre e solo una firma.",
    "a2fb": "Non corretto: Dipende da pesi e soglie.",
    "a3": "Sempre tutti i firmatari.",
    "a3fb": "Non corretto: Solo abbastanza firme per raggiungere la soglia."
  },
  "q5": {
    "question": "Come dovrebbero essere memorizzate le chiavi segrete in configurazioni multisig reali?",
    "hint": "La separazione è sicurezza.",
    "a1": "Separati su dispositivi/luoghi diversi.",
    "a1fb": "Corretto: Le firme devono essere raccolte separatamente.",
    "a2": "Tutto sullo stesso laptop per comodità.",
    "a2fb": "Non corretto: Un dispositivo rappresenta un singolo punto di guasto.",
    "a3": "Condividi in testo semplice in una chat.",
    "a3fb": "Falso: Non condividere mai le chiavi segrete."
  }
}