{
  "info": "Inserisci la tua Chiave Segreta solo se desideri firmare le transazioni. Senza una Chiave Segreta, puoi solo leggere.",
  "clearSession": "Elimina il segreto della sessione",
  "clearSessionHint": "Rimuovi la chiave segreta memorizzata nella cache dalla sessione.",
  "mismatch": "La chiave segreta inserita non corrisponde alla chiave pubblica caricata.",
  "cleared": "Chiave segreta eliminata dalla sessione",
  "empty": "Il campo della chiave segreta è vuoto.",
  "invalid": "Chiave segreta non valida.",
  "label": "Inserisci la chiave segreta di origine (S-Key)",
  "placeholder": "ad es.",
  "valid": "✅ La chiave segreta è valida.",
  "remember": {
    "label": "Ricorda la chiave segreta per questa sessione.",
    "hint": "Quando abilitato, la chiave sarà memorizzata fino alla chiusura della scheda e riutilizzata per ulteriori pagamenti."
  },
  "addSigner": "Aggiungi un firmatario aggiuntivo",
  "showMultisigInfo": "Informazione",
  "hideMultisigInfo": "Nascondi informazioni",
  "multipleSignersInfo": "Questa azione richiede più firme. Si prega di fornire abbastanza chiavi segrete per raggiungere la soglia.",
  "multisigOptions": {
    "title": "Opzioni di firma per questo account multisig",
    "distributed": {
      "title": "Standard: Flusso Multisig Distribuito",
      "body": "Per impostazione predefinita, questa sessione firma solo con la tua chiave privata. Firme aggiuntive vengono aggiunte tramite file XDR esportati o un ID lavoro da altri firmatari."
    },
    "localAll": {
      "title": "Inserisci tutte le firme localmente.",
      "body": "Scegli questa opzione solo se controlli tutte le chiavi segrete associate a questo account (z. B. nach einer Kontorettung mit mehreren Signern). Il Gestore dell'Account Stellar raccoglierà quindi tutte le firme localmente e invierà la transazione direttamente a Horizon.",
      "checkboxLabel": "Inserisci tutte le firme in questo dialogo localmente e inviale direttamente.",
      "warning": "Nota: Se inserisci tutte le firme localmente, tutte le chiavi segrete saranno presenti in questa sessione. Usa questa opzione solo su dispositivi fidati."
    }
  },
  "multisigInfo": {
    "summary": {
      "single": "Questo account utilizza una singola firma.",
      "multi": "Questo account utilizza più firme (Multisig)."
    },
    "requiredThreshold": "Soglia richiesta ({{level}}): {{value}}",
    "thresholdLabel": "Soglia",
    "weightLabel": "Peso attuale",
    "signers": "Elenco dei firmatari",
    "masterWeightLabel": "Peso dell'account principale",
    "masterHint": "L'account principale è l'account attualmente caricato da cui ha origine questa operazione.",
    "currentWeightLabel": "Peso inserito",
    "masterExplanation": "L'account principale corrisponde all'account attualmente caricato. Inizialmente, aveva tutti i diritti prima che venissero aggiunti firmatari aggiuntivi.",
    "master": "Chiave maestra",
    "signerDisabled": "Firmatario disattivato (peso = 0)"
  },
  "operations": {
    "payment": "Pagamento",
    "setOptions": "Configuration (Signers & Thresholds)",
    "changeTrust": "Modifica la linea di fiducia",
    "unknown": "Azione"
  },
  "multipleSignersThresholdInfo": "Soglia per questa azione: {{threshold}}. Tipicamente, è richiesto un minimo di {{requiredSigners}} firmatari (depending on their weights).",
  "localFlow": {
    "title": "Enter & send all signatures locally",
    "body": "In questo dialogo, inserisci tutte le chiavi segrete necessarie localmente su questo dispositivo. Dopodiché, la transazione viene completamente firmata e inviata direttamente alla rete.",
    "stepAllKeys": "Inserisci tutte le chiavi segrete richieste su questo dispositivo.",
    "stepSend": "La transazione viene quindi completamente firmata e inviata direttamente."
  }
}