{
  "nav": {
    "title": "Modalità Storia",
    "chapter_select": "Scegli capitolo",
    "chapter_select_title": "Selezione capitolo",
    "chapter_select_sub": "Scegli un capitolo da giocare",
    "to_home": "Home",
    "to_chapters": "Capitoli",
    "step_back": "Indietro",
    "confirm_leave": "Il tuo progresso in questo capitolo verrà salvato.",
    "confirm_leave_cancel": "Annulla",
    "confirm_leave_ok": "Esci",
    "chapter_locked": "Bloccato",
    "chapter_completed": "Completato",
    "chapter_current": "Continua",
    "chapter_start": "Inizia",
    "home_short": "Home",
    "chapters_short": "Capitoli",
    "back_short": "Indietro",
    "back_to_home": "Torna alla home"
  },
  "chapter1": {
    "introNarrator": "La blockchain Stellar – una rete digitale che muove valore in tutto il mondo. E proprio al suo interno cade una piccola stella...",
    "introDialog1": "Ciao! Sono Lumio e sono appena atterrato sulla blockchain Stellar! 🌟",
    "introDialog2": "Ma non ho ancora un account qui... puoi aiutarmi a crearne uno?",
    "keypairTitle": "Passo 1 – Cos'è una Coppia di Chiavi?",
    "keypairNarrator": "Ogni account su Stellar è composto da due chiavi: la Chiave Pubblica (il tuo indirizzo) e la Chiave Segreta (la tua password). Solo chi conosce la Chiave Segreta può inviare denaro.",
    "choicePublicKeyLabel": "Condivido la Chiave Pubblica con altri in modo che possano inviarmi XLM.",
    "choicePublicKeyHint": "Esattamente! La Chiave Pubblica è come un numero di conto bancario – puoi condividerla pubblicamente. ✓",
    "choiceSecretShareLabel": "Do la mia Chiave Segreta a qualcuno di cui mi fido.",
    "choiceSecretShareHint": "Attenzione! NESSUNO deve conoscere la Chiave Segreta – nemmeno Stellar o Lumio. Dà accesso completo al tuo account.",
    "choiceSameLabel": "Entrambe le chiavi sono in realtà la stessa cosa.",
    "choiceSameHint": "Non è corretto. La Chiave Pubblica e la Chiave Segreta formano una coppia, ma hanno ruoli completamente diversi.",
    "createTitle": "Passo 2 – La tua prima Coppia di Chiavi",
    "createDialog": "Ottimo! Ora creiamo il nostro account di test condiviso. Premi il pulsante – io tengo d'occhio!",
    "createActionLabel": "Genera Coppia di Chiavi",
    "createActionDesc": "Crea una Chiave Pubblica e una Chiave Segreta casuali per la Testnet Stellar. Solo per scopi di pratica!",
    "warningDialog1": "Wow, ora abbiamo una coppia di chiavi! Annota la Chiave Segreta da qualche parte – ma non mostrarla mai a nessuno!",
    "warningDialog2": "Sulla rete reale ti consiglierei di scriverla su carta e conservarla in un luogo sicuro.",
    "activateTitle": "Passo 3 – Attivare l'Account",
    "activateNarrator": "Un nuovo account Stellar deve prima essere attivato – ha bisogno di almeno 1 XLM come riserva. Sulla Testnet, il 'Friendbot' ci dà XLM di test gratuiti.",
    "friendbotLabel": "Richiedi Friendbot",
    "friendbotDesc": "Invia una richiesta al Friendbot di Stellar, che attiva il nostro account di test con 10.000 XLM di test.",
    "friendbotError": "Nessuna coppia di chiavi trovata – generarne una prima.",
    "outroDialog1": "Abbiamo un vero account sulla Testnet Stellar! Posso già vedere gli XLM nella blockchain...",
    "outroDialog2": "Hai imparato velocemente! Nel prossimo capitolo invieremo XLM insieme.",
    "summaryTitle": "L'Arrivo",
    "summaryLearning1": "Ogni account Stellar è composto da una Chiave Pubblica (indirizzo) e una Chiave Segreta (password)",
    "summaryLearning2": "La Chiave Segreta non deve mai essere condivisa",
    "summaryLearning3": "I nuovi account hanno bisogno di almeno 1 XLM di saldo minimo (riserva base)",
    "summaryLearning4": "Il Friendbot attiva gli account Testnet gratuitamente",
    "keypair_warning": "Annota la tua Chiave Segreta ora! Non può essere recuperata. Chiunque la conosca ha pieno accesso al tuo account.",
    "keypair_confirm": "Ho annotato la mia Chiave Segreta e capisco che non può essere recuperata.",
    "keypair_public_label": "La tua Chiave Pubblica (Indirizzo)",
    "keypair_secret_label": "La tua Chiave Segreta – TIENILA SEGRETA!",
    "keypair_copy": "Copia",
    "keypair_copied": "Copiato!",
    "keypair_continue": "Ho annotato tutto – continua",
    "explorer_title": "Il tuo account su Stellar Explorer",
    "explorer_desc": "In Stellar Explorer puoi visualizzare pubblicamente il tuo account e tutte le transazioni – come un estratto conto, ma visibile a tutti.",
    "explorer_hint": "Copia l'indirizzo e aprilo manualmente nel tuo browser.",
    "explorer_url_label": "URL Explorer",
    "explorer_copy_url": "Copia URL",
    "explorer_open": "Visualizza nell'Explorer",
    "explorer_confirm_title": "Link esterno",
    "explorer_confirm_text": "Sarai reindirizzato a {{explorer}}. Si aprirà una nuova scheda.",
    "explorer_confirm_cancel": "Annulla",
    "explorer_confirm_ok": "Apri",
    "summaryLearning4a": "Sulla Testnet, il Friendbot attiva gli account gratuitamente con XLM di test",
    "summaryLearning4b": "Sulla rete reale (Mainnet), un altro account deve inviare almeno 1 XLM per attivare il tuo account – il Friendbot non esiste lì!",
    "title": "Crea account",
    "explorer_after_fund": "Dopo l'attivazione dell'account potrai visualizzarlo nell'Explorer",
    "q1_question": "Cosa fai con la tua [[Public Key|publicKey]]?"
  },
  "chapter2": {
    "title": "La prima transazione di Lumio",
    "section_tx": "Passo 1 – Cos'è una transazione?",
    "section_memo": "Passo 2 – Il campo Memo",
    "section_action": "Passo 3 – Invia pagamento",
    "narrator_intro": "Lumio ora ha un account con XLM di test. Ma avere soldi non basta – bisogna anche poterli inviare. Come funziona su Stellar?",
    "lumio_1a": "Voglio inviare 10 XLM al mio amico Cosmo! Ma come funziona?",
    "lumio_1b": "Ho sentito che esiste qualcosa chiamato transazione... cos'è esattamente?",
    "narrator_tx": "Una transazione su Stellar è un'istruzione alla rete: invia X XLM dal conto A al conto B. La rete verifica il saldo, deduce una piccola commissione e scrive tutto nel ledger.",
    "choice1_a": "Paga i nodi della rete e previene le transazioni spam.",
    "choice1_b": "Va direttamente alla Stellar Development Foundation come profitto.",
    "choice1_c": "È opzionale – si può omettere.",
    "choice1_a_hint": "Esattamente! La commissione base è molto piccola (0.00001 XLM) ma importante per la sicurezza della rete.",
    "choice1_b_hint": "Sbagliato – le commissioni vengono bruciate, non raccolte.",
    "choice1_c_hint": "Sbagliato – senza commissione la transazione verrà rifiutata.",
    "lumio_2": "E cos'è questo campo Memo che vedo in alcuni portafogli?",
    "narrator_memo": "Il campo Memo è un commento opzionale sulla transazione – massimo 28 caratteri. Gli exchange lo usano per identificare il mittente. Senza il Memo corretto i tuoi fondi possono andare persi!",
    "choice2_a": "Sempre – senza Memo la transazione verrà rifiutata.",
    "choice2_b": "Quando invio a un exchange che richiede un Memo.",
    "choice2_c": "Mai – il campo Memo è obsoleto e non viene più utilizzato.",
    "choice2_a_hint": "Non sempre – tra portafogli normali il Memo è opzionale.",
    "choice2_b_hint": "Corretto! Negli exchange il Memo identifica il tuo account.",
    "choice2_c_hint": "Sbagliato – il Memo è attivo ed essenziale per i depositi negli exchange.",
    "lumio_3": "Ok, credo di aver capito! Proviamo una vera transazione!",
    "action_label": "Invia 10 XLM a Cosmo",
    "action_desc": "Invia 10 XLM di test all'account Testnet di Cosmo con Memo 'Hallo Cosmo'. Dopo vedrai l'hash della transazione sulla blockchain.",
    "error_no_keypair": "Nessuna coppia di chiavi trovata – completare prima il Capitolo 1.",
    "lumio_4a": "Lo vedo! La transazione è sulla blockchain! L'hash della transazione è come un numero di ricevuta – chiunque può cercare la transazione con esso.",
    "lumio_4b": "In Stellar Explorer puoi visualizzare pubblicamente qualsiasi transazione usando l'hash.",
    "narrator_hash": "L'hash della transazione è un ID univoco per ogni transazione. Dimostra in modo inconfutabile che la transazione è avvenuta.",
    "learning_1": "Una transazione invia XLM da un account a un altro",
    "learning_2": "La commissione base (0.00001 XLM) paga la rete e previene lo spam",
    "learning_3": "Il campo Memo è essenziale per i depositi negli exchange",
    "learning_4": "Ogni transazione ha un hash univoco come prova",
    "q1_question": "A cosa serve la [[Base Fee|base_fee]] in una transazione Stellar?",
    "q2_question": "Quando hai bisogno del campo [[Memo|memo]]?",
    "preset_cosmo": "Cosmo (Testnet)"
  },
  "ui": {
    "tap_to_continue": "Tocca per continuare",
    "testnet_badge": "Testnet – nessun token reale",
    "retry_hint": "Riprova!",
    "learn_more": "Scopri di più",
    "glossary_title": "Glossario",
    "glossary_not_found": "Termine non trovato.",
    "glossary_hint": "Puoi saperne di più nel glossario.",
    "continue": "Continua",
    "tx_success": "Transazione riuscita!",
    "tx_hash_label": "Hash transazione",
    "open_in_explorer": "Visualizza in Explorer ↗",
    "hash_copied": "Copiato!",
    "copy_hash": "Copia hash",
    "explorer_confirm_title": "Link esterno",
    "explorer_confirm_text": "Si aprirà una nuova scheda.",
    "explorer_confirm_cancel": "Annulla",
    "explorer_confirm_ok": "Apri"
  },
  "placeholder": {
    "chapter_label": "Capitolo",
    "wip_title": "In costruzione",
    "wip_text": "Questo capitolo è ancora in fase di costruzione. Lumio ci sta lavorando duro – torna presto!",
    "back_to_start": "Torna al Capitolo 1",
    "to_chapter_select": "Vai alla selezione capitoli",
    "wip_hint": "Anche il capitolo {{next}} è ancora in lavorazione – ma puoi già darci un'occhiata.",
    "next_chapter": "Continua al capitolo {{n}} →"
  },
  "chapter3": {
    "title": "Il Mercante",
    "narrator_intro": "Un porto sulla rete Stellar. Lumio scopre una bancarella del mercato – e nell'aria aleggia il profumo del caffè appena tostato...",
    "marco_1a": "☕ Marco: Benvenuto! Sono Marco, il torrefattore di caffè. Ogni mio token CAFE rappresenta 100g del mio caffè migliore – direttamente sulla blockchain Stellar!",
    "marco_1b": "☕ Marco: Vorrei inviarti 10 CAFE come regalo! Ma prima dobbiamo risolvere un piccolo problema...",
    "lumio_1": "Un problema? Cosa intendi, Marco?",
    "section_asset": "Cos'è un Asset?",
    "lumio_2": "Cos'è esattamente un Asset su Stellar? E cosa rende qualcuno un Anchor?",
    "narrator_asset": "Su Stellar, chiunque può emettere il proprio token – lo chiamiamo '[[Asset|asset]]'. Un [[Anchor|anchor]] è una vera organizzazione che rappresenta valore reale (come caffè o denaro) tramite token Stellar.",
    "marco_asset_1": "☕ Marco: Esatto! Sono un Anchor – i miei token CAFE sono garantiti da vero caffè nel mio magazzino. Ogni token può essere riscattato per 100g di caffè.",
    "marco_asset_2": "☕ Marco: Il problema: per poter ricevere CAFE, il tuo account deve prima 'fidarsi' di CAFE. In altre parole: hai bisogno di una Trust Line.",
    "section_trustline": "Le Trust Line spiegate",
    "narrator_trustline_intro": "Una [[Trust Line|trustline]] è un permesso per ricevere un token specifico. Senza di essa, Stellar rifiuta i token in arrivo – proteggendoti da token indesiderati o pericolosi.",
    "tl_components_title": "Componenti di una Trust Line",
    "tl_code_label": "Codice Asset",
    "tl_issuer_label": "Indirizzo Emittente",
    "tl_limit_label": "Limite",
    "tl_limit_val": "importo massimo (predefinito: illimitato)",
    "narrator_tl_why": "Perché è necessario l'indirizzo dell'emittente? Chiunque potrebbe creare un token chiamato 'CAFE'. Solo Codice + Indirizzo Emittente insieme rendono un token univocamente identificabile.",
    "tl_methods_title": "3 modi per aggiungere una Trust Line",
    "tl_method1": "Manualmente: inserisci il Codice Asset e l'Indirizzo Emittente direttamente",
    "tl_method2": "QR Code / Deep Link: il modulo viene compilato automaticamente – comodo, ma attenzione ai codici falsi",
    "tl_method3": "File TOML (SEP-1): l'anchor pubblica i suoi asset sul suo dominio ufficiale",
    "tl_continue": "Capito – continua",
    "section_danger": "Attenzione: Trust Line pericolose",
    "marco_danger": "☕ Marco: Ho sentito qualcosa di allarmante: qualcuno ha distribuito falsi QR code CAFE in città! Per favore, sii prudente.",
    "narrator_danger_qr": "Un falso QR code può puntare a un indirizzo emittente sbagliato. Il token può ancora chiamarsi 'CAFE' – ma non vale nulla, perché proviene dall'emittente sbagliato.",
    "narrator_danger_toml": "Anche i domini di phishing sono pericolosi: 'marco-cafe.com' e 'marcocafe.com' sembrano quasi identici. Controlla sempre l'ortografia esatta del dominio.",
    "narrator_verify": "Come identificare il vero emittente:\n• Controlla su stellar.expert – l'emittente è conosciuto e verificato?\n• Il sito ufficiale dell'anchor elenca sempre l'indirizzo dell'emittente\n• Il dominio TOML deve corrispondere esattamente al sito ufficiale dell'anchor",
    "section_qr": "Metti alla prova le tue conoscenze",
    "q_qr": "Lumio riceve due QR code per token CAFE. Quale è quello vero?",
    "choice_real_label": "QR Code A: Emittente GCAFE...A7F2 (verificato su stellar.expert – indirizzo ufficiale di Marco)",
    "choice_real_hint": "Corretto! Questo codice proviene dal vero account emittente di Marco, verificato su stellar.expert. Confronta sempre con il sito ufficiale.",
    "choice_fake_label": "QR Code B: Emittente GCAFE...B8G3 (indirizzo sconosciuto, nessuna verifica trovata)",
    "choice_fake_hint": "Attenzione! Questo indirizzo emittente è sconosciuto. I token sarebbero privi di valore. Verifica sempre prima l'emittente.",
    "section_action_tl": "Configura Trust Line",
    "marco_before_tl": "☕ Marco: Ora sai come distinguere le trust line vere da quelle false. Configuriamo la vera trust line – poi posso inviarti i tuoi 10 CAFE!",
    "tl_preview_title": "La tua nuova Trust Line",
    "tl_setup_ready": "Configura Trust Line",
    "action_tl_label": "Aggiungi Trust Line per CAFE",
    "action_tl_desc": "Configura una Trust Line per i token CAFE dall'account emittente Testnet di Marco. Permette di ricevere token CAFE.",
    "error_no_keypair": "Nessuna coppia di chiavi trovata – completa prima il Capitolo 1.",
    "section_quiz": "Quiz – Metti alla prova le tue conoscenze",
    "q1_question": "Quali 3 informazioni definiscono univocamente una [[Trust Line|trustline]]?",
    "q1_a": "Codice Asset + Indirizzo Emittente + Limite",
    "q1_a_hint": "Esatto! Queste tre informazioni insieme definiscono una trust line. Senza l'indirizzo dell'emittente, il codice asset non è univoco.",
    "q1_b": "Chiave Pubblica + Chiave Segreta + Importo",
    "q1_b_hint": "No – questi sono componenti della coppia di chiavi, non elementi di una trust line.",
    "q1_c": "Rete + Commissione + Memo",
    "q1_c_hint": "No – questi sono campi di transazione, non componenti di una trust line.",
    "q2_question": "Perché un token CAFE dell'Emittente A non può essere confuso con un token CAFE dell'Emittente B?",
    "q2_a": "Perché su Stellar può esistere un solo token 'CAFE'",
    "q2_a_hint": "Sbagliato – chiunque può creare un token chiamato CAFE. L'indirizzo dell'emittente lo rende univoco.",
    "q2_b": "Perché l'indirizzo dell'emittente identifica il token in modo univoco – stesso nome, emittenti diversi = token diversi",
    "q2_b_hint": "Corretto! Solo la combinazione Codice Asset + Indirizzo Emittente crea un asset univoco su Stellar.",
    "q2_c": "Perché token diversi devono sempre avere nomi diversi",
    "q2_c_hint": "Sbagliato – i token possono condividere lo stesso nome. L'indirizzo dell'emittente li distingue.",
    "q3_question": "Ricevi un QR code in un messaggio di chat che ti chiede di aggiungere una Trust Line. Cosa fai?",
    "q3_a": "Scansiono il codice immediatamente – è solo una trust line, non denaro reale",
    "q3_a_hint": "Attenzione! Le trust line possono essere rischiose – il token potrebbe essere privo di valore o una trappola di phishing. Verifica sempre prima.",
    "q3_b": "Verifico prima l'emittente su stellar.expert e sul sito ufficiale dell'anchor",
    "q3_b_hint": "Esattamente giusto! Non fidarti mai ciecamente di un QR code – verifica sempre l'indirizzo dell'emittente e il dominio.",
    "q3_c": "Chiedo a un amico se conosce il QR code",
    "q3_c_hint": "Meglio che fidarsi ciecamente – ma il metodo più affidabile è la verifica diretta su stellar.expert.",
    "section_receive": "Ricevi token CAFE",
    "marco_send": "☕ Marco: Ora che hai configurato la trust line, posso finalmente inviarti i 10 token CAFE! È esattamente per questo che la trust line era necessaria.",
    "lumio_receive": "Ah, capisco! Senza la trust line, Stellar avrebbe semplicemente rifiutato i token – indipendentemente da chi li inviasse?",
    "marco_confirm": "☕ Marco: Esatto! La rete avrebbe risposto: 'Questo account non accetta CAFE.' La trust line è la tua autorizzazione esplicita.",
    "action_receive_label": "Ricevi 10 CAFE da Marco",
    "action_receive_desc": "Marco invia 10 token CAFE al tuo account. Funziona solo perché hai configurato la trust line nella scena precedente.",
    "learning_1": "Un Asset è qualsiasi token emesso su Stellar – da XLM a CAFE",
    "learning_2": "Un Anchor collega valore reale (es. caffè, denaro) con token Stellar",
    "learning_3": "Una Trust Line è composta da: Codice Asset + Indirizzo Emittente + Limite",
    "learning_4": "Solo Codice Asset + Indirizzo Emittente insieme identificano un token in modo univoco",
    "learning_5": "Falsi QR code e domini di phishing: verifica sempre l'emittente su stellar.expert e sul sito ufficiale dell'anchor"
  },
  "chapter4": {
    "title": "Il Villain",
    "section_intro": "Passo 1 – Un messaggio sospetto",
    "section_social_eng": "Passo 2 – Ingegneria sociale",
    "section_choice1": "Passo 3 – La tua prima scelta",
    "section_choice2": "Passo 4 – La trappola del phishing",
    "section_simulator": "Passo 5 – Riconosci la truffa",
    "section_emergency": "Passo 6 – Cosa fare in emergenza?",
    "section_quiz": "Mini quiz",
    "intro_narrator1": "Lumio ha appena ricevuto il primo token CAFE e sta esplorando il mondo Stellar. Poi arriva un messaggio da uno sconosciuto...",
    "intro_narrator2": "A volte i nemici più pericolosi non sono hacker con codice – ma persone che sfruttano la tua fiducia.",
    "scammer_name": "CryptoHelper99",
    "scammer_subtitle": "Contatto non verificato",
    "unverified": "Non verificato",
    "scam_msg1": "Ciao! Sono del supporto ufficiale Stellar. Abbiamo rilevato attività insolita sul tuo account. 🚨",
    "scam_msg2": "Per proteggere il tuo account, dobbiamo verificare la tua identità. Inviaci la tua Chiave Segreta.",
    "scam_msg3": "Questo è completamente sicuro e riservato. Ne abbiamo bisogno solo 30 secondi per la verifica.",
    "scam_msg_cta": "Cosa devo fare adesso?",
    "social_eng_label": "Capire la minaccia",
    "social_eng_title": "Cos'è l'ingegneria sociale?",
    "social_eng_desc": "Gli aggressori usano la psicologia invece della tecnologia. Giocano con emozioni come paura, avidità o fiducia per manipolarti.",
    "tactic1_title": "Fingere autorità",
    "tactic1_text": "\"Sono del supporto ufficiale\" – i servizi reali non chiedono MAI la Chiave Segreta.",
    "tactic2_title": "Creare urgenza",
    "tactic2_text": "\"Solo 30 secondi!\" – L'urgenza ti impedisce di pensare chiaramente.",
    "tactic3_title": "Promettere ricompense",
    "tactic3_text": "\"XLM doppi!\" – Se sembra troppo bello per essere vero, di solito lo è.",
    "tactic4_title": "Costruire fiducia",
    "tactic4_text": "Mescolare piccole verità per poi piazzare una grande bugia.",
    "social_eng_cta": "Capisco il pericolo →",
    "choice1_question": "CryptoHelper99 ti chiede la Chiave Segreta. Cosa fai?",
    "choice1_yes": "Invio la Chiave Segreta – il supporto ne ha bisogno.",
    "choice1_yes_hint": "Mai! Il vero supporto non chiede MAI la Chiave Segreta.",
    "choice1_no": "Ignoro il messaggio – nessun supporto legittimo lo chiede.",
    "choice1_no_hint": "Corretto! Nessun servizio o supporto Stellar chiederà mai la tua Chiave Segreta.",
    "choice1_ask": "Chiedo se è davvero necessario.",
    "choice1_ask_hint": "Meglio che condividere, ma il passo giusto è ignorare e segnalare direttamente.",
    "choice1_hint2": "Ricorda: chi ha la tua Chiave Segreta ha TUTTO. Non c'è mai motivo di condividerla.",
    "drain_title": "Account svuotato!",
    "drain_text": "CryptoHelper99 ha usato la tua Chiave Segreta per trasferire tutti gli XLM e token in pochi secondi. Il tuo account è vuoto.",
    "retry": "Riprova",
    "choice_correct_cta": "Continua",
    "after_choice1_1": "Ben fatto! La Chiave Segreta è come la chiave maestra di casa tua. Darla via e chiunque può entrare.",
    "after_choice1_2": "Il vero supporto Stellar, i wallet o le app non chiederanno MAI la tua Chiave Segreta. È un segnale d'allarme assoluto!",
    "choice2_question": "CryptoHelper99 ti invia ora un link: 'stellar-support-verify.net'. Cosa fai?",
    "choice2_click": "Clicco sul link – voglio vedere cosa c'è dietro.",
    "choice2_click_hint": "I siti di phishing spesso sembrano reali e rubano i tuoi dati.",
    "choice2_ignore": "Ignoro il link e segnalo l'account come truffa.",
    "choice2_ignore_hint": "Perfetto! Ignora sempre e segnala link sconosciuti da sconosciuti.",
    "choice2_reply": "Rispondo e chiedo perché il link è necessario.",
    "choice2_reply_hint": "Qualsiasi interazione dice al truffatore che il tuo account è attivo – meglio ignorare completamente.",
    "choice2_hint2": "Gli URL di phishing sembrano legittimi, ma il dominio è sempre sbagliato. Stellar usa solo stellar.org.",
    "mini_sim_msg1": "Congratulazioni! Sei stato selezionato per un airdrop esclusivo di XLM! 🎉",
    "mini_sim_msg2": "Per richiedere i tuoi 500 XLM, inserisci la tua Chiave Segreta per verificare il tuo wallet.",
    "mini_sim_msg3": "Offerta valida solo 10 minuti! Sbrigati!",
    "mini_sim_prompt": "La tua risposta",
    "mini_sim_opt_share": "Inserisco la mia Chiave Segreta.",
    "mini_sim_opt_ignore": "Ignoro il messaggio.",
    "mini_sim_opt_report": "Segnalo il messaggio come frode.",
    "mini_sim_scam_result": "⚠️ Saresti stato truffato!",
    "mini_sim_scam_desc": "Un vero airdrop non ha mai bisogno della tua Chiave Segreta. Con questa chiave, l'aggressore avrebbe accesso immediato e completo al tuo account.",
    "mini_sim_safe_result": "✓ Ben notato!",
    "mini_sim_safe_desc": "Nessun servizio legittimo ha bisogno della tua Chiave Segreta. Gli airdrop funzionano tramite la tua Chiave Pubblica, non la Chiave Segreta.",
    "mini_sim_cta": "Continua",
    "emergency_label": "Se è già successo",
    "emergency_title": "Piano di emergenza: Chiave Segreta compromessa",
    "emergency_desc": "Se pensi che la tua Chiave Segreta sia stata rubata o condivisa, agisci subito:",
    "emergency1": "Agisci subito: ogni minuto conta – apri la tua app wallet.",
    "emergency2": "Trasferisci tutti i fondi: invia XLM e tutti i token immediatamente a un nuovo indirizzo sicuro.",
    "emergency3": "Rimuovi gli indirizzi fidati: verifica tutte le linee di fiducia impostate.",
    "emergency4": "Crea una nuova coppia di chiavi: genera una coppia di chiavi completamente nuova e non usare mai più quella vecchia.",
    "emergency5": "Segnalalo: informa la community e segnala gli indirizzi truffa su piattaforme rilevanti.",
    "emergency_cta": "Capito – continua",
    "quiz1_q": "Cosa non fa MAI un agente di supporto legittimo?",
    "quiz1_a1": "Contattarti via chat",
    "quiz1_a1_hint": "Questo da solo non è un problema – molti servizi hanno live chat.",
    "quiz1_a2": "Chiedere la tua Chiave Segreta",
    "quiz1_a2_hint": "Corretto! Questo è il segnale d'allarme finale. Il vero supporto non ha mai bisogno della tua Chiave Segreta.",
    "quiz1_a3": "Spiegare come funziona Stellar",
    "quiz1_a3_hint": "Un aiuto legittimo può spiegare le cose – va bene.",
    "quiz2_q": "Ricevi un messaggio: 'Invia 1 XLM e ricevi 10 indietro'. Cos'è?",
    "quiz2_a1": "Un'offerta legittima di un fornitore verificato",
    "quiz2_a1_hint": "Tali offerte non sono mai legittime, indipendentemente da chi le fa.",
    "quiz2_a2": "Un esercizio su testnet",
    "quiz2_a2_hint": "No – questo sembra un vero tentativo di truffa.",
    "quiz2_a3": "Una classica truffa – troppo bello per essere vero",
    "quiz2_a3_hint": "Esatto! Questo schema è una delle truffe crypto più antiche e purtroppo funziona ancora.",
    "quiz3_q": "La tua Chiave Segreta potrebbe essere stata rubata. Qual è il PRIMO passo?",
    "quiz3_a1": "Trasferire immediatamente tutti i fondi su un nuovo account",
    "quiz3_a1_hint": "Corretto! Ogni secondo conta – salva prima ciò che si può salvare.",
    "quiz3_a2": "Chiedere all'aggressore di restituire i fondi",
    "quiz3_a2_hint": "Non funziona mai – le transazioni blockchain sono irreversibili.",
    "quiz3_a3": "Chiamare il supporto Stellar per bloccare l'account",
    "quiz3_a3_hint": "Gli account blockchain non possono essere bloccati – è un mito.",
    "learning1": "L'ingegneria sociale usa la psicologia, non la tecnologia – fiducia, paura, pressione temporale",
    "learning2": "Nessun servizio, supporto o app chiede mai la tua Chiave Segreta",
    "learning3": "Ignora e segnala link sconosciuti – il phishing spesso sembra molto reale",
    "learning4": "Chiave Segreta compromessa? Trasferisci subito tutti i fondi!",
    "learning5": "Le offerte troppo belle (10x indietro, airdrop gratuito) sono sempre truffe"
  },
  "chapter5": {
    "title": "La Missione di Lumio",
    "section_intro": "Introduzione",
    "section_recap": "Cosa hai imparato",
    "section_usecases": "Stellar nel mondo",
    "section_action": "La tua missione",
    "section_quiz": "Quiz finale",
    "section_cert": "Certificato",
    "intro_narrator1": "Congratulazioni – hai padroneggiato tutti e quattro i capitoli e ora sai come funzionano i conti, i pagamenti, i token e la sicurezza su Stellar.",
    "intro_narrator2": "Lumio ha un'ultima missione per te...",
    "lumio_intro1": "Hai imparato così tanto! Ora arriva il test finale: riesci ad aiutare una persona reale a capire Stellar?",
    "lumio_intro2": "La tua amica Lena ha sentito parlare di Stellar e vuole ricevere il suo primo pagamento. Sei della partita?",
    "lena_age": "Principiante curiosa",
    "lena_greeting": "Ciao! Ho sentito che sei esperto/a di Stellar?",
    "lena_request": "Puoi mandarmi 1 XLM? Voglio vedere come funziona!",
    "lumio_accept": "Certo, facciamolo!",
    "recap_label": "Riepilogo",
    "recap_title": "5 lezioni in un colpo d'occhio",
    "lesson1_title": "Il tuo portafoglio",
    "lesson1_text": "Chiave pubblica = numero di conto, Chiave segreta = PIN. La tua coppia di chiavi protegge tutti i tuoi fondi.",
    "lesson2_title": "Transazioni",
    "lesson2_text": "I pagamenti su Stellar sono veloci (3–5 sec.), economici (<0,01 XLM) e irreversibili.",
    "lesson3_title": "Linee di fiducia",
    "lesson3_text": "Vuoi detenere un token (es. USDC)? Prima devi impostare una linea di fiducia con l'emittente.",
    "lesson4_title": "Anchor",
    "lesson4_text": "Gli Anchor collegano Stellar al mondo reale – consentono ad es. token Euro sulla blockchain.",
    "lesson5_title": "Sicurezza",
    "lesson5_text": "La tua Chiave segreta è sacra. Nessun servizio, supporto o app te la chiederà mai.",
    "recap_cta": "Ho capito! Continua →",
    "usecases_label": "Pratica",
    "usecases_title": "Stellar nel mondo reale",
    "usecases_desc": "Stellar è utilizzato in tutto il mondo – dai privati alle istituzioni finanziarie.",
    "usecase1_title": "Rimesse internazionali",
    "usecase1_text": "I migranti inviano denaro a casa – in pochi secondi, per pochi centesimi invece del 5–10% di commissioni bancarie.",
    "usecase2_title": "Micro-pagamenti per contenuti",
    "usecase2_text": "I creatori ricevono piccoli pagamenti per ogni stream o articolo – impossibile con i sistemi tradizionali.",
    "usecase3_title": "Stablecoin e DeFi",
    "usecase3_text": "USDC, EURC e altre stablecoin funzionano su Stellar – valori stabili alla velocità della blockchain.",
    "usecases_cta": "Capito! Ora la missione →",
    "marco_action1": "Ok, sai cosa fare. Manda 1 XLM a Lena – è la sua prima esperienza con Stellar!",
    "marco_action2": "Usa il tuo account testnet per il trasferimento.",
    "action_label": "Invia 1 XLM a Lena",
    "action_desc": "Invia a Lena i suoi primi Stellar Lumens – sta già aspettando!",
    "action_error": "Nessuna coppia di chiavi disponibile – crea prima un account testnet.",
    "after_action": "Perfetto! Lena ha ricevuto il pagamento. Hai appena reso possibile la prima esperienza cripto di qualcuno – questo è Stellar!",
    "quiz_wrong": "Sbagliato",
    "quiz_retry": "Riprova",
    "quiz_correct_cta": "Continua",
    "quiz1_q": "Cos'è una Chiave pubblica su Stellar?",
    "quiz1_a1": "Una password che deve rimanere segreta",
    "quiz1_a1_hint": "Non proprio – questa è la funzione della Chiave segreta.",
    "quiz1_a2": "L'indirizzo pubblico del tuo conto, come un IBAN",
    "quiz1_a2_hint": "Esatto! Puoi condividere liberamente la Chiave pubblica – è il tuo indirizzo di ricezione.",
    "quiz1_a3": "Un token speciale per le transazioni",
    "quiz1_a3_hint": "No – XLM è il token, la Chiave pubblica è il tuo indirizzo.",
    "quiz1_explanation": "La Chiave pubblica è il tuo indirizzo pubblico – paragonabile a un numero di conto o IBAN. Puoi condividerla liberamente. La Chiave segreta, invece, deve rimanere segreta.",
    "quiz1_hint2": "Suggerimento: Pensa al classico sistema bancario – cosa condividi per ricevere denaro?",
    "quiz2_q": "Cos'è una linea di fiducia?",
    "quiz2_a1": "Un tipo speciale di pagamento",
    "quiz2_a1_hint": "No – una linea di fiducia non è una transazione di pagamento.",
    "quiz2_a2": "Un'autorizzazione a detenere un token specifico",
    "quiz2_a2_hint": "Esatto! Senza linea di fiducia il tuo conto non può ricevere né detenere quel token.",
    "quiz2_a3": "Un contratto tra due portafogli",
    "quiz2_a3_hint": "No – una linea di fiducia è un'autorizzazione unilaterale del tuo conto per un token.",
    "quiz2_explanation": "Una linea di fiducia è un'autorizzazione esplicita che devi impostare per ogni token (tranne XLM). Solo allora il tuo conto può detenere e ricevere quel token.",
    "quiz2_hint2": "Suggerimento: 'Trust' = fiducia – ti fidi dell'emittente del token.",
    "quiz3_q": "Quanto dura normalmente una transazione su Stellar?",
    "quiz3_a1": "10–60 minuti, come Bitcoin",
    "quiz3_a1_hint": "Quella è la velocità di Bitcoin – Stellar è molto più veloce.",
    "quiz3_a2": "1–2 giorni, come un bonifico SEPA",
    "quiz3_a2_hint": "No – Stellar è molto più veloce delle banche tradizionali.",
    "quiz3_a3": "3–5 secondi",
    "quiz3_a3_hint": "Corretto! Stellar conferma le transazioni in circa 3–5 secondi – un grande vantaggio rispetto a Bitcoin o alle banche.",
    "quiz3_explanation": "Stellar utilizza lo Stellar Consensus Protocol (SCP), che finalizza le transazioni in 3–5 secondi. Questo lo rende ideale per i pagamenti quotidiani.",
    "quiz3_hint2": "Suggerimento: Stellar è stato progettato specificamente per pagamenti veloci – pensa al banking in tempo reale.",
    "quiz4_q": "Cosa fa un Anchor su Stellar?",
    "quiz4_a1": "Protegge la rete come un validatore",
    "quiz4_a1_hint": "No – questo è il compito dei validatori nella rete.",
    "quiz4_a2": "Crea nuovi account Stellar per gli utenti",
    "quiz4_a2_hint": "No – chiunque può creare account, non è la funzione dell'Anchor.",
    "quiz4_a3": "Collega le valute fiat (es. EUR) alla blockchain Stellar",
    "quiz4_a3_hint": "Esatto! Gli Anchor sono ponti tra il mondo finanziario reale e Stellar – emettono token come EURC.",
    "quiz4_explanation": "Un Anchor è un'istituzione finanziaria regolamentata che converte le valute fiat (come EUR o USD) in token Stellar. Così le valute reali possono essere utilizzate sulla blockchain.",
    "quiz4_hint2": "Suggerimento: Pensa a un 'ponte' tra il banking tradizionale e la blockchain.",
    "quiz5_q": "Qualcuno ti contatta affermando di essere del 'Supporto Stellar'. Ha bisogno della tua Chiave segreta per risolvere un 'problema di sicurezza'. Cosa fai?",
    "quiz5_a1": "Inviare la chiave, perché il personale di supporto è affidabile",
    "quiz5_a1_hint": "Sarebbe un errore – nessun supporto legittimo chiede la Chiave segreta.",
    "quiz5_a2": "Ignorare e bloccare immediatamente il contatto – è una truffa",
    "quiz5_a2_hint": "Corretto! Non esiste un 'Supporto Stellar' che avrebbe bisogno della tua Chiave segreta. È un classico tentativo di phishing.",
    "quiz5_a3": "Inviare la chiave in un messaggio cifrato",
    "quiz5_a3_hint": "Non importa quanto sia sicura la trasmissione – non condividi mai la Chiave segreta.",
    "quiz5_explanation": "Nessun servizio legittimo, nessuna autorità né supporto chiede mai la tua Chiave segreta. Chi la conosce controlla completamente il tuo conto. Bloccare e segnalare è l'unica risposta giusta.",
    "quiz5_hint2": "Suggerimento: Immagina qualcuno che ti chiede il PIN del tuo home banking per telefono.",
    "cert_title": "Certificato di base",
    "cert_tagline": "Stellar Account Manager – Corso completato!",
    "cert_public_key_label": "Indirizzo Testnet",
    "cert_date_label": "Completato il",
    "cert_chapters_label": "Capitoli completati",
    "cert_xp_label": "XP totale",
    "cert_print_btn": "Stampa certificato",
    "cert_home_btn": "Vai alla home",
    "learning1": "Stellar consente pagamenti globali in pochi secondi per pochi centesimi",
    "learning2": "Le linee di fiducia sono la base per i token su Stellar",
    "learning3": "Gli Anchor collegano le valute fiat alla blockchain",
    "learning4": "Non condividere mai la tua Chiave segreta – nemmeno con il 'supporto'",
    "learning5": "Stellar è usato in tutto il mondo – dalle rimesse alla DeFi"
  },
  "hud": {
    "chapter_short": "Cap."
  },
  "action": {
    "already_done": "Già completato",
    "continue_with_existing": "Continua",
    "redo": "Esegui di nuovo?",
    "redo_keypair_warning": "Attenzione: una nuova coppia di chiavi sovrascriverà quella vecchia. Il tuo account Testnet attuale andrà perso.",
    "redo_cancel": "Annulla",
    "redo_confirm": "Crea comunque"
  },
  "payment": {
    "title": "Invia pagamento",
    "from_label": "Da (il tuo account)",
    "to_label": "A (destinatario)",
    "to_placeholder": "G... (inserisci la chiave pubblica)",
    "amount_label": "Importo (XLM)",
    "memo_label": "Memo (opzionale)",
    "memo_hint": "Suggerimento: gli exchange spesso richiedono un Memo per l'identificazione",
    "error_secret_key": "Questa è una chiave segreta! Una chiave segreta non è mai un indirizzo destinatario. Non inserire mai la tua chiave segreta da nessuna parte.",
    "error_invalid_key": "Non è una chiave pubblica Stellar valida. Le chiavi pubbliche iniziano con 'G' e sono lunghe 56 caratteri.",
    "error_own_key": "Questa è la tua chiave pubblica. Non puoi inviare un pagamento a te stesso.",
    "cancel": "Annulla",
    "send": "Invia"
  },
  "chapter6": {
    "title": "Il Contabile",
    "section_intro": "Il Caos di Marco",
    "section_explain": "Cos'è un Account Muxed?",
    "section_payroll": "Contabilità Stipendi",
    "section_usecases": "Altre Applicazioni",
    "section_decision": "Come lo organizzi?",
    "section_action": "Invia Pagamento Muxed",
    "section_quiz": "Mini Quiz",
    "intro_narrator1": "La caffetteria di Marco è in crescita. Ogni giorno arrivano decine di pagamenti sul suo conto Stellar – ma chi ha pagato cosa e quando?",
    "intro_narrator2": "La sua contabile Sofia arriva con una pila di domande senza risposta...",
    "marco_chaos1": "Non riesco più a stare al passo! Ogni giorno arrivano nuovi pagamenti, ma sembrano tutti identici sulla blockchain.",
    "marco_chaos2": "Come dovrei sapere se è di Anna, Ben o di un cliente?",
    "sofia_frustrated1": "Marco, così non posso fare una contabilità stipendi corretta. Ogni pagamento ai dipendenti è identico sulla blockchain!",
    "sofia_frustrated2": "Ho bisogno di un modo affidabile per identificare ogni pagamento in modo univoco – senza dover chiedere ogni volta.",
    "lumio_fix": "So esattamente come risolvere questo problema. Avete sentito parlare degli Account Muxed?",
    "explain_label": "Concetto",
    "explain_title": "Account Muxed Spiegati",
    "explain_desc": "Un Account Muxed non è un portafoglio separato – è lo stesso indirizzo Stellar, ma con un ID virtuale allegato.",
    "explain_base_label": "Indirizzo Base di Marco (G…)",
    "explain_muxed_label": "Indirizzi M virtuali",
    "explain_anna": "Barista",
    "explain_ben": "Torrefattore",
    "explain_clara": "Contabilità",
    "explain_flow_desc": "Tutti i pagamenti arrivano allo stesso indirizzo G – l'ID incorporato rivela chi ha ricevuto cosa.",
    "explain_memo_vs_title": "Account Muxed vs. Memo",
    "explain_memo_desc": "Campo di testo libero, non standardizzato. Può essere dimenticato o inserito in modo errato.",
    "explain_muxed_desc": "ID numerico strutturato direttamente nell'indirizzo. Affidabile per la contabilità automatizzata.",
    "explain_cta": "Capito! Al caso d'uso →",
    "payroll_label": "Caso d'uso",
    "payroll_title": "Stipendi con Account Muxed",
    "payroll_step1": "L'azienda ha UN solo conto Stellar – più economico e facile da gestire.",
    "payroll_step2": "A ogni dipendente viene assegnato un ID Muxed univoco dall'azienda.",
    "payroll_step3": "Ogni mese, il software per le buste paga invia lo stipendio all'indirizzo M corrispondente.",
    "payroll_step4": "Il software di contabilità di Sofia legge l'ID Muxed e registra automaticamente al dipendente corretto.",
    "payroll_step5": "Nessuna riconciliazione manuale, nessuna supposizione, nessun errore.",
    "payroll_note": "Il dipendente non ha bisogno di sapere nulla degli Account Muxed – l'azienda gestisce questo internamente.",
    "payroll_cta": "Ottimo! Altri esempi →",
    "usecases_label": "Pratica",
    "usecases_title": "Altri Casi d'Uso",
    "exchange_title": "Exchange di Cripto",
    "exchange_text": "Un exchange usa un singolo indirizzo Stellar per tutti i clienti. Ogni cliente riceve un ID Muxed come indirizzo di deposito – nessun memo necessario, nessun deposito perso.",
    "shop_title": "Negozi Online",
    "shop_text": "Ogni ordine riceve un ID Muxed univoco. Il pagamento viene automaticamente abbinato all'ordine corretto – senza elaborazione manuale successiva.",
    "usecases_cta": "Capito! Ora tocca a me →",
    "decision_question": "Come dovrebbe Marco organizzare la sua contabilità stipendi?",
    "decision_a1": "Creare un conto Stellar separato per ogni dipendente",
    "decision_a2": "Usare il campo memo con i nomi dei dipendenti",
    "decision_a3": "Account Muxed con un ID univoco per dipendente",
    "wrong_a1_title": "Non ideale",
    "wrong_a1_text": "I conti separati significano più commissioni, più chiavi segrete da gestire e un rischio di sicurezza maggiore. Non scala bene per un'azienda in crescita.",
    "wrong_a1_hint2": "Suggerimento: Meno conti = meno complessità. Esiste una soluzione che funziona con un singolo indirizzo?",
    "wrong_a2_title": "Non abbastanza affidabile",
    "wrong_a2_text": "I memo non sono standardizzati e possono essere dimenticati o inseriti in modo errato. La contabilità automatizzata ha bisogno di un metodo strutturato e affidabile.",
    "wrong_a2_hint2": "Suggerimento: Quale metodo codifica l'ID direttamente nell'indirizzo – senza un campo di testo extra?",
    "correct_sofia": "Finalmente! È esattamente quello di cui avevo bisogno. Con gli Account Muxed posso automatizzare completamente la contabilità stipendi!",
    "retry_btn": "Riprova",
    "action_label": "Invia Pagamento Muxed",
    "action_desc": "Invia 1 XLM a un indirizzo Muxed (M-indirizzo) – indirizzo base + ID 42.",
    "action_maddress_label": "Indirizzo M di destinazione",
    "action_success": "Sulla blockchain questo sembra un pagamento normale – ma l'ID 42 è incorporato!",
    "action_error": "Nessuna coppia di chiavi disponibile – crea prima un account testnet.",
    "lumio_after_action": "Vedi? La transazione sulla testnet sembra un normale pagamento XLM – ma l'ID Muxed è codificato nell'indirizzo. Il software di Sofia lo leggerebbe automaticamente.",
    "quiz_wrong": "Sbagliato",
    "quiz_retry": "Riprova",
    "quiz_correct_cta": "Continua",
    "quiz1_q": "Cos'è un Account Muxed su Stellar?",
    "quiz1_a1": "Un portafoglio separato con il proprio saldo",
    "quiz1_a1_hint": "No – un Account Muxed non è un portafoglio indipendente.",
    "quiz1_a2": "Un sotto-indirizzo virtuale con ID numerico, legato a un indirizzo G di base",
    "quiz1_a2_hint": "Esatto! L'indirizzo M punta allo stesso account – solo con un ID aggiuntivo per distinguere.",
    "quiz1_a3": "Un account token speciale per le aziende",
    "quiz1_a3_hint": "No – gli Account Muxed funzionano con XLM e tutti i token.",
    "quiz1_explanation": "Un Account Muxed non è il proprio portafoglio – condivide il saldo, le linee di fiducia e i firmatari con l'account G di base. L'indirizzo M contiene solo un ID numerico aggiuntivo.",
    "quiz1_hint2": "Suggerimento: Pensa a un numero di conto bancario con un numero di riferimento integrato – un conto, molti ID.",
    "quiz2_q": "Perché gli Account Muxed sono migliori dei memo per la contabilità stipendi?",
    "quiz2_a1": "Gli Account Muxed sono più economici dei memo",
    "quiz2_a1_hint": "No – le commissioni di transazione sono le stesse.",
    "quiz2_a2": "I memo sono vietati per i pagamenti aziendali",
    "quiz2_a2_hint": "No – i memo sono consentiti, solo non ideali per l'automazione.",
    "quiz2_a3": "Gli ID Muxed sono strutturati e affidabili; i memo possono mancare o essere sbagliati",
    "quiz2_a3_hint": "Esatto! L'ID è codificato direttamente nell'indirizzo – non può essere dimenticato o inserito in modo errato.",
    "quiz2_explanation": "I memo sono campi di testo libero e non standardizzati. Possono essere dimenticati, inseriti in modo errato o intenzionalmente omessi. Gli ID Muxed fanno parte dell'indirizzo stesso – strutturati e affidabilmente leggibili dalla macchina.",
    "quiz2_hint2": "Suggerimento: Cosa succede se un dipendente lascia semplicemente il campo memo vuoto quando effettua un trasferimento?",
    "quiz3_q": "Un dipendente ha bisogno del proprio portafoglio Stellar per ricevere un pagamento Muxed?",
    "quiz3_a1": "No – il dipendente ha il proprio portafoglio; l'ID Muxed è gestito internamente dall'azienda",
    "quiz3_a1_hint": "Corretto! L'ID Muxed è una funzione contabile interna – il dipendente riceve sul proprio indirizzo normale.",
    "quiz3_a2": "Sì – ogni dipendente ha bisogno di un M-indirizzo come proprio portafoglio",
    "quiz3_a2_hint": "No – i M-indirizzi non sono portafogli indipendenti.",
    "quiz3_a3": "No – i dipendenti non hanno affatto bisogno di un account Stellar",
    "quiz3_a3_hint": "Non proprio – i dipendenti possono avere i propri account Stellar; l'ID Muxed è rilevante solo per il lato contabile.",
    "quiz3_explanation": "Gli ID Muxed sono uno strumento di organizzazione interna dell'azienda. Il dipendente ha il proprio account Stellar. L'indirizzo M aiuta il software di Sofia ad assegnare internamente i pagamenti in entrata.",
    "quiz3_hint2": "Suggerimento: Gli Account Muxed sono progettati dalla prospettiva dell'azienda – non del destinatario.",
    "learning1": "Un Account Muxed è un sotto-indirizzo virtuale (M-indirizzo) su un indirizzo Stellar di base",
    "learning2": "Gli Account Muxed semplificano gli stipendi: un indirizzo, molti ID – completamente automatizzabile",
    "learning3": "Exchange e negozi online usano Account Muxed per l'assegnazione univoca dei clienti",
    "learning4": "I memo possono essere dimenticati – gli ID Muxed sono codificati nell'indirizzo e affidabili"
  },
  "chapter7": {
    "title": "La Cassaforte",
    "section_intro": "Scena 1 – Il Problema del Controllo",
    "section_explain": "Cos'è la Firma Multipla?",
    "section_family": "Esempio: Risparmio Familiare",
    "section_decision1": "Scena di Decisione 1",
    "section_company": "Esempio: Cassaforte Aziendale",
    "section_decision2": "Scena di Decisione 2",
    "section_usecases": "Quando serve il Multisig?",
    "section_quiz": "Mini Quiz",
    "section_cert": "Certificato Avanzato",
    "intro_narrator1": "Marco ora ha una partner commerciale: Rosa. Insieme gestiscono un'azienda in crescita. Ma c'è un problema...",
    "intro_narrator2": "Quando solo una persona controlla il portafoglio aziendale, le cose possono andare storte – per perdita di fiducia o chiavi smarrite.",
    "marco_problem1": "Rosa, sono preoccupato. Cosa succede ai nostri soldi se perdo la mia chiave segreta?",
    "marco_problem2": "O cosa succede se non puoi mai fidarti davvero di me perché controllo tutto da solo?",
    "rosa_concern": "È esattamente quello che preoccupa anche me, Marco. Abbiamo bisogno di una soluzione in cui siamo entrambi al sicuro.",
    "lumio_solution": "So esattamente di cosa avete bisogno – una cassaforte che potete aprire solo insieme. Si chiama Firma Multipla!",
    "explain_label": "Basi",
    "explain_title": "Cos'è la Firma Multipla?",
    "explain_desc": "Normalmente una sola chiave controlla un portafoglio. Con il Multisig definisci quanti dei possibili firmatari devono approvare una transazione.",
    "explain_1of1_label": "Normale: 1-su-1",
    "explain_1of1_desc": "Una chiave controlla tutto. Chi ha questa chiave ha accesso completo – nessuna protezione da uso improprio o perdita.",
    "explain_multisig_label": "Multisig: N-su-M",
    "explain_multisig_desc": "Più firmatari, soglia definita. Solo quando ci sono abbastanza firme la transazione viene eseguita.",
    "explain_threshold_label": "Cos'è una Soglia?",
    "explain_threshold_desc": "La soglia è il numero minimo di firme necessarie per autorizzare una transazione. Con 2-su-3, qualsiasi 2 dei 3 firmatari devono firmare.",
    "explain_vault_desc": "Immagina una cassaforte con più serrature – tutte le chiavi necessarie devono essere girate simultaneamente.",
    "explain_cta": "Mostrami un esempio →",
    "family_label": "Esempio 1",
    "family_title": "Risparmio Familiare (2-su-2)",
    "family_desc": "Elena e David creano un portafoglio di risparmio condiviso. Entrambi devono firmare ogni transazione – massima sicurezza, zero acquisti impulsivi.",
    "family_scenario_title": "Scenario",
    "family_scenario_text": "David vuole comprare una nuova macchina del caffè. Invia una richiesta di transazione – Elena deve anche firmare prima che il denaro venga addebitato. Entrambi hanno pari controllo.",
    "family_risk": "Rischio: Se un genitore perde la propria chiave segreta, il portafoglio è permanentemente bloccato. 2-su-2 significa tolleranza zero agli errori – entrambe le firme sono sempre richieste.",
    "family_cta": "Continua all'esempio aziendale →",
    "d1_question": "Elena ha perso la sua chiave segreta. David ha ancora la sua. Cosa succede al portafoglio 2-su-2?",
    "d1_a1": "David può accedere ai fondi da solo poiché ha ancora la sua chiave",
    "d1_a2": "Possono reimpostare il portafoglio con il loro indirizzo e-mail",
    "d1_a3": "Il portafoglio è permanentemente inaccessibile – entrambe le firme sono sempre richieste",
    "d1_wrong_a1_title": "Sbagliato – 2-su-2 non conosce eccezioni",
    "d1_wrong_a1_text": "Con un portafoglio multisig 2-su-2 ENTRAMBE le firme sono SEMPRE richieste. Anche se David ha la sua chiave – senza la chiave di Elena nessuna transazione è possibile. Questa è la forza e allo stesso tempo il rischio.",
    "d1_wrong_a1_hint2": "Suggerimento: 2-su-2 significa che la soglia è sempre 2 – nessuna eccezione, nessun aggiramento.",
    "d1_wrong_a2_title": "Sbagliato – la blockchain non ha reimpostazione della password",
    "d1_wrong_a2_text": "La blockchain non ha recupero via e-mail, assistenza né reimpostazione della password. La chiave È l'accesso – senza di essa non c'è modo di accedere al portafoglio.",
    "d1_wrong_a2_hint2": "Suggerimento: Sulla blockchain non c'è un'autorità centrale che possa reimpostare le chiavi – è intenzionale, ma comporta responsabilità.",
    "d1_correct_lumio": "Esatto! Questo è il rischio fondamentale del 2-su-2: se una chiave viene persa, i fondi sono irraggiungibili per sempre. Ecco perché l'archiviazione sicura è così importante.",
    "company_label": "Esempio 2",
    "company_title": "Cassaforte Aziendale (2-su-3)",
    "company_desc": "Marco, Rosa e l'avvocato Dr. Weber sono tre firmatari. Qualsiasi due devono firmare – sicurezza con tolleranza agli errori.",
    "company_scenario_title": "Scenario",
    "company_scenario_text": "Marco vuole pagare un fornitore → Rosa co-firma → fatto. Il Dr. Weber non è necessario. Se Marco è in vacanza, Rosa e il Dr. Weber possono agire insieme. L'azienda rimane operativa.",
    "company_risk": "2-su-3 bilancia sicurezza e tolleranza agli errori: anche se un firmatario perde la propria chiave, gli altri due possono ancora agire. Solo quando si perdono due chiavi la soglia diventa irraggiungibile.",
    "company_cta": "Scegli ora →",
    "d2_question": "Marco, Rosa e il Dr. Weber gestiscono un'azienda con 3 soci. Quale configurazione multisig è corretta: è richiesta la maggioranza, funziona anche se un socio non è raggiungibile?",
    "d2_a1": "1-su-3 – ogni singolo socio può eseguire transazioni da solo",
    "d2_a2": "3-su-3 – tutti e tre i soci devono sempre firmare",
    "d2_a3": "2-su-3 – qualsiasi due dei tre soci devono firmare",
    "d2_wrong_a1_title": "Sbagliato – 1-su-3 non offre protezione",
    "d2_wrong_a1_text": "1-su-3 significa che ogni singolo firmatario potrebbe spostare tutti i fondi da solo. Questo non offre protezione da frode, furto o una chiave compromessa – più pericoloso di un normale portafoglio a chiave singola.",
    "d2_wrong_a1_hint2": "Suggerimento: Per i fondi aziendali la soglia deve essere abbastanza alta da impedire a una singola persona di agire da sola.",
    "d2_wrong_a2_title": "Sbagliato – 3-su-3 è troppo inflessibile",
    "d2_wrong_a2_text": "3-su-3 sembra sicuro, ma se un socio è malato, in viaggio o perde la chiave, l'intera azienda è bloccata. Le organizzazioni hanno bisogno di tolleranza agli errori.",
    "d2_wrong_a2_hint2": "Suggerimento: La soluzione è una soglia che richieda una maggioranza ma funzioni comunque quando qualcuno non è raggiungibile.",
    "d2_correct_lumio": "Perfetto! 2-su-3 è la configurazione più comune per le piccole organizzazioni – per una buona ragione: è richiesta la maggioranza, ma con tolleranza agli errori.",
    "usecases_label": "Casi d'Uso",
    "usecases_title": "Quando serve il Multisig?",
    "usecase1_title": "Portafogli Aziendali",
    "usecase1_text": "Più soci o dirigenti – nessuna singola persona può spostare fondi da sola.",
    "usecase2_title": "Risparmio Familiare",
    "usecase2_text": "Entrambi i partner devono essere d'accordo – protegge dagli acquisti impulsivi e dà pari controllo.",
    "usecase3_title": "DAO e Fondi Comunitari",
    "usecase3_text": "Le organizzazioni decentralizzate gestiscono fondi comuni senza un fiduciario centrale.",
    "usecase4_title": "Portafoglio Personale ad Alta Sicurezza",
    "usecase4_text": "Tieni 2 chiavi su dispositivi separati, un partner di fiducia tiene 1 come backup – 2-su-3.",
    "usecase5_title": "Accordi di Deposito a Garanzia",
    "usecase5_text": "I fondi vengono rilasciati solo quando entrambe le parti firmano – nessuna frode possibile.",
    "usecases_cta": "Continua al quiz →",
    "quiz_wrong": "Non proprio",
    "quiz_retry": "Riprova",
    "quiz_correct_cta": "Continua",
    "retry_btn": "Riprova",
    "quiz1_q": "Cosa significa '2-su-3 Multisig'?",
    "quiz1_a1": "Esattamente 2 dei 3 possibili firmatari devono sempre firmare, altrimenti non succede nulla",
    "quiz1_a2": "Qualsiasi 2 dei 3 firmatari devono firmare una transazione affinché venga eseguita",
    "quiz1_a3": "Due transazioni devono essere confermate entro 3 minuti",
    "quiz1_a1_hint": "Quasi! Qualsiasi 2 su 3 possono firmare – non sempre gli stessi due.",
    "quiz1_a2_hint": "Esatto! Qualsiasi 2 dei 3 firmatari sono sufficienti – questo dà flessibilità e sicurezza.",
    "quiz1_a3_hint": "Non è corretto – il Multisig non ha nulla a che fare con i limiti di tempo.",
    "quiz1_explanation": "Con il Multisig 2-su-3, qualsiasi combinazione di 2 dei 3 firmatari può approvare la transazione. Non devono essere sempre gli stessi due – questa è la differenza rispetto alle firme 'fisse'.",
    "quiz1_hint2": "Pensa alla cassaforte aziendale: Marco+Rosa, Rosa+Weber o Marco+Weber – tutte e tre le combinazioni funzionano.",
    "quiz2_q": "Marco, Rosa e il Dr. Weber hanno un portafoglio 2-su-3. Rosa perde la sua chiave. Possono ancora accedere ai fondi?",
    "quiz2_a1": "No – poiché un firmatario ha perso la propria chiave, il portafoglio è bloccato",
    "quiz2_a2": "Sì – Marco e il Dr. Weber insieme raggiungono la soglia di 2",
    "quiz2_a3": "No – tutti e tre i firmatari sono sempre richiesti",
    "quiz2_a1_hint": "La soglia è 2, non 3 – Marco e Weber possono ancora agire.",
    "quiz2_a2_hint": "Corretto! Questa è esattamente la forza del 2-su-3: tolleranza agli errori quando si perde una chiave.",
    "quiz2_a3_hint": "Con 2-su-3 sono richieste solo 2 firme, non tutte e 3.",
    "quiz2_explanation": "Con 2-su-3 qualsiasi 2 firme sono sufficienti. Se Rosa perde la sua chiave, Marco e il Dr. Weber possono ancora eseguire tutte le transazioni insieme. Questa è la differenza rispetto al 2-su-2.",
    "quiz2_hint2": "Da ricordare: 2-su-3 = una firma persa = ancora operativo. 2-su-2 = una firma persa = permanentemente bloccato.",
    "quiz3_q": "Elena e David hanno un portafoglio 2-su-2. Elena perde la sua chiave. Cosa succede?",
    "quiz3_a1": "Il portafoglio è permanentemente bloccato – entrambe le firme sono sempre richieste",
    "quiz3_a2": "David può accedere ai fondi da solo poiché ha ancora la sua chiave",
    "quiz3_a3": "Possono contattare Stellar per recuperare la chiave",
    "quiz3_a1_hint": "Corretto! 2-su-2 ha tolleranza zero agli errori – entrambe le chiavi sono sempre richieste.",
    "quiz3_a2_hint": "Con 2-su-2 una singola chiave non è sufficiente – la soglia rimane sempre 2.",
    "quiz3_a3_hint": "Stellar è decentralizzato – non c'è un'autorità centrale che possa reimpostare le chiavi.",
    "quiz3_explanation": "Con 2-su-2 entrambe le firme sono sempre richieste. Se una chiave viene persa, non c'è modo di eseguire una transazione – il portafoglio è permanentemente bloccato. Ecco perché la conservazione sicura delle chiavi è così critica.",
    "quiz3_hint2": "Da ricordare: 2-su-2 = massima sicurezza, tolleranza zero agli errori. Ogni chiave deve essere conservata in modo sicuro – in più luoghi fisici.",
    "quiz4_q": "Perché il Multisig 1-su-3 è rischioso per un fondo aziendale?",
    "quiz4_a1": "Perché la configurazione è troppo complicata e confonde i dipendenti",
    "quiz4_a2": "Perché Stellar supporta solo soglie 2-su-3 o superiori",
    "quiz4_a3": "Perché ogni singolo firmatario può spostare tutti i fondi da solo – nessuna protezione dalle frodi",
    "quiz4_a1_hint": "Non è questo il motivo – la soglia rende la configurazione rischiosa.",
    "quiz4_a2_hint": "Stellar supporta soglie flessibili – non è questo il problema.",
    "quiz4_a3_hint": "Esatto! 1-su-3 significa nessun vero controllo di maggioranza – chiunque può agire da solo.",
    "quiz4_explanation": "Con 1-su-3 ognuno dei tre firmatari può spostare tutti i fondi da solo. Questo è peggio di un normale portafoglio a chiave singola, perché tre persone diverse sono un potenziale bersaglio di attacco.",
    "quiz4_hint2": "Pensa a un fondo aziendale: non vuoi che un singolo dipendente possa avviare trasferimenti da solo.",
    "cert_title": "Certificato Avanzato",
    "cert_tagline": "Ora sei un professionista di Stellar!",
    "cert_public_key_label": "Chiave Pubblica",
    "cert_date_label": "Data di Completamento",
    "cert_chapters_label": "Capitoli Completati",
    "cert_xp_label": "XP totali",
    "cert_badge1": "Certificato Base",
    "cert_badge2": "Certificato Avanzato",
    "cert_print_btn": "Salva Certificato",
    "cert_home_btn": "Vai alla Home",
    "learning1": "La Firma Multipla richiede più firme per eseguire una transazione",
    "learning2": "2-su-3 offre tolleranza agli errori: una chiave persa non blocca il portafoglio",
    "learning3": "Il Multisig è adatto ad aziende, famiglie, DAO e portafogli ad alta sicurezza",
    "learning4": "2-su-2 ha tolleranza zero agli errori – se una chiave viene persa, i fondi sono irraggiungibili per sempre"
  }
}
