{
  "nav": {
    "title": "Modalità Storia",
    "chapter_select": "Scegli capitolo",
    "chapter_select_title": "Selezione capitolo",
    "chapter_select_sub": "Scegli un capitolo da giocare",
    "to_home": "Home",
    "to_chapters": "Capitoli",
    "step_back": "Indietro",
    "confirm_leave": "Il tuo progresso in questo capitolo verrà salvato.",
    "confirm_leave_cancel": "Annulla",
    "confirm_leave_ok": "Esci",
    "chapter_locked": "Bloccato",
    "chapter_completed": "Completato",
    "chapter_current": "Continua",
    "chapter_start": "Inizia",
    "home_short": "Home",
    "chapters_short": "Capitoli",
    "back_short": "Indietro",
    "back_to_home": "Torna alla home"
  },
  "chapter1": {
    "introNarrator": "La blockchain Stellar – una rete digitale che muove valore in tutto il mondo. E proprio al suo interno cade una piccola stella...",
    "introDialog1": "Ciao! Sono Lumio e sono appena atterrato sulla blockchain Stellar! 🌟",
    "introDialog2": "Ma non ho ancora un account qui... puoi aiutarmi a crearne uno?",
    "keypairTitle": "Passo 1 – Cos'è una Coppia di Chiavi?",
    "keypairNarrator": "Ogni account su Stellar è composto da due chiavi: la Chiave Pubblica (il tuo indirizzo) e la Chiave Segreta (la tua password). Solo chi conosce la Chiave Segreta può inviare denaro.",
    "choicePublicKeyLabel": "Condivido la Chiave Pubblica con altri in modo che possano inviarmi XLM.",
    "choicePublicKeyHint": "Esattamente! La Chiave Pubblica è come un numero di conto bancario – puoi condividerla pubblicamente. ✓",
    "choiceSecretShareLabel": "Do la mia Chiave Segreta a qualcuno di cui mi fido.",
    "choiceSecretShareHint": "Attenzione! NESSUNO deve conoscere la Chiave Segreta – nemmeno Stellar o Lumio. Dà accesso completo al tuo account.",
    "choiceSameLabel": "Entrambe le chiavi sono in realtà la stessa cosa.",
    "choiceSameHint": "Non è corretto. La Chiave Pubblica e la Chiave Segreta formano una coppia, ma hanno ruoli completamente diversi.",
    "createTitle": "Passo 2 – La tua prima Coppia di Chiavi",
    "createDialog": "Ottimo! Ora creiamo il nostro account di test condiviso. Premi il pulsante – io tengo d'occhio!",
    "createActionLabel": "Genera Coppia di Chiavi",
    "createActionDesc": "Crea una Chiave Pubblica e una Chiave Segreta casuali per la Testnet Stellar. Solo per scopi di pratica!",
    "warningDialog1": "Wow, ora abbiamo una coppia di chiavi! Annota la Chiave Segreta da qualche parte – ma non mostrarla mai a nessuno!",
    "warningDialog2": "Sulla rete reale ti consiglierei di scriverla su carta e conservarla in un luogo sicuro.",
    "activateTitle": "Passo 3 – Attivare l'Account",
    "activateNarrator": "Un nuovo account Stellar deve prima essere attivato – ha bisogno di almeno 1 XLM come riserva. Sulla Testnet, il 'Friendbot' ci dà XLM di test gratuiti.",
    "friendbotLabel": "Richiedi Friendbot",
    "friendbotDesc": "Invia una richiesta al Friendbot di Stellar, che attiva il nostro account di test con 10.000 XLM di test.",
    "friendbotError": "Nessuna coppia di chiavi trovata – generarne una prima.",
    "outroDialog1": "Abbiamo un vero account sulla Testnet Stellar! Posso già vedere gli XLM nella blockchain...",
    "outroDialog2": "Hai imparato velocemente! Nel prossimo capitolo invieremo XLM insieme.",
    "summaryTitle": "L'Arrivo",
    "summaryLearning1": "Ogni account Stellar è composto da una Chiave Pubblica (indirizzo) e una Chiave Segreta (password)",
    "summaryLearning2": "La Chiave Segreta non deve mai essere condivisa",
    "summaryLearning3": "I nuovi account hanno bisogno di almeno 1 XLM di saldo minimo (riserva base)",
    "summaryLearning4": "Il Friendbot attiva gli account Testnet gratuitamente",
    "keypair_warning": "Annota la tua Chiave Segreta ora! Non può essere recuperata. Chiunque la conosca ha pieno accesso al tuo account.",
    "keypair_confirm": "Ho annotato la mia Chiave Segreta e capisco che non può essere recuperata.",
    "keypair_public_label": "La tua Chiave Pubblica (Indirizzo)",
    "keypair_secret_label": "La tua Chiave Segreta – TIENILA SEGRETA!",
    "keypair_copy": "Copia",
    "keypair_copied": "Copiato!",
    "keypair_continue": "Ho annotato tutto – continua",
    "explorer_title": "Il tuo account su Stellar Explorer",
    "explorer_desc": "In Stellar Explorer puoi visualizzare pubblicamente il tuo account e tutte le transazioni – come un estratto conto, ma visibile a tutti.",
    "explorer_hint": "Copia l'indirizzo e aprilo manualmente nel tuo browser.",
    "explorer_url_label": "URL Explorer",
    "explorer_copy_url": "Copia URL",
    "explorer_open": "Visualizza nell'Explorer",
    "explorer_confirm_title": "Link esterno",
    "explorer_confirm_text": "Sarai reindirizzato a {{explorer}}. Si aprirà una nuova scheda.",
    "explorer_confirm_cancel": "Annulla",
    "explorer_confirm_ok": "Apri",
    "summaryLearning4a": "Sulla Testnet, il Friendbot attiva gli account gratuitamente con XLM di test",
    "summaryLearning4b": "Sulla rete reale (Mainnet), un altro account deve inviare almeno 1 XLM per attivare il tuo account – il Friendbot non esiste lì!",
    "title": "Crea account",
    "explorer_after_fund": "Dopo l'attivazione dell'account potrai visualizzarlo nell'Explorer",
    "q1_question": "Cosa fai con la tua [[Public Key|publicKey]]?"
  },
  "chapter2": {
    "title": "La prima transazione di Lumio",
    "section_tx": "Passo 1 – Cos'è una transazione?",
    "section_memo": "Passo 2 – Il campo Memo",
    "section_action": "Passo 3 – Invia pagamento",
    "narrator_intro": "Lumio ora ha un account con XLM di test. Ma avere soldi non basta – bisogna anche poterli inviare. Come funziona su Stellar?",
    "lumio_1a": "Voglio inviare 10 XLM al mio amico Cosmo! Ma come funziona?",
    "lumio_1b": "Ho sentito che esiste qualcosa chiamato transazione... cos'è esattamente?",
    "narrator_tx": "Una transazione su Stellar è un'istruzione alla rete: invia X XLM dal conto A al conto B. La rete verifica il saldo, deduce una piccola commissione e scrive tutto nel ledger.",
    "choice1_a": "Paga i nodi della rete e previene le transazioni spam.",
    "choice1_b": "Va direttamente alla Stellar Development Foundation come profitto.",
    "choice1_c": "È opzionale – si può omettere.",
    "choice1_a_hint": "Esattamente! La commissione base è molto piccola (0.00001 XLM) ma importante per la sicurezza della rete.",
    "choice1_b_hint": "Sbagliato – le commissioni vengono bruciate, non raccolte.",
    "choice1_c_hint": "Sbagliato – senza commissione la transazione verrà rifiutata.",
    "lumio_2": "E cos'è questo campo Memo che vedo in alcuni portafogli?",
    "narrator_memo": "Il campo Memo è un commento opzionale sulla transazione – massimo 28 caratteri. Gli exchange lo usano per identificare il mittente. Senza il Memo corretto i tuoi fondi possono andare persi!",
    "choice2_a": "Sempre – senza Memo la transazione verrà rifiutata.",
    "choice2_b": "Quando invio a un exchange che richiede un Memo.",
    "choice2_c": "Mai – il campo Memo è obsoleto e non viene più utilizzato.",
    "choice2_a_hint": "Non sempre – tra portafogli normali il Memo è opzionale.",
    "choice2_b_hint": "Corretto! Negli exchange il Memo identifica il tuo account.",
    "choice2_c_hint": "Sbagliato – il Memo è attivo ed essenziale per i depositi negli exchange.",
    "lumio_3": "Ok, credo di aver capito! Proviamo una vera transazione!",
    "action_label": "Invia 10 XLM a Cosmo",
    "action_desc": "Invia 10 XLM di test all'account Testnet di Cosmo con Memo 'Hallo Cosmo'. Dopo vedrai l'hash della transazione sulla blockchain.",
    "error_no_keypair": "Nessuna coppia di chiavi trovata – completare prima il Capitolo 1.",
    "lumio_4a": "Lo vedo! La transazione è sulla blockchain! L'hash della transazione è come un numero di ricevuta – chiunque può cercare la transazione con esso.",
    "lumio_4b": "In Stellar Explorer puoi visualizzare pubblicamente qualsiasi transazione usando l'hash.",
    "narrator_hash": "L'hash della transazione è un ID univoco per ogni transazione. Dimostra in modo inconfutabile che la transazione è avvenuta.",
    "learning_1": "Una transazione invia XLM da un account a un altro",
    "learning_2": "La commissione base (0.00001 XLM) paga la rete e previene lo spam",
    "learning_3": "Il campo Memo è essenziale per i depositi negli exchange",
    "learning_4": "Ogni transazione ha un hash univoco come prova",
    "q1_question": "A cosa serve la [[Base Fee|base_fee]] in una transazione Stellar?",
    "q2_question": "Quando hai bisogno del campo [[Memo|memo]]?",
    "preset_cosmo": "Cosmo (Testnet)"
  },
  "ui": {
    "tap_to_continue": "Tocca per continuare",
    "testnet_badge": "Testnet – nessun token reale",
    "retry_hint": "Riprova!",
    "learn_more": "Scopri di più",
    "glossary_title": "Glossario",
    "glossary_not_found": "Termine non trovato.",
    "glossary_hint": "Puoi saperne di più nel glossario.",
    "continue": "Continua",
    "tx_success": "Transazione riuscita!",
    "tx_hash_label": "Hash transazione",
    "open_in_explorer": "Visualizza in Explorer ↗",
    "hash_copied": "Copiato!",
    "copy_hash": "Copia hash",
    "explorer_confirm_title": "Link esterno",
    "explorer_confirm_text": "Si aprirà una nuova scheda.",
    "explorer_confirm_cancel": "Annulla",
    "explorer_confirm_ok": "Apri"
  },
  "placeholder": {
    "chapter_label": "Capitolo",
    "wip_title": "In costruzione",
    "wip_text": "Questo capitolo è ancora in fase di costruzione. Lumio ci sta lavorando duro – torna presto!",
    "back_to_start": "Torna al Capitolo 1",
    "to_chapter_select": "Vai alla selezione capitoli",
    "wip_hint": "Anche il capitolo {{next}} è ancora in lavorazione – ma puoi già darci un'occhiata.",
    "next_chapter": "Continua al capitolo {{n}} →"
  },
  "chapter3": {
    "title": "Il Mercante"
  },
  "chapter4": {
    "title": "Il Cattivo"
  },
  "chapter5": {
    "title": "La Missione di Lumio"
  },
  "hud": {
    "chapter_short": "Cap."
  },
  "action": {
    "already_done": "Già completato",
    "continue_with_existing": "Continua",
    "redo": "Esegui di nuovo?",
    "redo_keypair_warning": "Attenzione: una nuova coppia di chiavi sovrascriverà quella vecchia. Il tuo account Testnet attuale andrà perso.",
    "redo_cancel": "Annulla",
    "redo_confirm": "Crea comunque"
  },
  "payment": {
    "title": "Invia pagamento",
    "from_label": "Da (il tuo account)",
    "to_label": "A (destinatario)",
    "to_placeholder": "G... (inserisci la chiave pubblica)",
    "amount_label": "Importo (XLM)",
    "memo_label": "Memo (opzionale)",
    "memo_hint": "Suggerimento: gli exchange spesso richiedono un Memo per l'identificazione",
    "error_secret_key": "Questa è una chiave segreta! Una chiave segreta non è mai un indirizzo destinatario. Non inserire mai la tua chiave segreta da nessuna parte.",
    "error_invalid_key": "Non è una chiave pubblica Stellar valida. Le chiavi pubbliche iniziano con 'G' e sono lunghe 56 caratteri.",
    "error_own_key": "Questa è la tua chiave pubblica. Non puoi inviare un pagamento a te stesso.",
    "cancel": "Annulla",
    "send": "Invia"
  }
}