{
  "title": "Créer un compte + multisignature",
  "menu": "Créer un compte + Multisignature",
  "menuHint": "Créez un nouveau compte et configurez éventuellement la signature multiple.",
  "hint": "Créez un nouveau compte, activez-le, et configurez éventuellement la signature multiple.",
  "generateKeys": "Générer une clé",
  "enableMultisig": "Activer la multisécurité",
  "signersTitle": "Signataire",
  "signersInfo": "Ajoutez des signataires supplémentaires et définissez des seuils appropriés.",
  "signersCount": "Nombre de signataires",
  "bestPractices": {
    "title": "Meilleures pratiques",
    "text": "Gardez les clés secrètes en sécurité et ne les distribuez pas inutilement."
  },
  "instructions": {
    "public": "Partagez cette clé publique avec d'autres pour les paiements.",
    "secret": "Gardez cette clé secrète en sécurité ; ne la partagez jamais."
  },
  "generateFirst": "Veuillez d'abord générer une paire de clés.",
  "confirmLowBalance": "Le solde de départ {bal} XLM est inférieur à la réserve recommandée {req} XLM (Signataires : {count}). Continuer ?",
  "activated": "Le compte a été activé. Hash : {hash}",
  "activatedTestnet": "Le compte a été activé sur le testnet via Friendbot.",
  "alreadyActive": "Le compte est déjà activé.",
  "createdNoSigners": "Compte créé, multisignature non configurée.",
  "createdAndConfigured": "Compte créé et multisignature configurée. Hash : {hash}",
  "info": {
    "more": "Plus d'informations",
    "keysOnPage": {
      "title": "Clé sur cette page",
      "text": "⚠️ IMPORTANT : Ce site web NE stocke JAMAIS votre clé secrète !\n\nLa clé secrète affichée ici n'existe que dans votre navigateur (lokal im Arbeitsspeicher). Une fois que vous rechargez ou quittez la page, elle est irrémédiablement perdue.\n\nCopiez ou notez immédiatement la clé secrète après sa génération avant de fermer la page.\n\nVérification : Vous pouvez utiliser les outils de développement du navigateur (F12 → Réseau) pour vérifier qu'aucune clé secrète n'est transmise à l'extérieur. Seules les transactions signées sont envoyées, jamais votre clé secrète."
    },
    "title": "Informations importantes",
    "secureKeys": {
      "title": "Clé secrète sécurisée",
      "text": "La clé publique peut être partagée en toute sécurité – c'est comme un numéro de compte.\n\nLa clé secrète donne accès à votre compte. Traitez-la comme un mot de passe :\n• NE LA STOCKEZ JAMAIS dans des services cloud, des emails ou des notes non sécurisées\n• Notez-la sur papier ou utilisez un portefeuille matériel\n• Créez plusieurs sauvegardes et stockez-les dans des lieux sécurisés et distincts\n• Si la clé secrète est perdue, l'accès au compte est définitivement perdu"
    },
    "multisigSection": {
      "title": "Multisig (Mehrfachsignatur)",
      "text": "Avec la multisignature, vous pouvez définir plusieurs signataires pour votre compte. Les transactions nécessitent alors des signatures de plusieurs clés (multisig).\n\nAvantages :\n• Sécurité renforcée (security)\n• Comptes partagés (shared accounts)\n• Récupération d'urgence (emergency recovery)\n\nATTENTION : Testez d'abord la multisignature sur le réseau de test avant de la déployer sur le réseau principal ! Une mauvaise configuration peut entraîner la perte d'accès au compte."
    },
    "diagram": {
      "title": "Expiration de la signature"
    }
  },
  "activateHint": "L'activation est nécessaire pour que le compte existe. Dans le Testnet, via Friendbot ; dans le Mainnet, via \"Créer un compte\" à partir d'un portefeuille existant.",
  "activateNow": "Activez le compte immédiatement.",
  "activateOnly": "Il suffit d'activer",
  "balanceWarning": "Le solde initial est probablement trop bas pour ajouter les {{count}} signataires supplémentaires (réserve minimale : {{req}} XLM)",
  "createButton": "Créer / Configurer un multisig",
  "mainnetActivateNote": "Remarque : Des réserves supplémentaires sont nécessaires pour le Multisig. 1 XLM n'est souvent pas suffisant.",
  "reserve": {
    "base": "Réserve de base par entrée : {{val}} XLM",
    "recommended": "Solde de départ recommandé : {{val}} XLM (inkl. Puffer)",
    "required": "Réserve minimale requise (neu) : {{val}} XLM"
  },
  "signersCountHint": "Vous définissez le nombre minimum de signatures ci-dessous sous \"Signatures requises\" (niedrig/mittel/hoch).",
  "signersCountLimit": "Remarque : Limite du réseau (Stellar) : maximum de 20 signataires supplémentaires.",
  "startingBalance": "Solde de départ (XLM)",
  "keyWarning": {
    "title": "⚠️ Sécurisez la clé maintenant !",
    "text1": "Vous avez généré une nouvelle paire de clés.",
    "text2": "Sécurisez IMMÉDIATEMENT LES DEUX clés avant de continuer :",
    "list1": "Clé publique : L'adresse de votre compte, peut être partagée",
    "list2": "Clé secrète (Geheimschlüssel) : Votre mot de passe – NE JAMAIS partager ou stocker en ligne !",
    "list3": "Si la clé secrète est perdue, l'accès est irrémédiablement perdu.",
    "confirm": "J'ai sécurisé les deux clés."
  },
  "muxedId": "Muxed-ID",
  "muxedInfo": "Avec le Muxed-ID, une M-Adresse (M...) est créée. Elle pointe vers le même compte que l'adresse régulière (G...).",
  "muxedIdInvalid": "L'ID multiplexé doit être un entier compris entre 0 et 18 446 744 073 709 551 615.",
  "muxedAddress": "Adresse multiplexée",
  "muxedActivationInfo": "Les adresses muxed sont des adresses alias. Elles n'ont pas besoin d'être activées séparément."
}