{
  "pageTitle": "Glossaire",
  "pageIntro": "Ici, vous trouverez des termes importants du monde de la blockchain et du réseau Stellar. Tout est expliqué en des mots simples.",
  "searchLabel": "Terme de recherche",
  "searchPlaceholder": "Terme de recherche (z. B. Konto, Account, Muxed)",
  "searchHint": "La recherche trouve des mots et des explications.",
  "noResults": "Pas de correspondance.",
  "groups": {
    "accountsKeys": "Accounts & Keys",
    "multisigSecurity": "Multisig & Account Security",
    "walletsCustody": "Wallets & Custody",
    "tokensAssets": "Token & Assets",
    "transactionsFees": "Transactions & Fees",
    "marketsTrading": "Markets & Trading",
    "networkProtocol": "Network & Protocol",
    "smartContracts": "Contrats intelligents",
    "blockchainBasics": "Principes de base de la blockchain",
    "security": "Security & Fraud",
    "moneyFinance": "Argent & Finance",
    "cryptography": "Cryptographie",
    "defi": "DeFi",
    "onrampOfframp": "Onramp / Offramp"
  },
  "blockchain": {
    "title": "Blockchain",
    "original": "Blockchain",
    "short": "Registre numérique partagé – de nombreux ordinateurs stockent les mêmes entrées.",
    "desc": "Une blockchain est comme un grand livre numérique. De nombreux ordinateurs stockent les mêmes entrées, garantissant que personne ne peut effectuer de modifications en secret."
  },
  "wallet": {
    "title": "Portefeuille",
    "original": "Wallet",
    "short": "Portefeuille numérique qui gère vos clés.",
    "desc": "Un portefeuille est votre bourse numérique. Il gère les clés dont vous avez besoin pour accéder à votre compte et effectuer des transactions. Un portefeuille peut être un programme, une application, ou même simplement un morceau de papier avec votre clé privée."
  },
  "account": {
    "title": "Compte",
    "original": "Account",
    "short": "Un compte blockchain peut détenir des actifs et envoyer des transactions.",
    "desc": "Un compte est l'emplacement sur la blockchain où vos actifs sont détenus. Un compte possède une adresse publique qui commence par G. Plusieurs portefeuilles peuvent accéder au même compte s'ils ont la clé correcte."
  },
  "addressG": {
    "title": "G adresse",
    "original": "G Address",
    "short": "L'adresse principale publique d'un compte Stellar (beginnt mit G).",
    "desc": "L'adresse G est l'adresse principale d'un compte Stellar. Elle commence par la lettre G. Vous la fournissez aux autres pour qu'ils puissent vous envoyer quelque chose."
  },
  "publicKey": {
    "title": "Clé publique",
    "original": "Public Key",
    "short": "Adresse, die du teilen darfst; bei Stellar meist die G‑Adresse.",
    "desc": "La clé publique est l'adresse que vous avez le droit de partager. Dans Stellar, c'est l'adresse G. Les autres l'utilisent pour vous envoyer de l'argent."
  },
  "privateKey": {
    "title": "Clé secrète",
    "original": "Secret Key",
    "short": "Mot de passe pour le compte – ne le partagez jamais.",
    "desc": "La clé secrète est votre mot de passe pour le compte. Quiconque possède cette clé peut déplacer votre argent. Ne la partagez jamais."
  },
  "addressFederation": {
    "title": "Adresse de la fédération",
    "original": "Federation Address",
    "short": "Kurze Adresse wie E‑Mail, zeigt auf eine G‑Adresse.",
    "desc": "Une adresse de fédération ressemble à un e-mail. Exemple : nom*domain.com. Cette adresse courte pointe vers une adresse G régulière. Elle est plus facile à mémoriser."
  },
  "addressMuxed": {
    "title": "Compte multiplexé",
    "original": "Muxed Account",
    "short": "M‑address with additional ID – shares a base account.",
    "desc": "Une adresse M pointe vers un compte Stellar existant mais possède un numéro supplémentaire (ID).\n\nComptes Muxed = Compte G + ID (M-Adresse)\nIls fournissent une association, mais pas de séparation de compte.\nLe solde, les lignes de confiance, les signataires, et les drapeaux sont toujours sur le compte G.\n\nStellar Development Foundation\n\nPar exemple, plusieurs individus ou départements peuvent être distingués sous la même adresse G. Techniquement, l'argent appartient toujours au compte principal."
  },
  "muxedAccountsUseCases": {
    "title": "Cas d'utilisation pour les comptes intermédiaires",
    "original": "Muxed accounts use cases",
    "short": "Exemples, avantages et limites des adresses M en tant qu'aide à la cartographie.",
    "desc": "Entreprise - Exemple\n\nConfiguration :\n- Un compte G de l'entreprise\n- Une adresse M par client/cas d'utilisation (ID)\n\nProcessus :\n- Le client paie à son adresse M\n- Tout est versé sur le compte G de l'entreprise\n- La comptabilité lit l'ID -> attribution unique\n\nConvient pour :\n- Boutiques, fournisseurs de paiements, échanges\n- Références internes sans risques de mémo\n\nAssociation - Exemple\n\nConfiguration :\n- Un compte G de l'association\n- Adresses M pour les membres, départements, objectifs\n\nProcessus :\n- Contribution/don à l'adresse M appropriée\n- Attribution via ID, pas d'erreurs de mémo\n\nConvient pour :\n- Cotisations\n- Revenus affectés\n- Audit facilité\n\nCe que les comptes multiplexés excellent à faire :\n- Attribution d'entrées robuste\n- Un compte, multiples identités\n- Pas besoin de mémo\n- Moins d'erreurs opérationnelles\n\nCe que les comptes multiplexés ne sont pas :\n- Pas de sous-comptes\n- Pas de solde individuel\n- Pas de lignes de crédit individuelles\n- Pas de signataires/droits individuels\n\nCas d'utilisation généralement inappropriés :\n- Paiements de salaires/comptes de paie (benoetigen eigenes G-Konto)\n- Fiducies/séquestres pour tiers (kein rechtlicher Vermoegenstrenner)\n- Sécurité basée sur les rôles (keine getrennten Signer/Thresholds)\n- Séparation de budget ou de limite (keine separaten Salden/Asset-Limits)\n- Comptes séparés pour conformité (KYC/Reporting nicht sauber trennbar)\n\nComparaison (Kurz) :\nAttribuer des paiements : Oui\nSéparation des actifs : Non\nDélégation d'accès : Non\nCompte légalement séparé : Non\nComptabilité interne : Oui\n\nConclusion clé :\nLes comptes multiplexés gèrent des paiements - ils ne remplacent pas les comptes.\nSi contrôle, propriété ou séparation est nécessaire -> propre compte G."
  },
  "multisig": {
    "title": "Multisignature",
    "original": "Multi‑Sig",
    "short": "Des actions importantes nécessitent plus qu'une signature.",
    "desc": "Multi-Sig signifie signatures multiples. Une action importante nécessite plus d'une clé. Exemple : vous et une deuxième clé devez tous deux être d'accord avant qu'une chose soit envoyée. Cela rend le vol plus difficile.",
    "help": {
      "title": "Explication générale d'un compte d'entreprise à signatures multiples (Multi-Signature)",
      "intro": "Une entreprise peut utiliser un compte blockchain partagé dans lequel plusieurs personnes autorisées sont impliquées. En général, au moins trois signataires (Signer) sont inclus, par exemple, la direction, le responsable financier et la conformité/sauvegarde. L'objectif est que chaque personne puisse effectuer des paiements de manière indépendante sans permettre à une seule personne de contrôler ou de prendre le contrôle du compte seule.",
      "problem": "Si un signataire (Signer) dispose d'un poids suffisant pour effectuer des paiements et qu'en même temps il a assez de poids pour les changements de compte, cette personne pourrait supprimer d'autres signataires (Signer) ou ajuster le seuil/pondération (Thresholds) et ainsi prendre le contrôle du compte. À l'inverse, le propriétaire initial ne devrait pas non plus pouvoir facilement exclure d'autres signataires (Signer) sans contrôles et équilibres. Une structure à signatures multiples garantit que les décisions importantes sont toujours prises collectivement par plusieurs personnes.",
      "setupTitle": "Exemple d'une structure multi-signature sécurisée avec trois signataires",
      "setupWeights": "Dans un exemple avec trois rôles égaux, tous reçoivent la même force de signature :\n- Signataire (Signer) A (Management) : Poids 2\n- Signataire (Signer) B (Finanzen) : Poids 2\n- Signataire (Signer) C (Compliance/Backup) : Poids 2",
      "setupThresholds": "Les seuils/poids appropriés sont définis comme suit :\n- Bas (low_threshold) : 1\n- Moyen (med_threshold) : 2 (for payments and other medium actions)\n- Haut (high_threshold) : 4 (pour les modifications structurelles telles que l'ajout/suppression de signataires (Signer) ou la modification du seuil/poids (Thresholds))\nCela garantit que chaque personne autorisée peut réaliser des paiements, mais qu'aucun individu seul ne peut modifier la structure du compte.",
      "behavior": "Avec cette configuration, les paiements peuvent être effectués par n'importe lequel des trois individus éligibles seul, car le poids de chaque individu atteint le seuil moyen. Pour les changements structurels tels que la suppression d'un signataire, l'ajustement des seuils/poids, ou la fusion ou la clôture du compte, le seuil élevé est requis. Cette valeur ne peut être atteinte que lorsque au moins deux des trois signataires signent ensemble. Cette configuration maintient le compte flexible pour une utilisation quotidienne tout en offrant une forte protection contre les abus.",
      "removal": "Wenn eine Person das Unternehmen verlässt oder nicht mehr vertrauenswürdig ist, können zwei der verbleibenden Unterzeichner (Signer) gemeinsam die Signaturrechte dieser Person entfernen. Kein einzelner Unterzeichner (Signer) – weder ein Mitarbeiter noch die Geschäftsführung – kann andere eigenständig aus dem Konto ausschließen. Der Entzug von Berechtigungen erfolgt also immer kontrolliert und nachvollziehbar durch mindestens zwei Verantwortliche.",
      "summary": "Ce type de structure multi-signature permet aux parties individuelles de traiter efficacement les paiements tout en maintenant le contrôle du compte parmi plusieurs participants. Il réduit le risque de prises de contrôle de compte, protège contre les décisions unilatérales et est particulièrement adapté aux comptes d'entreprise où la sécurité et la flexibilité opérationnelle sont importantes.",
      "closeLabel": "Fermer",
      "linkLabel": "Que signifie Multi-Signature ?",
      "glossaryLinkLabel": "Voir dans le glossaire"
    }
  },
  "multisigCorporate": {
    "title": "Multisignature - Exemple",
    "original": "Multi-Signature - Example",
    "short": "Exemple d'une structure multi-signature pour les comptes d'entreprise avec rôles, poids et seuils.",
    "desc": "Exemple : Une entreprise configure un compte Stellar avec trois signataires : PDG (poids 2), directeur financier (poids 2) et un membre du conseil (poids 1). Les seuils sont configurés de sorte que les opérations à faible sécurité nécessitent un poids de 1, les opérations moyennes (par ex. paiements) un poids de 3, et les opérations élevées (par ex. modification des signataires) un poids de 4. Ainsi, le PDG peut consulter le compte seul, mais doit coopérer avec le directeur financier ou les deux autres signataires pour les paiements et les modifications de configuration."
  },
  "trustline": {
    "title": "Ligne de confiance",
    "original": "Trustline",
    "short": "Accord pour détenir un jeton d'un émetteur spécifique.",
    "desc": "Une ligne de confiance est comme un \"Oui, j'accepte ce jeton.\" En la configurant, vous indiquez que votre compte est prêt à recevoir un jeton spécifique d'un émetteur spécifique. Sans une ligne de confiance, vous ne pouvez pas recevoir ce jeton.\n\nExemple : Une ligne de confiance est spécifiée comme CODE:EMETTEUR. Pour EURT de l'émetteur GDUKMGUGDZQK6Y…, elle serait EURT:GDUKMGUGDZQK6Y…"
  },
  "token": {
    "title": "Jeton",
    "original": "Token",
    "short": "Unité numérique – par exemple, argent, points ou crédits.",
    "desc": "Un jeton est une unité numérique sur la blockchain. Un jeton peut représenter de l'argent, des points ou des crédits pour un service."
  },
  "asset": {
    "title": "Actif",
    "original": "Asset",
    "short": "Tout actif numérique sur une blockchain – des cryptomonnaies aux tokens en passant par les stablecoins.",
    "desc": "Un actif est, au sens le plus large, tout ce qui représente une valeur et peut être transféré. Sur Stellar, n'importe qui peut émettre un actif – par ex. une compagnie aérienne ses miles sous forme de token, une banque son dollar sous forme de stablecoin. Chaque actif Stellar est défini par deux éléments : le code de l'actif (par ex. 'USDC') et l'émetteur (l'adresse G du créateur). XLM est le seul actif sans émetteur, car c'est l'actif natif du réseau."
  },
  "xlm": {
    "title": "XLM",
    "original": "XLM",
    "short": "Monnaie native de Stellar pour les frais et l'activation.",
    "desc": "XLM est la devise native de Stellar. Vous avez besoin de XLM pour payer les frais et pour ouvrir un nouveau compte."
  },
  "mainnet": {
    "title": "Mainnet",
    "original": "Mainnet",
    "short": "Echtes Stellar‑Netzwerk mit realem Wert.",
    "desc": "Le véritable réseau Stellar avec une valeur réelle. Les transactions sont définitives et les frais sont payés en XLM réel."
  },
  "testnet": {
    "title": "Réseau de test",
    "original": "Testnet",
    "short": "Réseau de formation public sans réelle valeur.",
    "desc": "Un réseau de pratique publique. Les jetons n'ont aucune valeur réelle. Idéal pour apprendre et expérimenter sans risque."
  },
  "memo": {
    "title": "Note de service",
    "original": "Memo",
    "short": "Brève note dans une transaction.",
    "desc": "Un mémo est une petite note que vous pouvez envoyer avec une transaction. Souvent, un échange nécessite un mémo spécifique pour savoir à qui appartient l'argent."
  },
  "transaction": {
    "title": "Transaction",
    "original": "Transaction",
    "short": "Action sur la blockchain, par exemple, paiement ou ligne de confiance.",
    "desc": "Une transaction est une action sur la blockchain, telle que l'envoi d'argent ou l'établissement d'une ligne de confiance. Une fois confirmée, une transaction est enregistrée de manière permanente."
  },
  "fee": {
    "title": "Frais",
    "original": "Fee",
    "short": "Montant très faible par transaction.",
    "desc": "Les frais sont un montant très faible que vous payez à chaque transaction. Les frais vont au réseau. Sur Stellar, les frais sont très bas."
  },
  "operations": {
    "title": "Opération",
    "original": "Operation",
    "short": "La plus petite unité d’une transaction Stellar – une transaction peut contenir jusqu’à 100 opérations.",
    "desc": "Sur Stellar, une transaction est un conteneur qui contient une ou plusieurs opérations. Une opération est une action unique – par ex. envoyer un paiement, créer une trustline ou placer une offre. Jusqu’à 100 opérations peuvent être regroupées dans une seule transaction, ce qui est très efficace. Les frais de transaction sont calculés selon le nombre d’opérations incluses (par défaut : 100 stroops par opération)."
  },
  "pathPayment": {
    "title": "Paiement par chemin",
    "original": "Path Payment",
    "short": "Un paiement où Stellar effectue automatiquement une ou plusieurs conversions de devises pour livrer l’actif ciblé.",
    "desc": "Avec les paiements par chemin, on peut par exemple envoyer XLM et le destinataire reçoit automatiquement USDC – Stellar trouve le meilleur chemin d’échange via le marché décentralisé. Le réseau cherche les paires de trading et les pools de liquidité disponibles pour trouver le chemin le moins cher. C’est particulièrement utile pour les paiements transfrontaliers : l’expéditeur paie dans sa devise, le destinataire reçoit la sienne. Le tout dans une seule transaction."
  },
  "clawback": {
    "title": "Récupération",
    "original": "Clawback",
    "short": "Fonction optionnelle de Stellar qui permet à l’émetteur d’un actif de reprendre des jetons émis d’un compte.",
    "desc": "Clawback est une fonction spéciale sur Stellar qui répond aux exigences réglementaires. Si un émetteur active le clawback lors de la création de l’actif, il peut récupérer des jetons de n’importe quel compte – par ex. en cas de fraude, de blanchiment d’argent ou d’obligation légale. Pour les produits financiers réglementés comme les security tokens, cette fonction est souvent exigée par la loi. Les utilisateurs ordinaires n’ont pas à s’en soucier tant qu’ils utilisent des émetteurs fiables."
  },
  "sponsor": {
    "title": "Parrainage",
    "original": "Sponsoring",
    "short": "Fonction Stellar où un compte prend en charge la réserve de base d’un autre compte.",
    "desc": "Sur Stellar, chaque compte et chaque entrée (trustline, entrée de données, etc.) nécessite un solde minimum en XLM (réserve de base). Le parrainage permet à un compte de couvrir cette réserve pour un autre. C’est utile pour les applications qui veulent intégrer de nouveaux utilisateurs sans leur demander d’acheter d’abord des XLM. Exemple : une app parraine la création de compte et des trustlines pour de nouveaux utilisateurs – ils peuvent démarrer tout de suite sans posséder de XLM."
  },
  "ledger": {
    "title": "Grand livre",
    "original": "Ledger",
    "short": "Chaîne de données confirmées et soldes.",
    "desc": "Le grand livre est la chaîne de toutes les données confirmées. Il montre quels comptes détiennent combien et quelles transactions ont eu lieu. Tout le monde peut consulter le grand livre."
  },
  "horizon": {
    "title": "Horizon",
    "original": "Horizon",
    "short": "API‑Dienst, über den Apps mit Stellar sprechen.",
    "desc": "Horizon est le service par lequel les programmes communiquent avec la blockchain Stellar. Notre outil interroge Horizon pour charger les soldes des comptes et les transactions."
  },
  "horizonHistory": {
    "title": "Horizon Histoire",
    "original": "Horizon history depth",
    "short": "Décrit la durée historique des transactions fournie par les serveurs Horizon publics.",
    "desc": "Les serveurs Horizon publics (Mainnet und Testnet) exploités par la Stellar Development Foundation ne fournissent qu'un historique limité – actuellement approximativement un an en rétroaction. Les données plus anciennes ne peuvent plus être récupérées via ces points de terminaison gratuits. Si vous avez besoin de remonter plus loin dans le temps, vous avez essentiellement deux options : (1) vous pouvez exécuter votre propre nœud Horizon avec un historique complet (inklusive History Archives), ou (2) vous pouvez utiliser des services tiers ou payants qui stockent et fournissent des données historiques de Stellar à long terme.",
    "seeAlso": "Entschuldigung für das Missverständnis. Bitte geben Sie den spezifischen Text ein, den Sie ins Französische übersetzt haben möchten."
  },
  "scp": {
    "title": "Stellar Consensus Protocol",
    "original": "SCP – Stellar Consensus Protocol",
    "short": "Le mécanisme de consensus unique de Stellar qui confirme vite les transactions sans mining.",
    "desc": "SCP est le cœur de Stellar : l’algorithme qui décide comment les participants s’accordent sur l’état du ledger. Contrairement à Bitcoin (Proof of Work) ou Ethereum (Proof of Stake), Stellar utilise un vote fédéré : chaque validateur fait confiance à un ensemble choisi de validateurs (quorum set). Cette structure permet d’atteindre le consensus en 3 à 5 secondes sans gaspiller d’énergie par le mining. SCP a été conçu par David Mazières (Stanford) et est prouvé sûr."
  },
  "validator": {
    "title": "Validateur",
    "original": "Validator",
    "short": "Un nœud qui vérifie les transactions et participe au consensus.",
    "desc": "Les validateurs sont des participants de confiance qui maintiennent le réseau Stellar. Ils reçoivent les transactions, vérifient leur validité et votent avec d’autres validateurs sur ce qui entre dans le prochain ledger. Tout le monde peut opérer un validateur Stellar : entreprises, universités ou particuliers. La Stellar Development Foundation en opère certains, mais n’est pas la seule autorité. Un réseau décentralisé de validateurs rend Stellar résistant aux pannes et à la censure."
  },
  "quorumSet": {
    "title": "Quorum Set",
    "original": "Quorum Set",
    "short": "L’ensemble de validateurs auxquels un nœud fait confiance pour le consensus.",
    "desc": "Dans SCP, chaque validateur choisit à qui il fait confiance : c’est son quorum set. Le consensus naît lorsque des quorum sets se chevauchent et se mettent d’accord. Ce modèle s’appelle Federated Byzantine Agreement (FBA). Il est plus flexible que les consensus classiques : pas de liste fixe de nœuds de confiance, mais un réseau de confiance qui se forme naturellement. La qualité et la décentralisation du quorum set influencent directement la sécurité du réseau."
  },
  "sac": {
    "title": "Stellar Asset Contract",
    "original": "SAC – Stellar Asset Contract",
    "short": "Un smart contract Soroban qui rend un asset Stellar utilisable dans les smart contracts.",
    "desc": "Avec Soroban, un problème est apparu : les assets Stellar existants (comme USDC ou XLM) devaient être utilisables dans les smart contracts. Le Stellar Asset Contract résout cela : c’est une interface standardisée de smart contract pour chaque asset Stellar. Les dApps Soroban peuvent ainsi utiliser directement les assets natifs sans les convertir en nouveaux tokens. Les SAC existent automatiquement pour tous les assets Stellar et n’ont pas besoin d’être créés manuellement."
  },
  "anchor": {
    "title": "Ancre",
    "original": "Anchor",
    "short": "Firma, die Fiat‑Geld mit Stellar verbindet.",
    "desc": "Une ancre est une entreprise qui relie l'argent réel, tel que des euros ou des dollars, avec Stellar. Par exemple, vous donnez à l'ancre des euros et recevez en retour un jeton euro sur Stellar."
  },
  "exchange": {
    "title": "Bourse des valeurs",
    "original": "Exchange",
    "short": "Lieu pour acheter et vendre des jetons.",
    "desc": "Un échange est un lieu où vous pouvez acheter ou vendre des jetons. De nombreux échanges exigent un processus KYC, ce qui signifie vérification de l'identité, avant que vous puissiez retirer de l'argent en euros ou en francs."
  },
  "dex": {
    "title": "DEX (Decentralized Exchange)",
    "original": "Decentralized Exchange",
    "short": "Échange décentralisé directement sur la blockchain.",
    "desc": "DEX signifie Échange Décentralisé. Ici, les personnes échangent directement entre elles sur la blockchain. Il n'y a pas d'opérateur unique. Stellar dispose d'un DEX intégré directement."
  },
  "liquidityPool": {
    "title": "Pool de liquidités",
    "original": "Liquidity Pool",
    "short": "Pool commun avec deux jetons pour un échange immédiat.",
    "desc": "Un pool de liquidité est une réserve partagée contenant deux jetons. Les personnes y déposent les deux jetons. D'autres sont ensuite autorisés à échanger instantanément ces jetons. Les déposants gagnent en retour de petits frais."
  },
  "onramp": {
    "title": "Onramp",
    "original": "Onramp",
    "short": "Un service qui permet d’acheter des cryptos avec de la monnaie fiat (ex. euros, francs suisses).",
    "desc": "Un onramp est la porte d’entrée vers la crypto—le passage de l’argent traditionnel vers la crypto. Les méthodes courantes sont la carte bancaire ou le virement. Des services comme Kado ou Onramper permettent d’acheter directement dans une app sans passer par une bourse séparée. Stellar Account Manager intègre des services onramp pour acheter XLM et d’autres actifs avec de la monnaie fiat. Les onramps exigent généralement un KYC."
  },
  "offramp": {
    "title": "Offramp",
    "original": "Offramp",
    "short": "Un service qui permet de vendre des cryptos et de revenir en monnaie fiat.",
    "desc": "L’offramp est l’inverse de l’onramp—le retour vers l’argent traditionnel. Tu vends tes actifs crypto et reçois des euros, des francs ou une autre monnaie fiat sur ton compte bancaire. Sur Stellar, les anchors assurent souvent l’offramp : ils reçoivent par exemple des tokens comme l’USDC et envoient le montant fiat correspondant. Les offramps exigent généralement le KYC."
  },
  "kyc": {
    "title": "Connaissance client",
    "original": "KYC / AML – Know Your Customer / Anti-Money Laundering",
    "short": "Vérification d’identité obligatoire que les services financiers demandent avant l’utilisation.",
    "desc": "Le KYC (Know Your Customer) est une procédure réglementaire où l’utilisateur prouve son identité avec des documents et parfois un selfie. Le but est d’empêcher le blanchiment d’argent (AML), le financement du terrorisme et la fraude. Les protocoles décentralisés comme le Stellar DEX n’exigent pas de KYC—on trade directement depuis son wallet. Les services onramp et offramp doivent faire du KYC car ils relient monnaie fiat et crypto."
  },
  "defi": {
    "title": "Finance décentralisée",
    "original": "DeFi – Decentralized Finance",
    "short": "Des services financiers comme le prêt, le trading et l’épargne — sans banques, via des protocoles blockchain.",
    "desc": "La DeFi regroupe des applications financières qui fonctionnent sans institutions centrales comme les banques ou les bourses. Tout est automatisé par des smart contracts. Les utilisateurs gardent le contrôle de leurs fonds. Exemples : échanges décentralisés (DEX), protocoles de prêt et pools de liquidité. Stellar offre des fonctions DeFi de base avec son DEX intégré et ses pools AMM, étendus par les smart contracts Soroban."
  },
  "yield": {
    "title": "Rendement / Yield",
    "original": "Yield",
    "short": "Le gain que l’on obtient en fournissant du capital dans des protocoles DeFi.",
    "desc": "En DeFi, le yield désigne les revenus issus d’activités comme fournir de la liquidité, faire du staking ou prêter. Le rendement est souvent affiché en APY (Annual Percentage Yield). Des rendements élevés impliquent souvent plus de risque. Important : des rendements très élevés (ex. 1000% APY) sont souvent un signal d’alerte."
  },
  "staking": {
    "title": "Staking",
    "original": "Staking",
    "short": "Bloquer des cryptomonnaies dans un réseau pour obtenir des récompenses et soutenir le réseau.",
    "desc": "Le staking consiste à bloquer des coins dans un réseau proof‑of‑stake pour valider les transactions et sécuriser le réseau. Les stakers reçoivent de nouvelles coins en récompense. Stellar n’utilise pas de staking classique — les détenteurs de XLM peuvent fournir du capital dans des pools de liquidité et gagner des frais de trading. Important : distinguer le vrai staking réseau des offres de “staking” sur les bourses centralisées, souvent proches de comptes épargne."
  },
  "yieldFarming": {
    "title": "Yield Farming",
    "original": "Yield Farming",
    "short": "Déplacer activement son capital entre protocoles DeFi pour maximiser les rendements.",
    "desc": "Les yield farmers déplacent leurs actifs entre différents pools et protocoles pour récolter les meilleurs rendements. C’est attirant mais complexe et risqué : perte impermanente, bugs de smart contracts et chutes soudaines de rendement peuvent effacer les gains. Le yield farming est un concept avancé et déconseillé aux débutants."
  },
  "dao": {
    "title": "Organisation autonome décentralisée",
    "original": "DAO – Decentralized Autonomous Organization",
    "short": "Une organisation pilotée par des smart contracts et des votes de tokens, sans direction centrale.",
    "desc": "Une DAO est une organisation numérique gouvernée par du code et les votes des détenteurs de tokens. Pas de CEO ni de conseil — les décisions se prennent par vote. Les détenteurs peuvent proposer et voter. Les DAOs servent au développement de protocoles, à la gestion de trésorerie et aux changements de règles. C’est innovant, mais il existe des risques comme une faible participation ou des attaques coordonnées."
  },
  "dapp": {
    "title": "Application décentralisée",
    "original": "dApp – Decentralized Application",
    "short": "Une application qui tourne sur une blockchain et n’a pas d’autorité centrale.",
    "desc": "Une dApp ressemble à une application classique, mais fonctionne sur une blockchain plutôt que sur des serveurs centraux. Son code est dans des smart contracts — publiquement accessible et non contrôlé par une seule partie. Exemples : échanges décentralisés, protocoles de prêt ou marketplaces NFT. Avec Soroban, Stellar permet de créer des dApps sur son réseau. Les dApps nécessitent généralement une connexion de wallet au lieu d’un login classique."
  },
  "oracle": {
    "title": "Oracle",
    "original": "Oracle",
    "short": "Un service qui apporte des données du monde réel (prix, météo, etc.) aux smart contracts.",
    "desc": "Par défaut, les blockchains sont coupées du monde extérieur — un smart contract ne peut pas obtenir tout seul le prix du Bitcoin ou le taux EUR/USD. Les oracles résolvent ce problème en fournissant des données externes fiables. Des services connus : Chainlink ou Pyth Network. Sans oracles, de nombreuses applications DeFi comme les protocoles de prêt ou les actifs synthétiques seraient impossibles."
  },
  "cex": {
    "title": "Bourse centralisée",
    "original": "CEX – Centralized Exchange",
    "short": "Une bourse crypto gérée par une entreprise qui sert d’intermédiaire entre acheteurs et vendeurs.",
    "desc": "Avec une CEX comme Coinbase, Binance ou Kraken, tu ne possèdes pas directement tes coins – la bourse les garde pour toi. C’est pratique mais risqué : si la bourse est piratée ou devient insolvable, des fonds peuvent être perdus (exemple : l’effondrement de FTX en 2022). Les CEX exigent généralement une vérification d’identité (KYC). À l’inverse, une DEX permet d’échanger directement depuis son propre wallet sans intermédiaire."
  },
  "orderBook": {
    "title": "Carnet d’ordres",
    "original": "Order Book",
    "short": "Une liste de toutes les offres d’achat et de vente ouvertes pour une paire de trading sur une bourse.",
    "desc": "Le carnet d’ordres montre en temps réel les prix auxquels les acheteurs veulent acheter (bids) et les vendeurs veulent vendre (asks). La différence entre le meilleur achat et la meilleure vente s’appelle le spread. Stellar possède un carnet d’ordres décentralisé intégré (SDEX – Stellar Decentralized Exchange) où chacun peut trader des actifs. Il existe aussi des pools de liquidité comme alternative au modèle classique du carnet d’ordres."
  },
  "limitOrder": {
    "title": "Ordre à cours limité",
    "original": "Limit Order",
    "short": "Un ordre qui n’est exécuté qu’à un prix déterminé ou meilleur.",
    "desc": "Avec un ordre à cours limité, tu fixes le prix maximum d’achat ou le prix minimum de vente. L’ordre est placé dans le carnet et attend qu’un trader accepte ce prix. Avantage : tu contrôles le prix. Inconvénient : il peut ne pas être exécuté tout de suite, voire jamais. Sur Stellar, cela correspond à une « offer » dans le carnet décentralisé."
  },
  "marketOrder": {
    "title": "Ordre au marché",
    "original": "Market Order",
    "short": "Un ordre exécuté immédiatement au meilleur prix disponible sur le marché.",
    "desc": "Un ordre au marché est exécuté immédiatement au meilleur prix disponible dans le carnet. Cela garantit l’exécution mais pas le prix. Avec une faible liquidité, le prix réel peut s’écarter sensiblement de ce qui était prévu (slippage). Les ordres au marché sont bons pour la vitesse; les ordres limités sont meilleurs quand le prix compte."
  },
  "offer": {
    "title": "Offre",
    "original": "Offer",
    "short": "Une offre d’achat ou de vente ouverte dans le carnet d’ordres Stellar décentralisé.",
    "desc": "Sur Stellar, tout le monde peut placer une offre dans le carnet décentralisé : par exemple, « Je vends 100 XLM à 0,10 USDC chacun ». L’offre reste ouverte jusqu’à exécution complète, suppression manuelle ou remplacement par une nouvelle version. Les offres sont la base du SDEX (Stellar Decentralized Exchange) et sont aussi utilisées pour les path payments. Chaque offre ouverte augmente le solde minimum du compte d’une base reserve."
  },
  "slippage": {
    "title": "Glissement de prix",
    "original": "Slippage",
    "short": "La différence entre le prix attendu et le prix réellement exécuté.",
    "desc": "Le slippage se produit quand le prix du marché bouge entre l’envoi et l’exécution d’un ordre, ou quand un trade est si grand qu’il “mange” le carnet. Exemple : tu veux acheter à 1,00 USDC mais, faute de liquidité, l’exécution se fait à 1,05 USDC – soit 5 % de slippage. Dans les pools de liquidité, le slippage est particulièrement important pour les gros trades. Beaucoup de DEX permettent de fixer une tolérance maximale au slippage."
  },
  "impermanentLoss": {
    "title": "Perte impermanente",
    "original": "Impermanent Loss",
    "short": "Une perte temporaire pour les fournisseurs de liquidité quand les prix des actifs du pool s’éloignent.",
    "desc": "Quand tu fournis de la liquidité à un pool, tu peux subir une perte impermanente : si le rapport de prix entre les deux actifs change, la valeur au retrait est inférieure à celle d’un simple “hold”. La perte est dite “impermanente” car elle disparaît si les prix reviennent au rapport initial. Les frais de trading peuvent compenser cette perte. C’est un concept clé pour ceux qui fournissent de la liquidité sur le Stellar DEX."
  },
  "amm": {
    "title": "Teneur de marché automatisé",
    "original": "AMM – Automated Market Maker",
    "short": "Un système basé sur des smart contracts qui permet d’échanger sans carnet d’ordres grâce à des formules de prix.",
    "desc": "Un AMM remplace le carnet d’ordres classique par un algorithme. Au lieu d’attendre un acheteur ou un vendeur, tu trades directement avec un pool de liquidité. Le prix est calculé automatiquement par une formule (souvent x × y = k). Plus on achète d’un actif, plus il devient cher. Stellar a introduit des pools de liquidité basés sur AMM qui coexistent avec le carnet SDEX classique."
  },
  "bullBearMarket": {
    "title": "Marché haussier et baissier",
    "original": "Bull & Bear Market",
    "short": "Marché haussier = prix en hausse et optimisme. Marché baissier = prix en baisse et pessimisme.",
    "desc": "Dans un marché haussier, les prix montent sur une période prolongée, les investisseurs sont optimistes et achètent. Dans un marché baissier, les prix baissent (souvent de plus de 20 % depuis le sommet) et l’ambiance est négative. Les symboles : le taureau pousse vers le haut avec ses cornes (hausse), l’ours frappe vers le bas avec sa patte (baisse). Les marchés crypto alternent souvent entre ces phases—souvent plus fortement et plus vite que les marchés traditionnels."
  },
  "hodl": {
    "title": "HODL",
    "original": "HODL",
    "short": "Argot crypto pour garder des cryptos à long terme, sans se soucier des variations de prix.",
    "desc": "HODL est né en 2013 d’une faute de frappe de “hold” sur un forum Bitcoin et est devenu un mantra crypto. La stratégie : acheter et garder à long terme au lieu de trader à court terme. Beaucoup d’investisseurs long terme y croient, car le trading court terme fait souvent moins bien que le simple “hold”. On dit parfois en plaisantant que HODL signifie “Hold On for Dear Life”—surtout dans les marchés volatils."
  },
  "dca": {
    "title": "Moyenne de coût",
    "original": "DCA – Dollar Cost Averaging",
    "short": "Stratégie d’investissement où l’on place un montant fixe régulièrement, quel que soit le prix actuel.",
    "desc": "Au lieu d’investir une grosse somme d’un coup, tu investis un montant fixe régulièrement (par ex. 50 € chaque mois) en XLM ou Bitcoin. Quand les prix sont bas tu achètes plus, quand ils sont hauts tu achètes moins – ce qui lisse le prix moyen. Le DCA réduit le risque d’entrer au mauvais moment et convient bien aux débutants et aux marchés volatils comme la crypto."
  },
  "portfolio": {
    "title": "Portefeuille",
    "original": "Portfolio",
    "short": "L’ensemble des actifs crypto et investissements détenus par un utilisateur.",
    "desc": "Un portefeuille est la vue d’ensemble de tous les actifs détenus—quels coins et tokens tu possèdes, en quelles quantités et à quelle valeur. Une bonne stratégie de portefeuille inclut la diversification : ne pas tout mettre dans un seul actif. Dans Stellar Account Manager, tu peux voir ton portefeuille directement—tous les actifs de tes comptes Stellar d’un coup d’œil."
  },
  "tvl": {
    "title": "Total Value Locked",
    "original": "TVL – Total Value Locked",
    "short": "La valeur totale des actifs verrouillés dans un protocole DeFi ou un pool de liquidité.",
    "desc": "Le TVL est une métrique importante en DeFi. Il montre combien de capital est verrouillé dans un protocole, une dApp ou un pool de liquidité. Un TVL élevé suggère confiance et usage actif. Sur Stellar, le TVL mesure la valeur de tous les actifs dans les pools de liquidité. Des plateformes comme DeFiLlama suivent le TVL sur de nombreuses blockchains et protocoles."
  },
  "balanceClaimable": {
    "title": "Solde Réclamable",
    "original": "Claimable Balance",
    "short": "Argent réservé que vous devez encore recevoir.",
    "desc": "Un solde réclamable est de l'argent qui est déjà réservé pour vous, mais que vous devez encore réclamer. Il n'est crédité sur votre compte que lorsque vous l'acceptez."
  },
  "protocolUpdate": {
    "title": "Mise à jour du protocole",
    "original": "Protocol Update",
    "short": "Aktualisierung der Netzwerk‑Regeln.",
    "desc": "Une mise à jour du protocole est une mise à niveau des règles du réseau Stellar, telle que l'ajout de nouvelles fonctionnalités ou des modifications de sécurité. Tous les nœuds du réseau doivent utiliser les mêmes règles."
  },
  "soroban": {
    "title": "Soroban",
    "original": "Soroban",
    "short": "Stellars Smart‑Contract‑System.",
    "desc": "Soroban est le système de contrats intelligents de Stellar. Un contrat intelligent est un code de programme sur la blockchain. Le code peut vérifier de manière indépendante les règles et déclencher des actions sans besoin d'un intermédiaire bancaire."
  },
  "multiSignature": {
    "title": "Multisignature",
    "original": "Multi-Signature",
    "short": "Multiple signatures required; weights + threshold determine the release.",
    "desc": "Dans une configuration multi-signatures, plusieurs clés doivent signer avant qu'une action ne devienne valide. Chaque signataire a un poids, et la somme doit atteindre le seuil requis. Cela augmente la sécurité car une seule clé volée n'est pas suffisante."
  },
  "signer": {
    "title": "Signataire",
    "original": "Signer",
    "short": "Clé publique avec poids, faisant partie de la configuration du compte.",
    "desc": "Un signataire est une clé publique qui appartient à un compte et possède un poids. Sa signature contribue au seuil requis. Plusieurs signataires peuvent collectivement autoriser une transaction.\n\nTypes de signataires :\n- ed25519 (__GARDER_TERME_EN_1__)\n- hashX (__GARDER_TERME_EN_2__)\n- preAuthTx (__GARDER_TERME_EN_3__)\n\nSKM prend en charge uniquement ed25519. Pour des options supplémentaires, visitez https://lab.stellar.org."
  },
  "thresholds": {
    "title": "Seuils",
    "original": "Thresholds",
    "short": "Limites (low/med/high) qui fixent le poids total requis.",
    "desc": "Les seuils définissent combien de signatures pondérées sont nécessaires pour les actions : bas pour les opérations simples, moyen pour les paiements, et élevé pour les changements critiques. La somme des poids des signataires doit atteindre le seuil respectif."
  },
  "masterWeight": {
    "title": "Poids maître",
    "original": "master_weight",
    "short": "Poids de la clé maîtresse ; détermine l'importance accordée à la clé maîtresse.",
    "desc": "Le poids maître est le poids de la clé principale d'un compte. Un poids maître élevé permet à la clé principale de signer de nombreuses actions par elle-même ; une valeur basse nécessite des signataires supplémentaires."
  },
  "accountConfig": {
    "title": "Configuration du compte",
    "original": "Account Configuration",
    "short": "L'interaction entre les signataires et les seuils détermine la sécurité du compte.",
    "desc": "La configuration du compte définit quels signataires existent avec quels poids et quels seuils s'appliquent. Les modifications des signataires ou des seuils sont critiques pour la sécurité, car elles déterminent combien de signatures sont nécessaires."
  },
  "distributedNetwork": {
    "title": "Réseau distribué",
    "original": "Distributed Network",
    "short": "De nombreux ordinateurs travaillent ensemble au lieu qu'un seul prenne toutes les décisions.",
    "desc": "Imaginez un marché où de nombreux traders connaissent les mêmes règles. Si un participant se retire, le marché continue de fonctionner car d'autres peuvent reprendre le relais. Cela maintient le système stable et plus difficile à manipuler."
  },
  "node": {
    "title": "Nœud",
    "original": "Node",
    "short": "Un seul participant dans le réseau.",
    "desc": "Un nœud est comme un gardien de registre qui détient une copie des données. Il vérifie les nouvelles entrées et les transmet. De nombreux nœuds ensemble rendent le réseau fiable."
  },
  "block": {
    "title": "Bloc",
    "original": "Block",
    "short": "Un bloc est un ensemble d'entrées.",
    "desc": "Comme une page dans un livre de caisse, un bloc recueille plusieurs transactions. Une fois qu'il est plein, il est complété et ajouté à la chaîne. Cela crée l'histoire étape par étape."
  },
  "consensusMechanism": {
    "title": "Mécanisme de consensus",
    "original": "Consensus Mechanism",
    "short": "Règles sur lesquelles tout le monde s'accorde pour accepter des entrées valides.",
    "desc": "C'est comme lorsqu'un groupe décide quelle facture est valide. Cela empêche quiconque de faire des modifications en secret. Différentes blockchains utilisent des méthodes différentes, mais le but est toujours d'atteindre un consensus."
  },
  "finality": {
    "title": "Caractère définitif / Définivité",
    "original": "Finality",
    "short": "La certitude qu'une transaction est définitive.",
    "desc": "Lorsque quelque chose est final, cela ressemble à un relevé bancaire confirmé. Vous n'avez plus à vous attendre à ce qu'il soit annulé. Cela crée de la confiance."
  },
  "immutability": {
    "title": "Immutabilité",
    "original": "Immutability",
    "short": "Les entrées ne doivent pas être modifiées rétroactivement.",
    "desc": "Semblable à un registre : toute suppression après coup est visible. Les modifications sont ajoutées comme une nouvelle entrée, sans être écrasées. Cela rend l'historique traçable."
  },
  "decentralization": {
    "title": "Décentralisation",
    "original": "Decentralization",
    "short": "Aucune autorité centrale ne contrôle tout.",
    "desc": "Au lieu d'un seul coffre-fort, il y a de nombreux coffres-forts contenant les mêmes informations. Les décisions émergent de l'interaction de nombreux participants. Cela rend le système plus robuste."
  },
  "publicBlockchain": {
    "title": "Blockchain publique",
    "original": "Public Blockchain",
    "short": "Ouvert à tous ceux qui souhaitent participer.",
    "desc": "Tout le monde peut participer et consulter les données, similaire à un tableau d'affichage public. Cela augmente la transparence, mais chaque action est visible par tous. Des règles garantissent que personne ne peut tricher."
  },
  "privateBlockchain": {
    "title": "Blockchain privé",
    "original": "Private Blockchain",
    "short": "Accès réservé aux participants sélectionnés uniquement.",
    "desc": "Comme un livre de caisse d'entreprise que seuls les employés sont autorisés à voir. Cela peut être plus rapide et mieux contrôlé, mais c'est moins ouvert. La confiance est ici établie par l'organisation."
  },
  "permissionlessBlockchain": {
    "title": "Blockchain sans permission",
    "original": "Permissionless Blockchain",
    "short": "Tout le monde est autorisé à participer sans permission.",
    "desc": "Comme un marché auquel tout le monde peut participer. Cela réduit les obstacles, mais peut nécessiter davantage de règles pour rester équitable. Des exemples incluent de nombreuses blockchains publiques."
  },
  "permissionedBlockchain": {
    "title": "Blockchain autorisée",
    "original": "Permissioned Blockchain",
    "short": "Participation uniquement sur autorisation.",
    "desc": "Comme un club avec une liste de membres. Cela peut créer des responsabilités claires. Cependant, c'est moins ouvert."
  },
  "seedPhrase": {
    "title": "Théorème de restauration",
    "original": "Seed Phrase / Recovery Phrase",
    "short": "Une liste de mots avec laquelle vous pouvez restaurer votre portefeuille.",
    "desc": "Elle est comme la clé de secours de votre coffre-fort. Celui qui la possède peut restaurer votre portefeuille. Par conséquent, elle ne devrait jamais être stockée en ligne."
  },
  "selfCustody": {
    "title": "Auto-détention",
    "original": "Self-Custody",
    "short": "Vous gardez vos clés vous-même.",
    "desc": "Comme de l'argent liquide dans votre propre coffre-fort : vous avez le contrôle, mais aussi la responsabilité. Si vous perdez l'accès, personne ne peut vous aider. Pour les débutants, la prudence est particulièrement importante."
  },
  "custodian": {
    "title": "Gardien",
    "original": "Custodian",
    "short": "Un fournisseur de services conserve vos clés pour vous.",
    "desc": "Comme une banque qui gère votre compte. Cela peut être pratique, mais cela vous enlève le contrôle total. Vous devez lui faire confiance."
  },
  "hardwareWallet": {
    "title": "Portefeuille matériel",
    "original": "Hardware Wallet",
    "short": "Un dispositif physique pour vos clés.",
    "desc": "Comme un petit coffre-fort dans votre poche. Les clés restent sur l'appareil et ne vont pas en ligne. Cela protège contre de nombreuses attaques en ligne."
  },
  "hotWallet": {
    "title": "Portefeuille chaud",
    "original": "Hot Wallet",
    "short": "Un portefeuille avec accès à internet.",
    "desc": "Comme un portefeuille dans une veste : pratique mais plus vulnérable. Idéal pour de petits montants et une utilisation quotidienne. Pas idéal pour de grosses sommes."
  },
  "coldWallet": {
    "title": "Portefeuille froid",
    "original": "Cold Wallet",
    "short": "Un portefeuille sans connexion Internet.",
    "desc": "Comme un coffre-fort au sous-sol. Très sécurisé, mais peu pratique pour une utilisation quotidienne. Convient pour un stockage à long terme."
  },
  "cryptocurrency": {
    "title": "Cryptomonnaie",
    "original": "Cryptocurrency",
    "short": "Une monnaie numérique qui est envoyée directement entre les personnes.",
    "desc": "Comme de l'argent liquide numérique, mais sans banque. Vous pouvez l'envoyer directement aux autres. La valeur peut fluctuer."
  },
  "altcoin": {
    "title": "Altcoin",
    "original": "Altcoin",
    "short": "Toutes les cryptomonnaies sauf le Bitcoin.",
    "desc": "Comme d'autres marques sur le marché en plus de l'acteur dominant. Certaines sont bien connues, beaucoup sont petites. La qualité et le risque varient considérablement."
  },
  "stablecoin": {
    "title": "Stablecoin",
    "original": "Stablecoin",
    "short": "Cryptomonnaie avec une valeur potentiellement stable.",
    "desc": "Comme une monnaie numérique indexée sur une devise standard. Cela rend son prix plus stable. Toutefois, la confiance envers le fournisseur reste importante."
  },
  "utilityToken": {
    "title": "Jeton d'utilisation",
    "original": "Utility Token",
    "short": "Un jeton qui peut être utilisé pour accéder à un service.",
    "desc": "Comme un bon sur un stand de marché. Il offre un accès ou une réduction. Sa valeur dépend de l'utilité du service."
  },
  "securityToken": {
    "title": "Jetons de sécurité",
    "original": "Security Token",
    "short": "Un jeton avec des caractéristiques de sécurité.",
    "desc": "Comme un certificat d'actions. Il peut promettre des droits ou des bénéfices. Des règles plus strictes s'appliquent souvent à cela."
  },
  "governanceToken": {
    "title": "Jeton de gouvernance",
    "original": "Governance Token",
    "short": "Un jeton pour avoir son mot à dire dans les règles.",
    "desc": "Comme une carte de vote dans un club. Ceux qui ont des jetons peuvent voter sur les règles. Cela signifie responsabilité."
  },
  "liquidityToken": {
    "title": "Jetons de liquidité / jetons LP",
    "original": "Liquidity Token",
    "short": "Un jeton pour la liquidité fournie.",
    "desc": "Comme un reçu montrant que vous avez contribué de l'argent à un fonds commun. Vous recevez des frais proportionnels. La valeur peut fluctuer."
  },
  "nft": {
    "title": "Jeton non fongible / NFT",
    "original": "Non-Fungible Token",
    "short": "Un jeton numérique unique.",
    "desc": "Comme un objet de collection signé. Il représente quelque chose d'unique, ce n'est pas une pièce interchangeable. La valeur dépend de la demande."
  },
  "cbdc": {
    "title": "Monnaie numérique de banque centrale / MNBC",
    "original": "Central Bank Digital Currency",
    "short": "Monnaie numérique émise par une banque centrale.",
    "desc": "Comme de l'argent liquide numérique de l'État. Ce serait de l'argent officiel, mais sous forme numérique. Les détails dépendent du pays spécifique."
  },
  "transactionStatus": {
    "title": "Statut de la transaction",
    "original": "Transaction Status",
    "short": "Indique si une transaction est encore ouverte ou déjà terminée.",
    "desc": "Comme le suivi de colis : en attente, confirmé ou échoué. De cette manière, vous pouvez voir si tout s'est bien déroulé. Parfois, cela prend un peu de temps."
  },
  "gasFee": {
    "title": "Frais de gas",
    "original": "Gas Fee",
    "short": "Une redevance pour le travail informatique dans le réseau.",
    "desc": "Comme des frais de traitement à un stand de marché. Plus c'est fréquenté, plus cela peut devenir cher. Toutes les blockchains ne l'appellent pas gas."
  },
  "onChain": {
    "title": "Sur la chaîne",
    "original": "On-Chain",
    "short": "Se produit directement sur la blockchain.",
    "desc": "Comme une entrée directement dans le grand livre. Tout le monde peut la voir. C'est transparent, mais souvent plus lent ou plus coûteux."
  },
  "offChain": {
    "title": "Hors chaîne",
    "original": "Off-Chain",
    "short": "Se produit en dehors de la blockchain.",
    "desc": "Comme un accord verbal qui est ensuite consigné dans le registre. Cela peut être plus rapide et plus économique. La confiance joue ici un rôle plus important."
  },
  "liquidity": {
    "title": "Liquidité",
    "original": "Liquidity",
    "short": "Montre à quel point quelque chose peut être facilement géré.",
    "desc": "Le nombre d'acheteurs et de vendeurs qu'il y a. Une haute liquidité signifie que vous pouvez échanger rapidement sans affecter significativement le prix. Une faible liquidité donne une sensation de lenteur."
  },
  "volatility": {
    "title": "Volatilité",
    "original": "Volatility",
    "short": "Quelle est la fluctuation des prix.",
    "desc": "Comme un marché avec de fortes fluctuations de prix. Une haute volatilité signifie des opportunités, mais aussi des risques. Pour les débutants, cela peut être stressant."
  },
  "marketCap": {
    "title": "Capitalisation boursière",
    "original": "Market Capitalization",
    "short": "La valeur totale d'une pièce ou d'un projet.",
    "desc": "Comme la valeur totale de tous les biens sur un marché. Elle est approximativement dérivée du prix multiplié par la quantité en circulation. Les grandes valeurs semblent plus stables, mais elles ne le sont pas automatiquement."
  },
  "circulatingSupply": {
    "title": "Quantité de circulation",
    "original": "Circulating Supply",
    "short": "La quantité de pièces effectivement en circulation.",
    "desc": "Comme le nombre de pièces qui sont réellement sur le marché. Tout ce qui existe n'est pas encore en circulation. Cela influence le prix."
  },
  "priceDiscovery": {
    "title": "Tarification",
    "original": "Price Discovery",
    "short": "C'est ainsi que le prix est déterminé par l'offre et la demande.",
    "desc": "C'est comme un marché : l'offre et la demande se rencontrent. De nombreuses petites décisions déterminent le prix. Il n'y a pas d'interrupteur fixe."
  },
  "spread": {
    "title": "Plage de négociation",
    "original": "Spread",
    "short": "La différence entre le prix d'achat et le prix de vente.",
    "desc": "Comme l'écart entre l'offre et la demande dans un magasin. Plus l'écart est réduit, plus cela semble équitable. Les écarts importants rendent les transactions plus coûteuses."
  },
  "phishing": {
    "title": "Hameçonnage",
    "original": "Phishing",
    "short": "Fraude par le biais de fausses nouvelles ou de faux sites web.",
    "desc": "Comme un faux email bancaire qui vous attire dans un piège. Le but est que vous divulguiez vos identifiants de connexion. Ne cliquez jamais sur des liens sans réfléchir."
  },
  "scam": {
    "title": "Scam",
    "original": "Scam",
    "short": "Une arnaque dans la crypto qui vise à voler les assets des utilisateurs.",
    "desc": "Les scams sont malheureusement fréquents dans la crypto, car les transactions sont irréversibles et il n’y a pas d’autorité centrale pour aider. Exemples : faux giveaways (« Envoie 1 XLM, reçois 2 »), fausses apps de wallet, plateformes d’investissement frauduleuses ou faux support. Règle simple : personne ne donne de crypto gratuitement. Si c’est trop beau pour être vrai, ça l’est souvent. Ne partage jamais ta clé privée ou ta seed phrase—avec personne, jamais."
  },
  "rugPull": {
    "title": "Rug Pull",
    "original": "Rug Pull",
    "short": "Une arnaque où les développeurs retirent toute la liquidité et disparaissent avec l’argent.",
    "desc": "Le rug pull est très courant en DeFi et dans les tokens. Schéma : un projet crée un token, crée du hype, attire des investisseurs—puis retire soudainement toute la liquidité. Le prix s’effondre à zéro et l’équipe disparaît. Signaux d’alerte : équipe anonyme, aucun audit du smart contract, promesses de rendements irréalistes, historique très court. N’investis que dans des projets avec équipe transparente et code audité."
  },
  "ponzi": {
    "title": "Ponzi Scheme",
    "original": "Ponzi Scheme",
    "short": "Un système frauduleux où les rendements des anciens sont payés avec l’argent des nouveaux.",
    "desc": "Un schéma Ponzi promet de gros rendements mais ne les paie pas avec de vrais profits—il les paie avec l’argent des nouveaux investisseurs. Tant que de nouveaux fonds arrivent, le système tient, puis s’effondre. Le secteur crypto a vu de nombreux Ponzi, parfois de plusieurs milliards. Signaux d’alerte : rendements garantis, pression pour entrer vite, modèle opaque, focus sur le recrutement de nouveaux membres."
  },
  "twoFactorAuth": {
    "title": "Two-Factor Authentication",
    "original": "2FA – Two-Factor Authentication",
    "short": "Une couche de sécurité supplémentaire qui demande un second facteur en plus du mot de passe.",
    "desc": "La 2FA protège bien mieux qu’un mot de passe seul. Après le mot de passe, un second facteur est requis—par exemple un code d’appli (Google Authenticator, Authy) ou un SMS. Important : la 2FA par SMS est moins sûre à cause du SIM‑swapping. Active la 2FA sur tous tes comptes d’échange crypto. Note : les wallets en self‑custody n’ont pas de 2FA—la clé privée est la seule protection."
  },
  "socialEngineering": {
    "title": "Social Engineering",
    "original": "Social Engineering",
    "short": "Manipuler les gens par des techniques psychologiques pour obtenir des infos ou un accès.",
    "desc": "Le social engineering est souvent plus dangereux que les attaques techniques, car il exploite l’humain. Méthodes : se faire passer pour le support et demander la clé privée ; créer une fausse urgence (« Votre compte va être bloqué ! ») ; inspirer confiance avec de fausses identités. En crypto, aucun support légitime, aucun employé Stellar ou wallet ne demandera ta clé privée ou ta seed phrase. Jamais."
  },
  "smartContract": {
    "title": "Contrat intelligent",
    "original": "Smart Contract",
    "short": "Un programme qui exécute automatiquement des règles fixes.",
    "desc": "Comme une machine qui répond selon des règles fixes. Elle exécute les accords automatiquement. Cela économise la confiance mais nécessite des règles claires."
  },
  "programmableLogic": {
    "title": "Règles automatisées",
    "original": "Programmable Logic",
    "short": "Règles qui s'exécutent automatiquement lorsqu'un événement survient.",
    "desc": "Comme une règle if-then dans un automate. Cela permet de contrôler les processus sans intervention manuelle à chaque fois. C'est ainsi que sont créés des contrats numériques simples."
  },
  "networkCongestion": {
    "title": "Utilisation du réseau",
    "original": "Network Congestion",
    "short": "S'il y a un grand nombre de transactions en attente simultanément.",
    "desc": "Comme un embouteillage sur l'autoroute. Les transactions prennent plus de temps et les frais peuvent augmenter. Avec moins de trafic, cela redevient plus rapide."
  },
  "blockchainTypes": {
    "title": "Types de blockchain",
    "original": "Blockchain Types",
    "short": "Il existe différents types de blockchains avec des objectifs différents.",
    "desc": "Comme différents types de véhicules pour différents itinéraires. Certains sont conçus pour les paiements, d'autres pour les programmes. Il vaut la peine de connaître le but."
  },
  "paymentBlockchain": {
    "title": "Blockchain de paiement",
    "original": "Payment Blockchain",
    "short": "Une blockchain conçue pour des paiements rapides.",
    "desc": "Comme un registre rapide pour l'argent. L'accent est mis sur des transferts peu coûteux et rapides. Les fonctionnalités sont souvent intentionnellement simplifiées."
  },
  "smartContractBlockchain": {
    "title": "Blockchain de contrats intelligents",
    "original": "Smart Contract Blockchain",
    "short": "Une blockchain capable d'exécuter des programmes et des applications.",
    "desc": "Comme un marché avec de nombreux distributeurs automatiques. En plus des paiements, des règles et des applications peuvent y fonctionner. Cela les rend polyvalents, mais souvent plus complexes."
  },
  "blockchainComparison": {
    "title": "Comparaison des blockchains",
    "original": "Blockchain Comparison",
    "short": "Une comparaison révèle les forces et faiblesses des différentes blockchains.",
    "desc": "Comme la comparaison des banques ou des marchés : chacun a ses forces et ses faiblesses. Les facteurs importants sont le coût, la rapidité et la sécurité. Il n'existe pas de système parfait pour tout."
  },
  "stellarVsBitcoinVsEthereum": {
    "title": "Stellar vs. Bitcoin vs. Ethereum",
    "original": "Stellar vs. Bitcoin vs. Ethereum",
    "short": "Trois blockchains bien connues avec des focalisations différentes.",
    "desc": "Le Bitcoin est comme de l'or numérique et est souvent considéré comme une réserve de valeur. Ethereum est comme une plateforme pour des programmes et des applications. Stellar est axé sur des paiements abordables."
  },
  "mining": {
    "title": "Mining",
    "original": "Mining",
    "short": "Le processus où des ordinateurs résolvent des calculs complexes pour créer des blocs et valider des transactions.",
    "desc": "Le mining est au cœur des blockchains Proof‑of‑Work comme Bitcoin. Les mineurs se font concurrence pour résoudre une énigme mathématique. Le gagnant ajoute le prochain bloc et reçoit une récompense en nouvelles coins. Le mining consomme énormément d’électricité et de matériel spécialisé. Stellar n’a pas besoin de mining : le consensus SCP est économe en énergie et confirme en quelques secondes."
  },
  "proofOfWork": {
    "title": "Proof of Work",
    "original": "Proof of Work",
    "short": "Un mécanisme de consensus qui utilise de la puissance de calcul pour valider les transactions et créer des blocs.",
    "desc": "Le Proof of Work (PoW) est le mécanisme de consensus original, utilisé par Bitcoin. Les mineurs doivent fournir une puissance de calcul massive pour créer un bloc valide—cela rend les attaques très coûteuses. Inconvénient : PoW consomme beaucoup d’énergie et est lent (Bitcoin ~7 transactions par seconde). Stellar et beaucoup de blockchains plus récentes ont choisi des alternatives plus efficaces."
  },
  "proofOfStake": {
    "title": "Proof of Stake",
    "original": "Proof of Stake",
    "short": "Un mécanisme de consensus où les validateurs immobilisent des coins comme garantie plutôt que d’utiliser du calcul.",
    "desc": "En Proof of Stake (PoS), les validateurs sont choisis pour créer des blocs en fonction des coins qu’ils ont stakés. Ethereum est passé de PoW à PoS en 2022 et a réduit sa consommation d’énergie de plus de 99 %. PoS est plus efficace que PoW, mais comporte d’autres risques comme la concentration du pouvoir chez les gros détenteurs. Stellar n’utilise ni PoW ni PoS, mais son propre Stellar Consensus Protocol (SCP)."
  },
  "fork": {
    "title": "Fork",
    "original": "Fork",
    "short": "Un changement de protocole qui peut être rétro‑compatible (soft fork) ou incompatible (hard fork).",
    "desc": "Un soft fork est rétro‑compatible—les anciens nœuds peuvent continuer. Un hard fork est un changement majeur qui peut scinder le réseau : les nœuds qui ne se mettent pas à jour suivent l’ancienne chaîne. Exemples connus : Bitcoin Cash (séparé de Bitcoin en 2017) ou Ethereum Classic (séparé d’Ethereum en 2016). Stellar applique ses mises à jour via vote des validateurs—un processus ordonné sans scissions incontrôlées."
  },
  "layer1Layer2": {
    "title": "Layer 1 / Layer 2",
    "original": "Layer 1 / Layer 2",
    "short": "Layer 1 est la blockchain de base ; Layer 2 sont des solutions pour scaler et étendre.",
    "desc": "Le Layer 1 (L1) est la blockchain principale—ex. Bitcoin, Ethereum ou Stellar. Le Layer 2 (L2) regroupe des protocoles au‑dessus de L1 pour améliorer la vitesse et les coûts. Exemples : Lightning Network (sur Bitcoin) ou Polygon (sur Ethereum). Stellar est lui‑même un L1 rapide et peu coûteux grâce à SCP, et a donc moins besoin de solutions L2 qu’Ethereum."
  },
  "bridge": {
    "title": "Bridge",
    "original": "Bridge",
    "short": "Un protocole qui permet de transférer des assets entre deux blockchains différentes.",
    "desc": "Comme les blockchains sont isolées, les bridges permettent d’échanger des assets entre elles. Exemple : une bridge Ethereum–Stellar permet de transférer l’USDC d’Ethereum vers Stellar. Techniquement, les assets sont bloqués sur la chaîne source et émis comme tokens “wrapped” sur la chaîne cible. Les bridges sont utiles mais souvent attaqués—plusieurs grands hacks viennent d’exploits de bridges. Sur Stellar, les anchors jouent souvent un rôle similaire."
  },
  "interoperability": {
    "title": "Interoperabilité",
    "original": "Interoperability",
    "short": "La capacité de différentes blockchains à communiquer et échanger des assets.",
    "desc": "L’interopérabilité est un grand défi du secteur crypto. Aujourd’hui, des centaines de blockchains existent sans pouvoir communiquer—comme des îles sans ponts. Les solutions incluent les bridges, des protocoles cross‑chain ou des standards comme IBC (Inter‑Blockchain Communication). Stellar vise l’interopérabilité : son système d’anchors connecte la finance traditionnelle, et des bridges relient Stellar à d’autres blockchains."
  },
  "whitepaper": {
    "title": "Whitepaper",
    "original": "Whitepaper",
    "short": "Un document technique qui décrit le concept, la technologie et les objectifs d’un projet crypto.",
    "desc": "Le whitepaper est le document fondateur d’un projet crypto. Bitcoin a été lancé via le whitepaper de Satoshi Nakamoto en 2008. Un bon whitepaper explique le problème, la solution, la technologie et la tokenomics. Avant d’investir, il faut le lire. S’il manque ou est vague, c’est souvent un signal d’alerte. Le whitepaper de Stellar décrit SCP et est public."
  },
  "ico": {
    "title": "ICO / Token Sale",
    "original": "ICO – Initial Coin Offering",
    "short": "Une méthode de financement où de nouveaux tokens sont vendus publiquement—comme une IPO.",
    "desc": "Un ICO est comme une IPO pour les projets crypto. Le projet vend de nouveaux tokens pour lever des fonds. Les ICO étaient populaires en 2017–2018, mais souvent non régulées ou frauduleuses. Beaucoup n’ont jamais livré de produit. Aujourd’hui, la réglementation est plus stricte. Alternatives : IEO (Initial Exchange Offering) ou IDO (Initial DEX Offering). Les débutants doivent être très prudents avec les ICO."
  },
  "airdrop": {
    "title": "Airdrop",
    "original": "Airdrop",
    "short": "La distribution gratuite de tokens à des adresses de wallet, souvent pour le marketing ou la communauté.",
    "desc": "Lors d’un airdrop, des utilisateurs reçoivent des tokens gratuits—souvent pour récompenser un soutien précoce, l’activité communautaire ou simplement la détention d’une adresse. Les airdrops sont un outil marketing populaire. Important : un airdrop sérieux ne demande jamais de clés privées ni de paiement préalable. Beaucoup d’airdrops sont des arnaques—ne donne jamais ta clé privée pour en réclamer un. Sur Stellar, les airdrops peuvent être mis en place via les claimable balances."
  },
  "money": {
    "title": "Argent",
    "original": "Money",
    "short": "L'argent est un moyen d'échange universellement accepté pour les biens et services.",
    "desc": "L'argent remplit trois fonctions : c'est un moyen d'échange, une réserve de valeur et une unité de compte. Historiquement, l'argent a pris de nombreuses formes – des coquillages à l'or, en passant par les billets de banque actuels et l'argent numérique. L'argent moderne est principalement adossé à la confiance dans le gouvernement émetteur, et non à des valeurs physiques."
  },
  "fiatCurrency": {
    "title": "Monnaie fiduciaire",
    "original": "Fiat Currency",
    "short": "Monnaie émise par l'État sans adossement à une matière première physique comme l'or.",
    "desc": "Les monnaies fiduciaires comme l'euro, le dollar ou le franc n'ont pas de valeur intrinsèque – leur valeur repose sur la confiance dans l'État émetteur et son économie. Les banques centrales peuvent imprimer des monnaies fiduciaires en quantité illimitée, ce qui peut entraîner de l'inflation. En revanche, l'offre de nombreuses cryptomonnaies est strictement limitée."
  },
  "centralBank": {
    "title": "Banque centrale",
    "original": "Central Bank",
    "short": "Institution étatique qui contrôle la politique monétaire d'un pays ou d'une zone monétaire.",
    "desc": "Les banques centrales comme la Banque centrale européenne (BCE) ou la Réserve fédérale américaine (Fed) contrôlent la masse monétaire, fixent les taux d'intérêt et assurent la stabilité du système financier. Elles peuvent imprimer de la monnaie et détiennent le monopole de l'émission d'espèces. Les cryptomonnaies ont été développées comme alternative aux systèmes monétaires centralisés – sans banque centrale, sans autorité de contrôle unique."
  },
  "inflation": {
    "title": "Inflation",
    "original": "Inflation",
    "short": "Hausse générale du niveau des prix qui réduit le pouvoir d'achat de l'argent.",
    "desc": "Avec l'inflation, l'argent perd de la valeur au fil du temps – on obtient moins pour le même montant. Les causes incluent trop d'argent en circulation, une demande croissante ou des pénuries d'approvisionnement. Beaucoup voient le Bitcoin et d'autres cryptomonnaies à offre limitée comme une protection contre l'inflation, à l'image de l'or. XLM, quant à lui, a un taux d'inflation annuel modéré défini par le réseau."
  },
  "currency": {
    "title": "Devise",
    "original": "Currency",
    "short": "Un système d'échange de valeur reconnu au sein d'un espace économique donné.",
    "desc": "Une devise est le moyen de paiement officiel d'un pays ou d'une région (p. ex. EUR, USD, CHF). Dans le domaine des cryptomonnaies, le terme est souvent utilisé comme synonyme de 'coin' ou 'cryptomonnaie'. La différence avec un 'actif' : une devise sert principalement de moyen d'échange, tandis qu'un actif est un terme plus large désignant toute réserve de valeur – y compris les actions, l'immobilier ou les tokens."
  },
  "cryptography": {
    "title": "Cryptographie",
    "original": "Cryptography",
    "short": "Science de la communication sécurisée par des méthodes de chiffrement mathématiques.",
    "desc": "La cryptographie est le fondement de toutes les technologies blockchain. Elle garantit que les données ne peuvent être lues que par des personnes autorisées et que les transactions ne peuvent pas être falsifiées. Sans la cryptographie, Bitcoin, Stellar ou toute autre cryptomonnaie serait impossible. Le terme vient du grec 'kryptos' (caché) et 'graphein' (écrire)."
  },
  "hash": {
    "title": "Hash",
    "original": "Hash",
    "short": "Une empreinte numérique unique calculée à partir de n'importe quelles données.",
    "desc": "Une fonction de hachage convertit n'importe quelles données (texte, fichiers, transactions) en une chaîne de caractères fixe – par ex. 'a3f8c2...'. Les mêmes données d'entrée produisent toujours le même hash. Si un seul caractère est modifié, le hash change complètement. Cela rend les hashes idéaux pour détecter les manipulations. Dans les blockchains, chaque bloc est identifié de manière unique par son hash."
  },
  "encryption": {
    "title": "Chiffrement",
    "original": "Encryption",
    "short": "Conversion de données lisibles en un format illisible qui ne peut être déchiffré qu'avec la bonne clé.",
    "desc": "Le chiffrement protège les données contre les accès non autorisés. Il existe deux types principaux : le chiffrement symétrique (une clé pour chiffrer et déchiffrer) et le chiffrement asymétrique (clé publique pour chiffrer, clé privée pour déchiffrer). Les portefeuilles et les transactions blockchain utilisent le chiffrement asymétrique."
  },
  "digitalSignature": {
    "title": "Signature numérique",
    "original": "Digital Signature",
    "short": "Preuve cryptographique qu'un message ou une transaction a été autorisé par son propriétaire légitime.",
    "desc": "Une signature numérique fonctionne de manière similaire à une signature manuscrite – sauf qu'elle est infalsifiable. Sur Stellar, vous signez chaque transaction avec votre clé privée. Le réseau peut vérifier avec votre clé publique si la signature est valide – sans jamais voir votre clé privée. Sans signature valide, une transaction est rejetée par le réseau."
  },
  "publicKeyCryptography": {
    "title": "Cryptographie à clé publique",
    "original": "Public-Key Cryptography",
    "short": "Méthode de chiffrement utilisant deux clés liées : une publique et une privée.",
    "desc": "Le principe : ce qui est chiffré avec la clé publique ne peut être déchiffré qu'avec la clé privée – et inversement. Vous pouvez partager librement votre clé publique (= l'adresse de votre portefeuille). Votre clé privée reste secrète. Quiconque connaît votre clé privée a un accès total à votre compte. D'où la règle : ne jamais partager sa clé privée !"
  },
  "keyPair": {
    "title": "Paire de clés",
    "original": "Key Pair",
    "short": "La combinaison d'une clé publique et d'une clé privée qui forment ensemble un compte crypto.",
    "desc": "Une paire de clés se compose de la clé publique (votre adresse que les autres peuvent voir) et de la clé privée (votre mot de passe qui reste secret). Sur Stellar, la clé publique est représentée sous forme d'adresse G, tandis que la clé privée commence par S. La paire de clés est générée mathématiquement et il est pratiquement impossible de la falsifier ou de la deviner."
  },
  "signing": {
    "title": "Signature",
    "original": "Signing",
    "short": "Autoriser une transaction avec la clé privée du titulaire du compte.",
    "desc": "Avant qu'une transaction ne soit exécutée sur le réseau Stellar, elle doit être signée. La clé privée est utilisée pour créer une signature numérique prouvant que le titulaire légitime du compte a approuvé la transaction. Sans signature valide, la transaction est rejetée par le réseau. Pour les comptes multisig, plusieurs signatures sont nécessaires."
  },
  "sequenceNumber": {
    "title": "Numéro de séquence",
    "original": "Sequence Number",
    "short": "Un numéro séquentiel qui identifie de manière unique chaque transaction d'un compte et empêche la double dépense.",
    "desc": "Chaque compte Stellar possède un numéro de séquence qui augmente de 1 à chaque transaction. Une transaction n'est acceptée que si son numéro de séquence correspond exactement à la séquence actuelle du compte +1. Cela empêche qu'une même transaction soit exécutée deux fois. Si vous envoyez plusieurs transactions en même temps, elles doivent être traitées dans le bon ordre."
  },
  "baseReserve": {
    "title": "Réserve de base",
    "original": "Base Reserve",
    "short": "Le montant minimum de XLM qui doit rester sur un compte Stellar et ne peut pas être dépensé.",
    "desc": "Sur Stellar, chaque compte doit détenir un solde minimum en XLM. Celui-ci est calculé à partir de la réserve de base (actuellement 0,5 XLM) multipliée par le nombre d'« entrées » sur le compte (par ex. trustlines, signataires, offres de données). Un compte vide nécessite au moins 1 XLM (2 × 0,5 XLM). Chaque trustline augmente le solde minimum de 0,5 XLM supplémentaire. Ce solde est bloqué tant que les entrées sont actives."
  },
  "coin": {
    "title": "Coin",
    "original": "Coin",
    "short": "La cryptomonnaie native d'une blockchain, existant directement sur celle-ci.",
    "desc": "Un coin est la monnaie 'propre' d'une blockchain. Bitcoin (BTC) est le coin de la blockchain Bitcoin, Ether (ETH) le coin d'Ethereum, XLM le coin de Stellar. Les coins sont créés directement par le protocole réseau et servent principalement à payer les frais de transaction. En revanche, les tokens sont émis par des tiers sur une blockchain existante."
  },
  "coinVsToken": {
    "title": "Coin vs. Token",
    "original": "Coin vs. Token",
    "short": "Les coins sont les monnaies natives d'une blockchain, les tokens sont émis par des tiers sur une blockchain existante.",
    "desc": "La différence principale : un coin existe sur sa propre blockchain (BTC sur Bitcoin, XLM sur Stellar). Un token est créé par quelqu'un sur une blockchain déjà existante – par ex. une entreprise émettant son propre stablecoin sur Stellar. Les tokens n'ont pas besoin de leur propre blockchain. Sur Stellar, les tokens créés sont appelés 'assets'. Au quotidien, les termes sont souvent mélangés, ce qui crée de la confusion."
  },
  "nativeCoin": {
    "title": "Coin natif",
    "original": "Native Coin",
    "short": "Le moyen de paiement originel d'une blockchain, géré par le réseau lui-même.",
    "desc": "Chaque blockchain possède un coin natif utilisé pour les frais de transaction et les fonctions de base du réseau. Sur Stellar, XLM est le coin natif. Il n'existe pas en tant que token d'un tiers, mais est directement intégré au protocole. Le coin natif sert aussi souvent de moyen de prévention du spam – sur Stellar, chaque transaction doit payer de petits frais en XLM."
  },
  "fungibility": {
    "title": "Fongibilité",
    "original": "Fungibility",
    "short": "La propriété d'un actif où chaque unité est identique et interchangeable avec toute autre.",
    "desc": "Un actif fongible est comme un billet de banque : chaque billet de 10 euros vaut autant que n'importe quel autre. Avec des cryptomonnaies comme XLM, BTC ou USDC, chaque unité est identique – un XLM vaut toujours un autre XLM. L'inverse ce sont les NFTs (Tokens Non Fongibles) : chaque NFT est unique et non interchangeable. La fongibilité est une propriété importante pour l'utilisation comme monnaie."
  },
  "wrappedToken": {
    "title": "Wrapped Token",
    "original": "Wrapped Token",
    "short": "Un token qui représente la valeur d'un autre actif sur une blockchain différente.",
    "desc": "Un wrapped token permet d'utiliser les actifs d'une blockchain sur une autre. Exemple : Wrapped Bitcoin (WBTC) est un token sur Ethereum adossé 1:1 à du vrai Bitcoin. L'original est verrouillé dans un contrat intelligent, et en échange le wrapped token est émis. Sur Stellar, Bitcoin ou Ether peuvent être émis comme wrapped tokens par des ancres, permettant de les échanger sur le réseau Stellar."
  },
  "syntheticAsset": {
    "title": "Actif synthétique",
    "original": "Synthetic Asset",
    "short": "Un token qui reproduit le prix d'un actif réel sans le posséder directement.",
    "desc": "Les actifs synthétiques reproduisent la valeur d'autres actifs – par ex. actions, or ou devises – sans posséder l'original. Ils sont sécurisés par des contrats intelligents et des garanties. Un exemple : un token synthétique d'actions Apple suit le cours de l'action réelle, mais c'est un token crypto. Les actifs synthétiques sont un concept DeFi avancé."
  },
  "memeCoin": {
    "title": "Meme Coin",
    "original": "Meme Coin",
    "short": "Une cryptomonnaie basée sur un mème internet ou une blague, généralement sans utilité technique.",
    "desc": "Les meme coins comme Dogecoin (DOGE) ou Shiba Inu (SHIB) sont nés à l'origine comme une plaisanterie, mais ont parfois atteint des valeurs de marché énormes grâce à l'engouement communautaire et l'attention des réseaux sociaux. Ils n'ont généralement aucune valeur technique ajoutée et sont extrêmement spéculatifs. Leur valeur repose presque exclusivement sur le sentiment et les tendances. Pour les débutants, les meme coins sont particulièrement risqués."
  },
  "stellarAsset": {
    "title": "Stellar Asset",
    "original": "Stellar Asset",
    "short": "Tout actif émis sur le réseau Stellar, défini par son code d'actif et l'adresse de l'émetteur.",
    "desc": "Sur Stellar, n'importe qui peut créer son propre actif – une entreprise son token de fidélité, une banque son stablecoin. Chaque actif Stellar est identifié de manière unique par deux composantes : le code de l'actif (par ex. 'USD', 'MOBI', 'USDC') et l'adresse G de l'émetteur (issuer). Deux actifs ayant le même code mais un émetteur différent sont des actifs différents. Pour recevoir un actif Stellar, il faut d'abord établir une trustline vers l'émetteur."
  },
  "issuedAsset": {
    "title": "Actif émis",
    "original": "Issued Asset",
    "short": "Un actif émis par une ancre ou une entreprise sur Stellar représentant une contrepartie réelle.",
    "desc": "Un actif émis est un actif Stellar émis par une ancre qui représente une valeur réelle – par ex. des dollars, des euros ou de l'or. L'ancre détient la contrepartie réelle et émet les tokens correspondants sur Stellar. Les utilisateurs peuvent détenir et échanger ces tokens. Pour récupérer l'actif réel, on échange les tokens auprès de l'ancre (offramp). Des exemples connus sont l'USDC (Circle) ou l'EURC."
  },
  "missingKey": "Clé de glossaire manquante : {{detail}}"
}
