{
  "pageTitle": "Glossaire",
  "pageIntro": "Ici, vous trouverez des termes importants du monde de la blockchain et du réseau Stellar. Tout est expliqué en des mots simples.",
  "searchLabel": "Terme de recherche",
  "searchPlaceholder": "Terme de recherche (z. B. Konto, Account, Muxed)",
  "searchHint": "La recherche trouve des mots et des explications.",
  "noResults": "Pas de correspondance.",
  "groups": {
    "accountsKeys": "Accounts & Keys",
    "multisigSecurity": "Multisig & Account Security",
    "walletsCustody": "Wallets & Custody",
    "tokensAssets": "Token & Assets",
    "transactionsFees": "Transactions & Fees",
    "marketsTrading": "Markets & Trading",
    "networkProtocol": "Network & Protocol",
    "smartContracts": "Contrats intelligents",
    "blockchainBasics": "Principes de base de la blockchain",
    "security": "Security & Fraud"
  },
  "blockchain": {
    "title": "Blockchain",
    "original": "Blockchain",
    "short": "Registre numérique partagé – de nombreux ordinateurs stockent les mêmes entrées.",
    "desc": "Une blockchain est comme un grand livre numérique. De nombreux ordinateurs stockent les mêmes entrées, garantissant que personne ne peut effectuer de modifications en secret."
  },
  "wallet": {
    "title": "Portefeuille",
    "original": "Wallet",
    "short": "Portefeuille numérique qui gère vos clés.",
    "desc": "Un portefeuille est votre bourse numérique. Il gère les clés dont vous avez besoin pour accéder à votre compte et effectuer des transactions. Un portefeuille peut être un programme, une application, ou même simplement un morceau de papier avec votre clé privée."
  },
  "account": {
    "title": "Compte",
    "original": "Account",
    "short": "Un compte blockchain peut détenir des actifs et envoyer des transactions.",
    "desc": "Un compte est l'emplacement sur la blockchain où vos actifs sont détenus. Un compte possède une adresse publique qui commence par G. Plusieurs portefeuilles peuvent accéder au même compte s'ils ont la clé correcte."
  },
  "addressG": {
    "title": "G adresse",
    "original": "G Address",
    "short": "L'adresse principale publique d'un compte Stellar (beginnt mit G).",
    "desc": "L'adresse G est l'adresse principale d'un compte Stellar. Elle commence par la lettre G. Vous la fournissez aux autres pour qu'ils puissent vous envoyer quelque chose."
  },
  "publicKey": {
    "title": "Clé publique",
    "original": "Public Key",
    "short": "Adresse, die du teilen darfst; bei Stellar meist die G‑Adresse.",
    "desc": "La clé publique est l'adresse que vous avez le droit de partager. Dans Stellar, c'est l'adresse G. Les autres l'utilisent pour vous envoyer de l'argent."
  },
  "privateKey": {
    "title": "Clé secrète",
    "original": "Secret Key",
    "short": "Mot de passe pour le compte – ne le partagez jamais.",
    "desc": "La clé secrète est votre mot de passe pour le compte. Quiconque possède cette clé peut déplacer votre argent. Ne la partagez jamais."
  },
  "addressFederation": {
    "title": "Adresse de la fédération",
    "original": "Federation Address",
    "short": "Kurze Adresse wie E‑Mail, zeigt auf eine G‑Adresse.",
    "desc": "Une adresse de fédération ressemble à un e-mail. Exemple : nom*domain.com. Cette adresse courte pointe vers une adresse G régulière. Elle est plus facile à mémoriser."
  },
  "addressMuxed": {
    "title": "Compte multiplexé",
    "original": "Muxed Account",
    "short": "M‑address with additional ID – shares a base account.",
    "desc": "Une adresse M pointe vers un compte Stellar existant mais possède un numéro supplémentaire (ID).\n\nComptes Muxed = Compte G + ID (M-Adresse)\nIls fournissent une association, mais pas de séparation de compte.\nLe solde, les lignes de confiance, les signataires, et les drapeaux sont toujours sur le compte G.\n\nStellar Development Foundation\n\nPar exemple, plusieurs individus ou départements peuvent être distingués sous la même adresse G. Techniquement, l'argent appartient toujours au compte principal."
  },
  "muxedAccountsUseCases": {
    "title": "Cas d'utilisation pour les comptes intermédiaires",
    "original": "Muxed accounts use cases",
    "short": "Exemples, avantages et limites des adresses M en tant qu'aide à la cartographie.",
    "desc": "Entreprise - Exemple\n\nConfiguration :\n- Un compte G de l'entreprise\n- Une adresse M par client/cas d'utilisation (ID)\n\nProcessus :\n- Le client paie à son adresse M\n- Tout est versé sur le compte G de l'entreprise\n- La comptabilité lit l'ID -> attribution unique\n\nConvient pour :\n- Boutiques, fournisseurs de paiements, échanges\n- Références internes sans risques de mémo\n\nAssociation - Exemple\n\nConfiguration :\n- Un compte G de l'association\n- Adresses M pour les membres, départements, objectifs\n\nProcessus :\n- Contribution/don à l'adresse M appropriée\n- Attribution via ID, pas d'erreurs de mémo\n\nConvient pour :\n- Cotisations\n- Revenus affectés\n- Audit facilité\n\nCe que les comptes multiplexés excellent à faire :\n- Attribution d'entrées robuste\n- Un compte, multiples identités\n- Pas besoin de mémo\n- Moins d'erreurs opérationnelles\n\nCe que les comptes multiplexés ne sont pas :\n- Pas de sous-comptes\n- Pas de solde individuel\n- Pas de lignes de crédit individuelles\n- Pas de signataires/droits individuels\n\nCas d'utilisation généralement inappropriés :\n- Paiements de salaires/comptes de paie (benoetigen eigenes G-Konto)\n- Fiducies/séquestres pour tiers (kein rechtlicher Vermoegenstrenner)\n- Sécurité basée sur les rôles (keine getrennten Signer/Thresholds)\n- Séparation de budget ou de limite (keine separaten Salden/Asset-Limits)\n- Comptes séparés pour conformité (KYC/Reporting nicht sauber trennbar)\n\nComparaison (Kurz) :\nAttribuer des paiements : Oui\nSéparation des actifs : Non\nDélégation d'accès : Non\nCompte légalement séparé : Non\nComptabilité interne : Oui\n\nConclusion clé :\nLes comptes multiplexés gèrent des paiements - ils ne remplacent pas les comptes.\nSi contrôle, propriété ou séparation est nécessaire -> propre compte G."
  },
  "multisig": {
    "title": "Multisignature",
    "original": "Multi‑Sig",
    "short": "Des actions importantes nécessitent plus qu'une signature.",
    "desc": "Multi-Sig signifie signatures multiples. Une action importante nécessite plus d'une clé. Exemple : vous et une deuxième clé devez tous deux être d'accord avant qu'une chose soit envoyée. Cela rend le vol plus difficile.",
    "help": {
      "title": "Explication générale d'un compte d'entreprise à signatures multiples (Multi-Signature)",
      "intro": "Une entreprise peut utiliser un compte blockchain partagé dans lequel plusieurs personnes autorisées sont impliquées. En général, au moins trois signataires (Signer) sont inclus, par exemple, la direction, le responsable financier et la conformité/sauvegarde. L'objectif est que chaque personne puisse effectuer des paiements de manière indépendante sans permettre à une seule personne de contrôler ou de prendre le contrôle du compte seule.",
      "problem": "Si un signataire (Signer) dispose d'un poids suffisant pour effectuer des paiements et qu'en même temps il a assez de poids pour les changements de compte, cette personne pourrait supprimer d'autres signataires (Signer) ou ajuster le seuil/pondération (Thresholds) et ainsi prendre le contrôle du compte. À l'inverse, le propriétaire initial ne devrait pas non plus pouvoir facilement exclure d'autres signataires (Signer) sans contrôles et équilibres. Une structure à signatures multiples garantit que les décisions importantes sont toujours prises collectivement par plusieurs personnes.",
      "setupTitle": "Exemple d'une structure multi-signature sécurisée avec trois signataires",
      "setupWeights": "Dans un exemple avec trois rôles égaux, tous reçoivent la même force de signature :\n- Signataire (Signer) A (Management) : Poids 2\n- Signataire (Signer) B (Finanzen) : Poids 2\n- Signataire (Signer) C (Compliance/Backup) : Poids 2",
      "setupThresholds": "Les seuils/poids appropriés sont définis comme suit :\n- Bas (low_threshold) : 1\n- Moyen (med_threshold) : 2 (for payments and other medium actions)\n- Haut (high_threshold) : 4 (pour les modifications structurelles telles que l'ajout/suppression de signataires (Signer) ou la modification du seuil/poids (Thresholds))\nCela garantit que chaque personne autorisée peut réaliser des paiements, mais qu'aucun individu seul ne peut modifier la structure du compte.",
      "behavior": "Avec cette configuration, les paiements peuvent être effectués par n'importe lequel des trois individus éligibles seul, car le poids de chaque individu atteint le seuil moyen. Pour les changements structurels tels que la suppression d'un signataire, l'ajustement des seuils/poids, ou la fusion ou la clôture du compte, le seuil élevé est requis. Cette valeur ne peut être atteinte que lorsque au moins deux des trois signataires signent ensemble. Cette configuration maintient le compte flexible pour une utilisation quotidienne tout en offrant une forte protection contre les abus.",
      "removal": "Wenn eine Person das Unternehmen verlässt oder nicht mehr vertrauenswürdig ist, können zwei der verbleibenden Unterzeichner (Signer) gemeinsam die Signaturrechte dieser Person entfernen. Kein einzelner Unterzeichner (Signer) – weder ein Mitarbeiter noch die Geschäftsführung – kann andere eigenständig aus dem Konto ausschließen. Der Entzug von Berechtigungen erfolgt also immer kontrolliert und nachvollziehbar durch mindestens zwei Verantwortliche.",
      "summary": "Ce type de structure multi-signature permet aux parties individuelles de traiter efficacement les paiements tout en maintenant le contrôle du compte parmi plusieurs participants. Il réduit le risque de prises de contrôle de compte, protège contre les décisions unilatérales et est particulièrement adapté aux comptes d'entreprise où la sécurité et la flexibilité opérationnelle sont importantes.",
      "closeLabel": "Fermer",
      "linkLabel": "Que signifie Multi-Signature ?",
      "glossaryLinkLabel": "Voir dans le glossaire"
    }
  },
  "multisigCorporate": {
    "title": "Multisignature - Exemple",
    "original": "Multi-Signature - Example",
    "short": "Exemple d'une structure multi-signature pour les comptes d'entreprise avec rôles, poids et seuils."
  },
  "trustline": {
    "title": "Ligne de confiance",
    "original": "Trustline",
    "short": "Accord pour détenir un jeton d'un émetteur spécifique.",
    "desc": "Une ligne de confiance est comme un \"Oui, j'accepte ce jeton.\" En la configurant, vous indiquez que votre compte est prêt à recevoir un jeton spécifique d'un émetteur spécifique. Sans une ligne de confiance, vous ne pouvez pas recevoir ce jeton.\n\nExemple : Une ligne de confiance est spécifiée comme CODE:EMETTEUR. Pour EURT de l'émetteur GDUKMGUGDZQK6Y…, elle serait EURT:GDUKMGUGDZQK6Y…"
  },
  "token": {
    "title": "Jeton",
    "original": "Token",
    "short": "Unité numérique – par exemple, argent, points ou crédits.",
    "desc": "Un jeton est une unité numérique sur la blockchain. Un jeton peut représenter de l'argent, des points ou des crédits pour un service."
  },
  "asset": {
    "title": "Actif",
    "original": "Asset",
    "short": "Les jetons sur Stellar sont toujours liés à un émetteur.",
    "desc": "Sur Stellar, un jeton est appelé un actif. Un actif est toujours lié à un compte émetteur. Par exemple, un compte peut émettre un jeton Euro, et ce jeton Euro est alors considéré comme un actif."
  },
  "xlm": {
    "title": "XLM",
    "original": "XLM",
    "short": "Monnaie native de Stellar pour les frais et l'activation.",
    "desc": "XLM est la devise native de Stellar. Vous avez besoin de XLM pour payer les frais et pour ouvrir un nouveau compte."
  },
  "mainnet": {
    "title": "Mainnet",
    "original": "Mainnet",
    "short": "Echtes Stellar‑Netzwerk mit realem Wert.",
    "desc": "Le véritable réseau Stellar avec une valeur réelle. Les transactions sont définitives et les frais sont payés en XLM réel."
  },
  "testnet": {
    "title": "Réseau de test",
    "original": "Testnet",
    "short": "Réseau de formation public sans réelle valeur.",
    "desc": "Un réseau de pratique publique. Les jetons n'ont aucune valeur réelle. Idéal pour apprendre et expérimenter sans risque."
  },
  "memo": {
    "title": "Note de service",
    "original": "Memo",
    "short": "Brève note dans une transaction.",
    "desc": "Un mémo est une petite note que vous pouvez envoyer avec une transaction. Souvent, un échange nécessite un mémo spécifique pour savoir à qui appartient l'argent."
  },
  "transaction": {
    "title": "Transaction",
    "original": "Transaction",
    "short": "Action sur la blockchain, par exemple, paiement ou ligne de confiance.",
    "desc": "Une transaction est une action sur la blockchain, telle que l'envoi d'argent ou l'établissement d'une ligne de confiance. Une fois confirmée, une transaction est enregistrée de manière permanente."
  },
  "fee": {
    "title": "Frais",
    "original": "Fee",
    "short": "Montant très faible par transaction.",
    "desc": "Les frais sont un montant très faible que vous payez à chaque transaction. Les frais vont au réseau. Sur Stellar, les frais sont très bas."
  },
  "ledger": {
    "title": "Grand livre",
    "original": "Ledger",
    "short": "Chaîne de données confirmées et soldes.",
    "desc": "Le grand livre est la chaîne de toutes les données confirmées. Il montre quels comptes détiennent combien et quelles transactions ont eu lieu. Tout le monde peut consulter le grand livre."
  },
  "horizon": {
    "title": "Horizon",
    "original": "Horizon",
    "short": "API‑Dienst, über den Apps mit Stellar sprechen.",
    "desc": "Horizon est le service par lequel les programmes communiquent avec la blockchain Stellar. Notre outil interroge Horizon pour charger les soldes des comptes et les transactions."
  },
  "horizonHistory": {
    "title": "Horizon Histoire",
    "original": "Horizon history depth",
    "short": "Décrit la durée historique des transactions fournie par les serveurs Horizon publics.",
    "desc": "Les serveurs Horizon publics (Mainnet und Testnet) exploités par la Stellar Development Foundation ne fournissent qu'un historique limité – actuellement approximativement un an en rétroaction. Les données plus anciennes ne peuvent plus être récupérées via ces points de terminaison gratuits. Si vous avez besoin de remonter plus loin dans le temps, vous avez essentiellement deux options : (1) vous pouvez exécuter votre propre nœud Horizon avec un historique complet (inklusive History Archives), ou (2) vous pouvez utiliser des services tiers ou payants qui stockent et fournissent des données historiques de Stellar à long terme.",
    "seeAlso": "Entschuldigung für das Missverständnis. Bitte geben Sie den spezifischen Text ein, den Sie ins Französische übersetzt haben möchten."
  },
  "anchor": {
    "title": "Ancre",
    "original": "Anchor",
    "short": "Firma, die Fiat‑Geld mit Stellar verbindet.",
    "desc": "Une ancre est une entreprise qui relie l'argent réel, tel que des euros ou des dollars, avec Stellar. Par exemple, vous donnez à l'ancre des euros et recevez en retour un jeton euro sur Stellar."
  },
  "exchange": {
    "title": "Bourse des valeurs",
    "original": "Exchange",
    "short": "Lieu pour acheter et vendre des jetons.",
    "desc": "Un échange est un lieu où vous pouvez acheter ou vendre des jetons. De nombreux échanges exigent un processus KYC, ce qui signifie vérification de l'identité, avant que vous puissiez retirer de l'argent en euros ou en francs."
  },
  "dex": {
    "title": "DEX (Decentralized Exchange)",
    "original": "Decentralized Exchange",
    "short": "Échange décentralisé directement sur la blockchain.",
    "desc": "DEX signifie Échange Décentralisé. Ici, les personnes échangent directement entre elles sur la blockchain. Il n'y a pas d'opérateur unique. Stellar dispose d'un DEX intégré directement."
  },
  "liquidityPool": {
    "title": "Pool de liquidités",
    "original": "Liquidity Pool",
    "short": "Pool commun avec deux jetons pour un échange immédiat.",
    "desc": "Un pool de liquidité est une réserve partagée contenant deux jetons. Les personnes y déposent les deux jetons. D'autres sont ensuite autorisés à échanger instantanément ces jetons. Les déposants gagnent en retour de petits frais."
  },
  "balanceClaimable": {
    "title": "Solde Réclamable",
    "original": "Claimable Balance",
    "short": "Argent réservé que vous devez encore recevoir.",
    "desc": "Un solde réclamable est de l'argent qui est déjà réservé pour vous, mais que vous devez encore réclamer. Il n'est crédité sur votre compte que lorsque vous l'acceptez."
  },
  "protocolUpdate": {
    "title": "Mise à jour du protocole",
    "original": "Protocol Update",
    "short": "Aktualisierung der Netzwerk‑Regeln.",
    "desc": "Une mise à jour du protocole est une mise à niveau des règles du réseau Stellar, telle que l'ajout de nouvelles fonctionnalités ou des modifications de sécurité. Tous les nœuds du réseau doivent utiliser les mêmes règles."
  },
  "soroban": {
    "title": "Soroban",
    "original": "Soroban",
    "short": "Stellars Smart‑Contract‑System.",
    "desc": "Soroban est le système de contrats intelligents de Stellar. Un contrat intelligent est un code de programme sur la blockchain. Le code peut vérifier de manière indépendante les règles et déclencher des actions sans besoin d'un intermédiaire bancaire."
  },
  "multiSignature": {
    "title": "Multisignature",
    "original": "Multi-Signature",
    "short": "Multiple signatures required; weights + threshold determine the release.",
    "desc": "Dans une configuration multi-signatures, plusieurs clés doivent signer avant qu'une action ne devienne valide. Chaque signataire a un poids, et la somme doit atteindre le seuil requis. Cela augmente la sécurité car une seule clé volée n'est pas suffisante."
  },
  "signer": {
    "title": "Signataire",
    "original": "Signer",
    "short": "Clé publique avec poids, faisant partie de la configuration du compte.",
    "desc": "Un signataire est une clé publique qui appartient à un compte et possède un poids. Sa signature contribue au seuil requis. Plusieurs signataires peuvent collectivement autoriser une transaction.\n\nTypes de signataires :\n- ed25519 (__GARDER_TERME_EN_1__)\n- hashX (__GARDER_TERME_EN_2__)\n- preAuthTx (__GARDER_TERME_EN_3__)\n\nSKM prend en charge uniquement ed25519. Pour des options supplémentaires, visitez https://lab.stellar.org."
  },
  "thresholds": {
    "title": "Seuils",
    "original": "Thresholds",
    "short": "Limites (low/med/high) qui fixent le poids total requis.",
    "desc": "Les seuils définissent combien de signatures pondérées sont nécessaires pour les actions : bas pour les opérations simples, moyen pour les paiements, et élevé pour les changements critiques. La somme des poids des signataires doit atteindre le seuil respectif."
  },
  "masterWeight": {
    "title": "Poids maître",
    "original": "master_weight",
    "short": "Poids de la clé maîtresse ; détermine l'importance accordée à la clé maîtresse.",
    "desc": "Le poids maître est le poids de la clé principale d'un compte. Un poids maître élevé permet à la clé principale de signer de nombreuses actions par elle-même ; une valeur basse nécessite des signataires supplémentaires."
  },
  "accountConfig": {
    "title": "Configuration du compte",
    "original": "Account Configuration",
    "short": "L'interaction entre les signataires et les seuils détermine la sécurité du compte.",
    "desc": "La configuration du compte définit quels signataires existent avec quels poids et quels seuils s'appliquent. Les modifications des signataires ou des seuils sont critiques pour la sécurité, car elles déterminent combien de signatures sont nécessaires."
  },
  "distributedNetwork": {
    "title": "Réseau distribué",
    "original": "Distributed Network",
    "short": "De nombreux ordinateurs travaillent ensemble au lieu qu'un seul prenne toutes les décisions.",
    "desc": "Imaginez un marché où de nombreux traders connaissent les mêmes règles. Si un participant se retire, le marché continue de fonctionner car d'autres peuvent reprendre le relais. Cela maintient le système stable et plus difficile à manipuler."
  },
  "node": {
    "title": "Nœud",
    "original": "Node",
    "short": "Un seul participant dans le réseau.",
    "desc": "Un nœud est comme un gardien de registre qui détient une copie des données. Il vérifie les nouvelles entrées et les transmet. De nombreux nœuds ensemble rendent le réseau fiable."
  },
  "block": {
    "title": "Bloc",
    "original": "Block",
    "short": "Un bloc est un ensemble d'entrées.",
    "desc": "Comme une page dans un livre de caisse, un bloc recueille plusieurs transactions. Une fois qu'il est plein, il est complété et ajouté à la chaîne. Cela crée l'histoire étape par étape."
  },
  "consensusMechanism": {
    "title": "Mécanisme de consensus",
    "original": "Consensus Mechanism",
    "short": "Règles sur lesquelles tout le monde s'accorde pour accepter des entrées valides.",
    "desc": "C'est comme lorsqu'un groupe décide quelle facture est valide. Cela empêche quiconque de faire des modifications en secret. Différentes blockchains utilisent des méthodes différentes, mais le but est toujours d'atteindre un consensus."
  },
  "finality": {
    "title": "Caractère définitif / Définivité",
    "original": "Finality",
    "short": "La certitude qu'une transaction est définitive.",
    "desc": "Lorsque quelque chose est final, cela ressemble à un relevé bancaire confirmé. Vous n'avez plus à vous attendre à ce qu'il soit annulé. Cela crée de la confiance."
  },
  "immutability": {
    "title": "Immutabilité",
    "original": "Immutability",
    "short": "Les entrées ne doivent pas être modifiées rétroactivement.",
    "desc": "Semblable à un registre : toute suppression après coup est visible. Les modifications sont ajoutées comme une nouvelle entrée, sans être écrasées. Cela rend l'historique traçable."
  },
  "decentralization": {
    "title": "Décentralisation",
    "original": "Decentralization",
    "short": "Aucune autorité centrale ne contrôle tout.",
    "desc": "Au lieu d'un seul coffre-fort, il y a de nombreux coffres-forts contenant les mêmes informations. Les décisions émergent de l'interaction de nombreux participants. Cela rend le système plus robuste."
  },
  "publicBlockchain": {
    "title": "Blockchain publique",
    "original": "Public Blockchain",
    "short": "Ouvert à tous ceux qui souhaitent participer.",
    "desc": "Tout le monde peut participer et consulter les données, similaire à un tableau d'affichage public. Cela augmente la transparence, mais chaque action est visible par tous. Des règles garantissent que personne ne peut tricher."
  },
  "privateBlockchain": {
    "title": "Blockchain privé",
    "original": "Private Blockchain",
    "short": "Accès réservé aux participants sélectionnés uniquement.",
    "desc": "Comme un livre de caisse d'entreprise que seuls les employés sont autorisés à voir. Cela peut être plus rapide et mieux contrôlé, mais c'est moins ouvert. La confiance est ici établie par l'organisation."
  },
  "permissionlessBlockchain": {
    "title": "Blockchain sans permission",
    "original": "Permissionless Blockchain",
    "short": "Tout le monde est autorisé à participer sans permission.",
    "desc": "Comme un marché auquel tout le monde peut participer. Cela réduit les obstacles, mais peut nécessiter davantage de règles pour rester équitable. Des exemples incluent de nombreuses blockchains publiques."
  },
  "permissionedBlockchain": {
    "title": "Blockchain autorisée",
    "original": "Permissioned Blockchain",
    "short": "Participation uniquement sur autorisation.",
    "desc": "Comme un club avec une liste de membres. Cela peut créer des responsabilités claires. Cependant, c'est moins ouvert."
  },
  "seedPhrase": {
    "title": "Théorème de restauration",
    "original": "Seed Phrase / Recovery Phrase",
    "short": "Une liste de mots avec laquelle vous pouvez restaurer votre portefeuille.",
    "desc": "Elle est comme la clé de secours de votre coffre-fort. Celui qui la possède peut restaurer votre portefeuille. Par conséquent, elle ne devrait jamais être stockée en ligne."
  },
  "selfCustody": {
    "title": "Auto-détention",
    "original": "Self-Custody",
    "short": "Vous gardez vos clés vous-même.",
    "desc": "Comme de l'argent liquide dans votre propre coffre-fort : vous avez le contrôle, mais aussi la responsabilité. Si vous perdez l'accès, personne ne peut vous aider. Pour les débutants, la prudence est particulièrement importante."
  },
  "custodian": {
    "title": "Gardien",
    "original": "Custodian",
    "short": "Un fournisseur de services conserve vos clés pour vous.",
    "desc": "Comme une banque qui gère votre compte. Cela peut être pratique, mais cela vous enlève le contrôle total. Vous devez lui faire confiance."
  },
  "hardwareWallet": {
    "title": "Portefeuille matériel",
    "original": "Hardware Wallet",
    "short": "Un dispositif physique pour vos clés.",
    "desc": "Comme un petit coffre-fort dans votre poche. Les clés restent sur l'appareil et ne vont pas en ligne. Cela protège contre de nombreuses attaques en ligne."
  },
  "hotWallet": {
    "title": "Portefeuille chaud",
    "original": "Hot Wallet",
    "short": "Un portefeuille avec accès à internet.",
    "desc": "Comme un portefeuille dans une veste : pratique mais plus vulnérable. Idéal pour de petits montants et une utilisation quotidienne. Pas idéal pour de grosses sommes."
  },
  "coldWallet": {
    "title": "Portefeuille froid",
    "original": "Cold Wallet",
    "short": "Un portefeuille sans connexion Internet.",
    "desc": "Comme un coffre-fort au sous-sol. Très sécurisé, mais peu pratique pour une utilisation quotidienne. Convient pour un stockage à long terme."
  },
  "cryptocurrency": {
    "title": "Cryptomonnaie",
    "original": "Cryptocurrency",
    "short": "Une monnaie numérique qui est envoyée directement entre les personnes.",
    "desc": "Comme de l'argent liquide numérique, mais sans banque. Vous pouvez l'envoyer directement aux autres. La valeur peut fluctuer."
  },
  "altcoin": {
    "title": "Altcoin",
    "original": "Altcoin",
    "short": "Toutes les cryptomonnaies sauf le Bitcoin.",
    "desc": "Comme d'autres marques sur le marché en plus de l'acteur dominant. Certaines sont bien connues, beaucoup sont petites. La qualité et le risque varient considérablement."
  },
  "stablecoin": {
    "title": "Stablecoin",
    "original": "Stablecoin",
    "short": "Cryptomonnaie avec une valeur potentiellement stable.",
    "desc": "Comme une monnaie numérique indexée sur une devise standard. Cela rend son prix plus stable. Toutefois, la confiance envers le fournisseur reste importante."
  },
  "utilityToken": {
    "title": "Jeton d'utilisation",
    "original": "Utility Token",
    "short": "Un jeton qui peut être utilisé pour accéder à un service.",
    "desc": "Comme un bon sur un stand de marché. Il offre un accès ou une réduction. Sa valeur dépend de l'utilité du service."
  },
  "securityToken": {
    "title": "Jetons de sécurité",
    "original": "Security Token",
    "short": "Un jeton avec des caractéristiques de sécurité.",
    "desc": "Comme un certificat d'actions. Il peut promettre des droits ou des bénéfices. Des règles plus strictes s'appliquent souvent à cela."
  },
  "governanceToken": {
    "title": "Jeton de gouvernance",
    "original": "Governance Token",
    "short": "Un jeton pour avoir son mot à dire dans les règles.",
    "desc": "Comme une carte de vote dans un club. Ceux qui ont des jetons peuvent voter sur les règles. Cela signifie responsabilité."
  },
  "liquidityToken": {
    "title": "Jetons de liquidité / jetons LP",
    "original": "Liquidity Token",
    "short": "Un jeton pour la liquidité fournie.",
    "desc": "Comme un reçu montrant que vous avez contribué de l'argent à un fonds commun. Vous recevez des frais proportionnels. La valeur peut fluctuer."
  },
  "nft": {
    "title": "Jeton non fongible / NFT",
    "original": "Non-Fungible Token",
    "short": "Un jeton numérique unique.",
    "desc": "Comme un objet de collection signé. Il représente quelque chose d'unique, ce n'est pas une pièce interchangeable. La valeur dépend de la demande."
  },
  "cbdc": {
    "title": "Monnaie numérique de banque centrale / MNBC",
    "original": "Central Bank Digital Currency",
    "short": "Monnaie numérique émise par une banque centrale.",
    "desc": "Comme de l'argent liquide numérique de l'État. Ce serait de l'argent officiel, mais sous forme numérique. Les détails dépendent du pays spécifique."
  },
  "transactionStatus": {
    "title": "Statut de la transaction",
    "original": "Transaction Status",
    "short": "Indique si une transaction est encore ouverte ou déjà terminée.",
    "desc": "Comme le suivi de colis : en attente, confirmé ou échoué. De cette manière, vous pouvez voir si tout s'est bien déroulé. Parfois, cela prend un peu de temps."
  },
  "gasFee": {
    "title": "Frais de gas",
    "original": "Gas Fee",
    "short": "Une redevance pour le travail informatique dans le réseau.",
    "desc": "Comme des frais de traitement à un stand de marché. Plus c'est fréquenté, plus cela peut devenir cher. Toutes les blockchains ne l'appellent pas gas."
  },
  "onChain": {
    "title": "Sur la chaîne",
    "original": "On-Chain",
    "short": "Se produit directement sur la blockchain.",
    "desc": "Comme une entrée directement dans le grand livre. Tout le monde peut la voir. C'est transparent, mais souvent plus lent ou plus coûteux."
  },
  "offChain": {
    "title": "Hors chaîne",
    "original": "Off-Chain",
    "short": "Se produit en dehors de la blockchain.",
    "desc": "Comme un accord verbal qui est ensuite consigné dans le registre. Cela peut être plus rapide et plus économique. La confiance joue ici un rôle plus important."
  },
  "liquidity": {
    "title": "Liquidité",
    "original": "Liquidity",
    "short": "Montre à quel point quelque chose peut être facilement géré.",
    "desc": "Le nombre d'acheteurs et de vendeurs qu'il y a. Une haute liquidité signifie que vous pouvez échanger rapidement sans affecter significativement le prix. Une faible liquidité donne une sensation de lenteur."
  },
  "volatility": {
    "title": "Volatilité",
    "original": "Volatility",
    "short": "Quelle est la fluctuation des prix.",
    "desc": "Comme un marché avec de fortes fluctuations de prix. Une haute volatilité signifie des opportunités, mais aussi des risques. Pour les débutants, cela peut être stressant."
  },
  "marketCap": {
    "title": "Capitalisation boursière",
    "original": "Market Capitalization",
    "short": "La valeur totale d'une pièce ou d'un projet.",
    "desc": "Comme la valeur totale de tous les biens sur un marché. Elle est approximativement dérivée du prix multiplié par la quantité en circulation. Les grandes valeurs semblent plus stables, mais elles ne le sont pas automatiquement."
  },
  "circulatingSupply": {
    "title": "Quantité de circulation",
    "original": "Circulating Supply",
    "short": "La quantité de pièces effectivement en circulation.",
    "desc": "Comme le nombre de pièces qui sont réellement sur le marché. Tout ce qui existe n'est pas encore en circulation. Cela influence le prix."
  },
  "priceDiscovery": {
    "title": "Tarification",
    "original": "Price Discovery",
    "short": "C'est ainsi que le prix est déterminé par l'offre et la demande.",
    "desc": "C'est comme un marché : l'offre et la demande se rencontrent. De nombreuses petites décisions déterminent le prix. Il n'y a pas d'interrupteur fixe."
  },
  "spread": {
    "title": "Plage de négociation",
    "original": "Spread",
    "short": "La différence entre le prix d'achat et le prix de vente.",
    "desc": "Comme l'écart entre l'offre et la demande dans un magasin. Plus l'écart est réduit, plus cela semble équitable. Les écarts importants rendent les transactions plus coûteuses."
  },
  "phishing": {
    "title": "Hameçonnage",
    "original": "Phishing",
    "short": "Fraude par le biais de fausses nouvelles ou de faux sites web.",
    "desc": "Comme un faux email bancaire qui vous attire dans un piège. Le but est que vous divulguiez vos identifiants de connexion. Ne cliquez jamais sur des liens sans réfléchir."
  },
  "smartContract": {
    "title": "Contrat intelligent",
    "original": "Smart Contract",
    "short": "Un programme qui exécute automatiquement des règles fixes.",
    "desc": "Comme une machine qui répond selon des règles fixes. Elle exécute les accords automatiquement. Cela économise la confiance mais nécessite des règles claires."
  },
  "programmableLogic": {
    "title": "Règles automatisées",
    "original": "Programmable Logic",
    "short": "Règles qui s'exécutent automatiquement lorsqu'un événement survient.",
    "desc": "Comme une règle if-then dans un automate. Cela permet de contrôler les processus sans intervention manuelle à chaque fois. C'est ainsi que sont créés des contrats numériques simples."
  },
  "networkCongestion": {
    "title": "Utilisation du réseau",
    "original": "Network Congestion",
    "short": "S'il y a un grand nombre de transactions en attente simultanément.",
    "desc": "Comme un embouteillage sur l'autoroute. Les transactions prennent plus de temps et les frais peuvent augmenter. Avec moins de trafic, cela redevient plus rapide."
  },
  "blockchainTypes": {
    "title": "Types de blockchain",
    "original": "Blockchain Types",
    "short": "Il existe différents types de blockchains avec des objectifs différents.",
    "desc": "Comme différents types de véhicules pour différents itinéraires. Certains sont conçus pour les paiements, d'autres pour les programmes. Il vaut la peine de connaître le but."
  },
  "paymentBlockchain": {
    "title": "Blockchain de paiement",
    "original": "Payment Blockchain",
    "short": "Une blockchain conçue pour des paiements rapides.",
    "desc": "Comme un registre rapide pour l'argent. L'accent est mis sur des transferts peu coûteux et rapides. Les fonctionnalités sont souvent intentionnellement simplifiées."
  },
  "smartContractBlockchain": {
    "title": "Blockchain de contrats intelligents",
    "original": "Smart Contract Blockchain",
    "short": "Une blockchain capable d'exécuter des programmes et des applications.",
    "desc": "Comme un marché avec de nombreux distributeurs automatiques. En plus des paiements, des règles et des applications peuvent y fonctionner. Cela les rend polyvalents, mais souvent plus complexes."
  },
  "blockchainComparison": {
    "title": "Comparaison des blockchains",
    "original": "Blockchain Comparison",
    "short": "Une comparaison révèle les forces et faiblesses des différentes blockchains.",
    "desc": "Comme la comparaison des banques ou des marchés : chacun a ses forces et ses faiblesses. Les facteurs importants sont le coût, la rapidité et la sécurité. Il n'existe pas de système parfait pour tout."
  },
  "stellarVsBitcoinVsEthereum": {
    "title": "Stellar vs. Bitcoin vs. Ethereum",
    "original": "Stellar vs. Bitcoin vs. Ethereum",
    "short": "Trois blockchains bien connues avec des focalisations différentes.",
    "desc": "Le Bitcoin est comme de l'or numérique et est souvent considéré comme une réserve de valeur. Ethereum est comme une plateforme pour des programmes et des applications. Stellar est axé sur des paiements abordables."
  },
  "missingKey": "Clé de glossaire manquante : {{detail}}"
}