{
  "title": "Créer un compte + multisignature",
  "menu": "Créer un compte + Multisig",
  "menuHint": "Créez un nouveau compte et configurez éventuellement la signature multiple.",
  "hint": "Créez un nouveau compte, activez-le et configurez éventuellement la signature multiple.",
  "generateKeys": "Générer une clé",
  "enableMultisig": "Activer la multisignature.",
  "instructions": {
    "public": "Partagez cette clé publique avec d'autres pour les paiements.",
    "secret": "Gardez cette clé secrète en sécurité ; ne la partagez jamais."
  },
  "generateFirst": "Veuillez d'abord générer une paire de clés.",
  "confirmLowBalance": "Le solde de départ {bal} XLM est inférieur à la réserve recommandée de {req} XLM (Signataires : {count}). Voulez-vous continuer ?",
  "activated": "Le compte a été activé. Hachage : {hash}",
  "activatedTestnet": "Le compte a été activé sur le réseau de test via Friendbot.",
  "alreadyActive": "Le compte est déjà activé.",
  "createdNoSigners": "Compte créé, multisig non configuré.",
  "createdAndConfigured": "Compte créé et multisig configuré. Hash : {hash}",
  "info": {
    "more": "Plus d'informations",
    "keysOnPage": {
      "title": "Clé sur cette page",
      "text": "Sur cette page, des clés sont générées. Gardez-les en sécurité et ne les partagez pas."
    },
    "title": "Informations importantes",
    "secureKeys": {
      "title": "Clé privée sécurisée",
      "text": "Der Public Key (öffentlicher Schlüssel) kann sicher geteilt werden – er ist wie eine Kontonummer.\\n\\nDer Secret Key (Geheimschlüssel) ist der Zugang zu Ihrem Konto. Behandeln Sie ihn wie ein Passwort:\\n• Speichern Sie ihn NIEMALS in Cloud-Diensten, E-Mails oder unsicheren Notizen\\n• Notieren Sie ihn auf Papier oder verwenden Sie einen Hardware-Wallet\\n• Erstellen Sie mehrere Backups und lagern Sie diese an sicheren, getrennten Orten\\n• Bei Verlust des Secret Keys ist der Zugang zum Konto unwiderruflich verloren"
    },
    "multisigSection": {
      "title": "Multisig (Mehrfachsignatur)",
      "text": "Avec Multisig, vous pouvez définir plusieurs signataires pour votre compte. Les transactions nécessitent ensuite des signatures de plusieurs personnes, par exemple 2 sur 3.\n\nAvantages :\n• Sécurité accrue (ein kompromittierter Key reicht nicht)\n• Comptes communs (z. B. Firmen, Partnerschaften)\n• Récupération d'urgence (mehrere Backups bei verschiedenen Personen)\n\nATTENTION : Testez d'abord Multisig sur le testnet avant de le déployer sur le mainnet ! Une mauvaise configuration peut entraîner une perte d'accès au compte."
    },
    "diagram": {
      "title": "Expiration de la signature"
    }
  },
  "activateHint": "L'activation est nécessaire pour que le compte existe. Sur le réseau de test, cela peut être fait via Friendbot, et sur le réseau principal via \"Créer un compte\" à partir d'un portefeuille existant.",
  "activateNow": "Activez le compte immédiatement.",
  "activateOnly": "Activez simplement",
  "balanceWarning": "Le solde initial est probablement trop bas pour ajouter les {{count}} signataires supplémentaires (réserve minimale : {{req}} XLM).",
  "createButton": "Créer / Configurer une signature multiple",
  "mainnetActivateNote": "Remarque : Des réserves supplémentaires sont nécessaires pour le multisig. 1 XLM n'est souvent pas suffisant.",
  "reserve": {
    "base": "Réserve de base par entrée : {{val}} XLM",
    "recommended": "Solde de départ recommandé : {{val}} XLM (inkl. Puffer)",
    "required": "Réserve Minimum Obligatoire (neu): {{val}} XLM"
  },
  "signersCountLimit": "Remarque : Limite du réseau (Stellar) : max. 20 signataires supplémentaires.",
  "startingBalance": "Crédit initial (XLM)",
  "keyWarning": {
    "title": "⚠️ Sécurisez votre clé maintenant !",
    "text1": "Vous avez généré une nouvelle paire de clés.",
    "text2": "Assurez-vous d'avoir sécurisé LES DEUX clés IMMÉDIATEMENT avant de continuer.",
    "list1": "Clé publique : votre adresse de compte, qui peut être partagée",
    "list2": "Clé secrète : Votre mot de passe – NE le partagez JAMAIS et ne le stockez pas en ligne !",
    "list3": "Si la clé secrète est perdue, l'accès est irrémédiablement perdu.",
    "confirm": "J'ai sécurisé les deux clés."
  },
  "muxedId": "ID multiplexées",
  "muxedInfo": "Avec le Muxed-ID, une M-address (M...) est créée. Elle pointe vers le même compte que l'adresse régulière (G...).",
  "muxedIdInvalid": "L'ID multiplexé doit être un entier compris entre 0 et 18 446 744 073 709 551 615.",
  "muxedAddress": "Adresse multiplexée",
  "muxedActivationInfo": "Les adresses muxed sont des adresses alias. Elles n'ont pas besoin d'être activées séparément."
}
