{
  "title": "Explication générale d'un compte d'entreprise à signatures multiples (Multi-Signature)",
  "intro": "Une entreprise peut utiliser un compte blockchain partagé impliquant plusieurs personnes autorisées. En général, au moins trois signataires (Signer) sont impliqués, par exemple, la direction, le responsable financier et le responsable de la conformité/sauvegarde. L'objectif est que chaque personne puisse exécuter des paiements de manière indépendante, sans qu'une seule personne puisse contrôler ou prendre le compte en charge seule.",
  "problem": "Si un signataire (Signer) possède suffisamment de poids pour exécuter des paiements et possède simultanément assez de poids pour effectuer des modifications de compte, cette personne pourrait retirer d'autres signataires (Signer) ou ajuster le seuil/la pondération (Thresholds) et ainsi prendre le contrôle du compte. À l'inverse, le propriétaire d'origine ne devrait pas pouvoir exclure facilement d'autres signataires (Signer) sans contrôles et contrepoids. Une structure à signatures multiples garantit que les décisions importantes sont toujours prises conjointement par plusieurs personnes.",
  "setupTitle": "Exemple d'une structure multi-signature sécurisée avec trois signataires",
  "setupWeights": "Dans un exemple avec trois rôles d'égale importance, tous reçoivent la même force de signature :\n- Signataire (Signer) A (Management) : Poids 2\n- Signataire (Signer) B (Finanzen) : Poids 2\n- Signataire (Signer) C (Compliance/Backup) : Poids 2",
  "setupThresholds": "Des seuils/poids appropriés sont définis :\n- Faible (low_threshold) : 1\n- Moyen (med_threshold) : 2 (for payments and other medium actions)\n- Élevé (high_threshold) : 4 (pour des changements structurels tels que l'ajout/retrait de signataires (Signer) ou la modification du seuil/poids (Thresholds))\nCela permet à chaque individu autorisé d'exécuter des paiements, mais aucune personne seule ne peut modifier la structure du compte de manière autonome.",
  "behavior": "Avec cette configuration, les paiements peuvent être exécutés par l'un quelconque des trois individus autorisés, car le poids individuel atteint toujours le seuil moyen. Pour des changements structurels tels que la suppression d'un signataire, l'ajustement des seuils/poids, ou la fusion ou la fermeture du compte, le seuil élevé est requis. Cette valeur ne peut être atteinte que si au moins deux des trois signataires signent ensemble. De cette façon, le compte reste flexible dans son utilisation quotidienne tout en étant bien protégé contre les abus.",
  "removal": "Si une personne quitte l'entreprise ou n'est plus digne de confiance, deux des signataires restants (Signer) peuvent conjointement retirer les droits de signature de cette personne. Aucun signataire individuel (Signer) – qu'il s'agisse d'un employé ou de la direction – ne peut exclure les autres du compte de manière autonome. La révocation des autorisations se fait donc toujours de manière contrôlée et traçable par au moins deux responsables.",
  "summary": "Ce type de structure à signatures multiples permet à des personnes individuelles de traiter des paiements efficacement tout en maintenant le contrôle du compte avec plusieurs parties. Il réduit le risque de prises de contrôle de compte, protège contre les décisions unilatérales et est particulièrement adapté aux comptes d'entreprise où la sécurité et la flexibilité opérationnelle sont importantes.",
  "closeLabel": "Fermer",
  "linkLabel": "Que signifie multi-signature ?"
}