{
  "title": "Explication générale d'un compte d'entreprise à signatures multiples (Multi-Signature)",
  "intro": "Une entreprise peut utiliser un compte blockchain commun impliquant plusieurs personnes autorisées. En général, au moins trois signataires (Signer) sont impliqués, tels que la direction, le responsable financier et la conformité/backup. L'objectif est que des personnes individuelles puissent exécuter des paiements de manière indépendante, sans qu'une seule personne ait le contrôle exclusif ou ne prenne le contrôle du compte.",
  "problem": "Si un signataire (Signer) dispose de suffisamment de poids pour exécuter des paiements et simultanément suffisamment de poids pour effectuer des changements de compte, cette personne pourrait supprimer d'autres signataires (Signer) ou ajuster le seuil/pondération (Thresholds) et ainsi prendre le contrôle du compte. Inversement, le propriétaire original ne devrait pas non plus pouvoir exclure d'autres signataires (Signer) sans freins et contrepoids. Une structure multi-signatures garantit que les décisions importantes sont toujours soutenues collectivement par plusieurs personnes.",
  "setupTitle": "Exemple d'une structure multi-signature sécurisée avec trois signataires",
  "setupWeights": "Dans un exemple avec trois rôles équivalents, tous reçoivent la même force de signature :\n- Signataire (Signer) A (management) : poids 2\n- Signataire (Signer) B (Finanzen) : poids 2\n- Signataire (Signer) C (Compliance/Backup) : poids 2",
  "setupThresholds": "Des seuils/pondérations appropriés sont définis :\n- Faible (low_threshold) : 1\n- Moyen (med_threshold) : 2 (for payments and other medium actions)\n- Élevé (high_threshold) : 4 (pour des changements structurels comme l'ajout/la suppression de signataires (Signer) ou la modification du seuil/pondération (Thresholds))\nCette configuration permet à chaque personne autorisée d'effectuer des paiements, mais aucune personne seule ne peut modifier la structure du compte.",
  "behavior": "Avec cette configuration, les paiements peuvent être effectués individuellement par l'une des trois personnes autorisées, car le poids de chaque individu atteint le seuil moyen/Threshold. Cependant, pour les changements structurels tels que la suppression d'un signataire (Signers), l'ajustement des seuils/pondérations ou la fusion ou la clôture du compte, le seuil/pondération élevé(e) (high_threshold) est requis(e). Cette valeur ne peut être atteinte que si au moins deux des trois signataires (Signer) signent ensemble. De cette manière, le compte reste flexible pour un usage quotidien tout en étant bien protégé contre une utilisation abusive.",
  "removal": "Si une personne quitte l'entreprise ou n'est plus digne de confiance, deux des signataires restants (Signer) peuvent ensemble révoquer les droits de signature de cette personne. Aucun signataire seul (Signer) – qu'il s'agisse d'un employé ou de la direction – ne peut exclure quelqu'un du compte de manière autonome. La révocation des autorisations se fait donc toujours de manière contrôlée et traçable, avec l'accord d'au moins deux responsables.",
  "summary": "Ce type de structure à signatures multiples permet à des personnes individuelles de traiter les paiements efficacement tout en gardant le contrôle du compte entre les mains de plusieurs parties. Il réduit le risque de prise de contrôle du compte, protège contre les décisions unilatérales, et est particulièrement adapté aux comptes d'entreprise où la sécurité et la flexibilité opérationnelle sont importantes.",
  "closeLabel": "Fermer",
  "linkLabel": "Que signifie Multi-Signature ?"
}