{
  "title": "Explication générale d'un compte d'entreprise à signatures multiples (Multi-Signature)",
  "intro": "Une entreprise peut utiliser un compte blockchain partagé impliquant plusieurs personnes autorisées. En général, au moins trois signataires (Signer) sont impliqués, tels que la direction, le responsable financier et le responsable de la conformité/de secours. L'objectif est que les individus puissent effectuer des paiements de manière indépendante, sans qu'une seule personne puisse contrôler ou prendre le contrôle du compte à elle seule.",
  "problem": "Si un signataire (Signer) a suffisamment de poids pour exécuter des paiements et en même temps suffisamment de poids pour apporter des changements au compte, cette personne pourrait retirer d'autres signataires (Signer) ou ajuster le seuil/pondération (Thresholds), prenant ainsi le contrôle du compte. Inversement, le propriétaire original ne devrait pas être en mesure d'exclure simplement d'autres signataires (Signer) sans des contrôles et des équilibres. Une structure multi-signature garantit que les décisions importantes sont toujours soutenues de manière collaborative par plusieurs personnes.",
  "setupTitle": "Exemple d'une structure multi-signature sécurisée avec trois signataires",
  "setupWeights": "Dans un exemple avec trois rôles égaux, tous reçoivent la même force de signature :\n- Signataire (Signer) A (management) : poids 2\n- Signataire (Signer) B (Finanzen) : poids 2\n- Signataire (Signer) C (Compliance/Backup) : poids 2",
  "setupThresholds": "Les seuils/pondérations appropriés sont définis comme suit :\n- Bas (low_threshold) : 1\n- Moyen (med_threshold) : 2 (for payments and other medium actions)\n- Élevé (high_threshold) : 4 (pour des changements structurels tels que l'ajout/la suppression de signataires (Signer) ou la modification du seuil/poids (Thresholds))\nCela permet à chaque personne autorisée d'exécuter des paiements, mais aucune personne seule ne peut modifier la structure du compte.",
  "behavior": "Avec cette configuration, les paiements peuvent être effectués individuellement par l'une des trois personnes autorisées, puisque le poids individuel atteint le seuil moyen. Cependant, les changements structurels, tels que la suppression d'un signataire, l'ajustement des seuils/des pondérations ou la fusion ou la fermeture du compte, nécessitent un seuil élevé. Cette valeur ne peut être atteinte que lorsque au moins deux des trois signataires signent ensemble. Cette configuration maintient le compte flexible pour un usage quotidien tout en offrant une forte protection contre les abus.",
  "removal": "Lorsqu'une personne quitte l'entreprise ou n'est plus digne de confiance, deux des signataires restants (Signer) peuvent conjointement retirer les droits de signature de cette personne. Aucun signataire individuel (Signer) – qu'il s'agisse d'un employé ou de la direction – ne peut exclure indépendamment d'autres personnes du compte. Le retrait des autorisations se fait donc toujours de manière contrôlée et traçable par au moins deux responsables.",
  "summary": "Ce type de structure à signatures multiples permet à des personnes individuelles de traiter des paiements de manière efficace, tout en maintenant le contrôle du compte entre plusieurs parties. Il réduit le risque de prises de contrôle de compte, protège contre les décisions unilatérales et est particulièrement adapté aux comptes d'entreprise où la sécurité et la flexibilité opérationnelle sont importantes.",
  "closeLabel": "Fermer",
  "linkLabel": "Que signifie la Multi-Signature ?"
}