{
  "info": "N'entrez votre clé secrète que si vous souhaitez signer des transactions. Sans clé secrète, vous ne pouvez que lire.",
  "clearSession": "Supprimer le secret de session",
  "clearSessionHint": "Supprimez la clé secrète mise en cache de la session.",
  "mismatch": "La clé secrète saisie ne correspond pas à la clé publique chargée.",
  "cleared": "Clé secrète supprimée de la session",
  "empty": "Le champ de la clé secrète est vide.",
  "invalid": "Clé secrète invalide.",
  "label": "Entrez la clé secrète source (S-Key)",
  "placeholder": "par ex.",
  "valid": "✅ La clé secrète est valide.",
  "remember": {
    "label": "Rappelez-vous la clé secrète pour cette session.",
    "hint": "Lorsqu'il est activé, la clé sera stockée jusqu'à la fermeture de l'onglet et réutilisée pour des paiements ultérieurs."
  },
  "addSigner": "Ajouter un signataire supplémentaire",
  "showMultisigInfo": "Afficher les informations multisignatures",
  "hideMultisigInfo": "Masquer les informations multisig",
  "multipleSignersInfo": "Cette action nécessite plusieurs signatures. Veuillez fournir suffisamment de clés secrètes pour atteindre le seuil.",
  "multisigOptions": {
    "title": "Options de signature pour ce compte multisig",
    "distributed": {
      "title": "Standard : Flux Multisignature Distribué",
      "body": "Par défaut, cette session signe uniquement avec votre propre clé privée. Des signatures supplémentaires sont ajoutées via des fichiers XDR exportés ou un ID de travail d'autres signataires."
    },
    "localAll": {
      "title": "Saisissez toutes les signatures localement.",
      "body": "Choisissez cette option uniquement si vous contrôlez toutes les clés secrètes associées à ce compte (z. B. nach einer Kontorettung mit mehreren Signern). Le Stellar Account Manager rassemblera alors toutes les signatures localement et enverra la transaction directement à Horizon.",
      "checkboxLabel": "Entrez toutes les signatures dans ce dialogue localement et envoyez-les directement.",
      "warning": "Remarque : Si vous entrez toutes les signatures localement, toutes les clés secrètes seront présentes dans cette session. N'utilisez cette option que sur des appareils de confiance."
    }
  },
  "multisigInfo": {
    "summary": {
      "single": "Ce compte utilise une seule signature.",
      "multi": "Ce compte utilise plusieurs signatures (Multisig)."
    },
    "requiredThreshold": "Seuil requis ({{level}}) : {{value}}",
    "thresholdLabel": "Seuil",
    "weightLabel": "Poids actuel",
    "signers": "Liste des signataires"
  },
  "operations": {
    "payment": "Paiement",
    "setOptions": "Configuration (Signers & Thresholds)",
    "changeTrust": "Modifier la ligne de confiance",
    "unknown": "Action"
  }
}