{
  "nav": {
    "title": "Mode Histoire",
    "chapter_select": "Choisir un chapitre",
    "chapter_select_title": "Sélection de chapitre",
    "chapter_select_sub": "Choisissez un chapitre à jouer",
    "to_home": "Accueil",
    "to_chapters": "Chapitres",
    "step_back": "Retour",
    "confirm_leave": "Votre progression dans ce chapitre sera sauvegardée.",
    "confirm_leave_cancel": "Annuler",
    "confirm_leave_ok": "Quitter",
    "chapter_locked": "Verrouillé",
    "chapter_completed": "Terminé",
    "chapter_current": "Continuer",
    "chapter_start": "Commencer",
    "home_short": "Accueil",
    "chapters_short": "Chapitres",
    "back_short": "Retour",
    "back_to_home": "Retour à l'accueil"
  },
  "chapter1": {
    "introNarrator": "La blockchain Stellar – un réseau numérique qui déplace de la valeur à travers le monde. Et au beau milieu, tombe une petite étoile...",
    "introDialog1": "Bonjour ! Je suis Lumio et je viens d'atterrir sur la blockchain Stellar ! 🌟",
    "introDialog2": "Mais je n'ai pas encore de compte ici... peux-tu m'aider à en créer un ?",
    "keypairTitle": "Étape 1 – Qu'est-ce qu'une Paire de Clés ?",
    "keypairNarrator": "Chaque compte sur Stellar est composé de deux clés : la Clé Publique (votre adresse) et la Clé Secrète (votre mot de passe). Seul celui qui connaît la Clé Secrète peut envoyer de l'argent.",
    "choicePublicKeyLabel": "Je partage la Clé Publique avec d'autres pour qu'ils puissent m'envoyer des XLM.",
    "choicePublicKeyHint": "Exactement ! La Clé Publique est comme un numéro de compte bancaire – vous pouvez la partager publiquement. ✓",
    "choiceSecretShareLabel": "Je donne ma Clé Secrète à quelqu'un en qui j'ai confiance.",
    "choiceSecretShareHint": "Attention ! PERSONNE ne doit connaître la Clé Secrète – pas même Stellar ou Lumio. Elle donne un accès complet à votre compte.",
    "choiceSameLabel": "Les deux clés sont en réalité la même chose.",
    "choiceSameHint": "Ce n'est pas correct. La Clé Publique et la Clé Secrète forment une paire, mais ont des rôles complètement différents.",
    "createTitle": "Étape 2 – Votre première Paire de Clés",
    "createDialog": "Super ! Maintenant créons notre compte de test partagé. Appuyez sur le bouton – je surveille !",
    "createActionLabel": "Générer une Paire de Clés",
    "createActionDesc": "Crée une Clé Publique et une Clé Secrète aléatoires pour le Testnet Stellar. À des fins d'entraînement uniquement !",
    "warningDialog1": "Wow, nous avons maintenant une paire de clés ! Notez la Clé Secrète quelque part – mais ne la montrez jamais à personne !",
    "warningDialog2": "Sur le vrai réseau, je recommanderais de l'écrire sur papier et de la conserver en lieu sûr.",
    "activateTitle": "Étape 3 – Activer le Compte",
    "activateNarrator": "Un nouveau compte Stellar doit d'abord être activé – il a besoin d'au moins 1 XLM en réserve. Sur le Testnet, le 'Friendbot' nous donne gratuitement des XLM de test.",
    "friendbotLabel": "Demander au Friendbot",
    "friendbotDesc": "Envoie une requête au Friendbot Stellar, qui active notre compte de test avec 10 000 XLM de test.",
    "friendbotError": "Aucune paire de clés trouvée – veuillez d'abord en générer une.",
    "outroDialog1": "Nous avons un vrai compte sur le Testnet Stellar ! Je peux déjà voir les XLM dans la blockchain...",
    "outroDialog2": "Tu as appris vite ! Dans le prochain chapitre, nous enverrons des XLM ensemble.",
    "summaryTitle": "L'Arrivée",
    "summaryLearning1": "Chaque compte Stellar est composé d'une Clé Publique (adresse) et d'une Clé Secrète (mot de passe)",
    "summaryLearning2": "La Clé Secrète ne doit jamais être partagée",
    "summaryLearning3": "Les nouveaux comptes ont besoin d'au moins 1 XLM de solde minimum (réserve de base)",
    "summaryLearning4": "Le Friendbot active les comptes Testnet gratuitement",
    "keypair_warning": "Notez votre Clé Secrète maintenant ! Elle ne peut pas être récupérée. Quiconque la connaît a un accès complet à votre compte.",
    "keypair_confirm": "J'ai noté ma Clé Secrète et je comprends qu'elle ne peut pas être récupérée.",
    "keypair_public_label": "Votre Clé Publique (Adresse)",
    "keypair_secret_label": "Votre Clé Secrète – GARDEZ-LA SECRÈTE !",
    "keypair_copy": "Copier",
    "keypair_copied": "Copié !",
    "keypair_continue": "J'ai tout noté – continuer",
    "explorer_title": "Votre compte dans Stellar Explorer",
    "explorer_desc": "Dans Stellar Explorer, vous pouvez voir publiquement votre compte et toutes les transactions – comme un relevé bancaire, mais visible par tous.",
    "explorer_hint": "Copiez l'adresse et ouvrez-la manuellement dans votre navigateur.",
    "explorer_url_label": "URL Explorer",
    "explorer_copy_url": "Copier l'URL",
    "explorer_open": "Voir dans l'explorateur",
    "explorer_confirm_title": "Lien externe",
    "explorer_confirm_text": "Tu vas être redirigé vers {{explorer}}. Un nouvel onglet s'ouvrira.",
    "explorer_confirm_cancel": "Annuler",
    "explorer_confirm_ok": "Ouvrir",
    "summaryLearning4a": "Sur le Testnet, le Friendbot active les comptes gratuitement avec des XLM de test",
    "summaryLearning4b": "Sur le vrai réseau (Mainnet), un autre compte doit envoyer au moins 1 XLM pour activer ton compte – le Friendbot n'y existe pas !",
    "title": "Créer un compte",
    "explorer_after_fund": "Après l'activation du compte, vous pourrez le voir dans l'Explorer",
    "q1_question": "Que fais-tu avec ta [[Public Key|publicKey]] ?"
  },
  "chapter2": {
    "title": "La première transaction de Lumio",
    "section_tx": "Étape 1 – Qu'est-ce qu'une transaction ?",
    "section_memo": "Étape 2 – Le champ Mémo",
    "section_action": "Étape 3 – Envoyer un paiement",
    "narrator_intro": "Lumio a maintenant un compte avec des XLM de test. Mais avoir de l'argent ne suffit pas – il faut aussi pouvoir l'envoyer. Comment cela fonctionne-t-il sur Stellar ?",
    "lumio_1a": "Je veux envoyer 10 XLM à mon ami Cosmo ! Mais comment ça marche ?",
    "lumio_1b": "J'entends qu'il existe quelque chose appelé une transaction... qu'est-ce que c'est exactement ?",
    "narrator_tx": "Une transaction sur Stellar est une instruction au réseau : envoyer X XLM du compte A au compte B. Le réseau vérifie le solde, déduit un petit frais et écrit tout dans le ledger.",
    "choice1_a": "Elle paie les nœuds du réseau et empêche les transactions spam.",
    "choice1_b": "Elle va directement à la Stellar Development Foundation comme bénéfice.",
    "choice1_c": "Elle est optionnelle – on peut la laisser de côté.",
    "choice1_a_hint": "Exactement ! Les frais de base sont très faibles (0.00001 XLM) mais importants pour la sécurité du réseau.",
    "choice1_b_hint": "Faux – les frais sont brûlés, pas collectés.",
    "choice1_c_hint": "Faux – sans frais la transaction sera rejetée.",
    "lumio_2": "Et c'est quoi ce champ Mémo que je vois dans certains portefeuilles ?",
    "narrator_memo": "Le champ Mémo est un commentaire optionnel sur la transaction – 28 caractères maximum. Les exchanges l'utilisent pour identifier l'expéditeur. Sans le bon Mémo votre argent peut être perdu !",
    "choice2_a": "Toujours – sans Mémo la transaction sera rejetée.",
    "choice2_b": "Quand j'envoie à un exchange qui exige un Mémo.",
    "choice2_c": "Jamais – le champ Mémo est obsolète et n'est plus utilisé.",
    "choice2_a_hint": "Pas toujours – entre portefeuilles normaux le Mémo est optionnel.",
    "choice2_b_hint": "Correct ! Chez les exchanges le Mémo identifie votre compte.",
    "choice2_c_hint": "Faux – le Mémo est actif et essentiel pour les dépôts en exchange.",
    "lumio_3": "Ok, je crois que je comprends ! Essayons une vraie transaction !",
    "action_label": "Envoyer 10 XLM à Cosmo",
    "action_desc": "Envoie 10 XLM de test au compte Testnet de Cosmo avec le Mémo 'Hallo Cosmo'. Ensuite vous verrez le hash de la transaction sur la blockchain.",
    "error_no_keypair": "Aucune paire de clés trouvée – veuillez d'abord terminer le Chapitre 1.",
    "lumio_4a": "Je le vois ! La transaction est sur la blockchain ! Le hash de transaction est comme un numéro de reçu – n'importe qui peut rechercher la transaction avec.",
    "lumio_4b": "Dans le Stellar Explorer, vous pouvez consulter publiquement n'importe quelle transaction en utilisant le hash.",
    "narrator_hash": "Le hash de transaction est un identifiant unique pour chaque transaction. Il prouve de façon irréfutable que la transaction a eu lieu.",
    "learning_1": "Une transaction envoie des XLM d'un compte à un autre",
    "learning_2": "Les frais de base (0.00001 XLM) paient le réseau et préviennent le spam",
    "learning_3": "Le champ Mémo est essentiel pour les dépôts en exchange",
    "learning_4": "Chaque transaction a un hash unique comme preuve",
    "q1_question": "À quoi sert la [[Base Fee|base_fee]] dans une transaction Stellar ?",
    "q2_question": "Quand as-tu besoin du champ [[Memo|memo]] ?",
    "preset_cosmo": "Cosmo (Testnet)"
  },
  "ui": {
    "tap_to_continue": "Appuyez pour continuer",
    "testnet_badge": "Testnet – pas de vrais jetons",
    "retry_hint": "Réessaie !",
    "learn_more": "En savoir plus",
    "glossary_title": "Glossaire",
    "glossary_not_found": "Terme introuvable.",
    "glossary_hint": "Tu peux en apprendre davantage dans le glossaire.",
    "continue": "Continuer",
    "tx_success": "Transaction réussie !",
    "tx_hash_label": "Hash de transaction",
    "open_in_explorer": "Voir dans l'Explorer ↗",
    "hash_copied": "Copié !",
    "copy_hash": "Copier le hash",
    "explorer_confirm_title": "Lien externe",
    "explorer_confirm_text": "Un nouvel onglet s'ouvrira.",
    "explorer_confirm_cancel": "Annuler",
    "explorer_confirm_ok": "Ouvrir"
  },
  "placeholder": {
    "chapter_label": "Chapitre",
    "wip_title": "En cours de construction",
    "wip_text": "Ce chapitre est encore en cours de construction. Lumio y travaille dur – revenez bientôt !",
    "back_to_start": "Retour au Chapitre 1",
    "to_chapter_select": "Aller à la sélection des chapitres",
    "wip_hint": "Le chapitre {{next}} est également en cours de construction – mais tu peux déjà y jeter un œil.",
    "next_chapter": "Continuer au chapitre {{n}} →"
  },
  "chapter3": {
    "title": "Le Marchand"
  },
  "chapter4": {
    "title": "Le Méchant"
  },
  "chapter5": {
    "title": "La Mission de Lumio"
  },
  "hud": {
    "chapter_short": "Ch."
  },
  "action": {
    "already_done": "Déjà effectué",
    "continue_with_existing": "Continuer",
    "redo": "Exécuter à nouveau ?",
    "redo_keypair_warning": "Attention : une nouvelle paire de clés écrasera l'ancienne. Votre compte Testnet actuel sera perdu.",
    "redo_cancel": "Annuler",
    "redo_confirm": "Créer quand même"
  },
  "payment": {
    "title": "Envoyer un paiement",
    "from_label": "De (ton compte)",
    "to_label": "À (destinataire)",
    "to_placeholder": "G... (saisir la clé publique)",
    "amount_label": "Montant (XLM)",
    "memo_label": "Mémo (facultatif)",
    "memo_hint": "Astuce : les exchanges ont souvent besoin d'un mémo pour identification",
    "error_secret_key": "C'est une clé secrète ! Une clé secrète n'est jamais une adresse de destinataire. Ne saisis jamais ta clé secrète nulle part.",
    "error_invalid_key": "Ce n'est pas une clé publique Stellar valide. Les clés publiques commencent par 'G' et font 56 caractères.",
    "error_own_key": "C'est ta propre clé publique. Tu ne peux pas t'envoyer un paiement à toi-même.",
    "cancel": "Annuler",
    "send": "Envoyer"
  }
}