{
  "nav": {
    "title": "Mode Histoire",
    "chapter_select": "Choisir un chapitre",
    "chapter_select_title": "Sélection de chapitre",
    "chapter_select_sub": "Choisissez un chapitre à jouer",
    "to_home": "Accueil",
    "to_chapters": "Chapitres",
    "step_back": "Retour",
    "confirm_leave": "Votre progression dans ce chapitre sera sauvegardée.",
    "confirm_leave_cancel": "Annuler",
    "confirm_leave_ok": "Quitter",
    "chapter_locked": "Verrouillé",
    "chapter_completed": "Terminé",
    "chapter_current": "Continuer",
    "chapter_start": "Commencer",
    "home_short": "Accueil",
    "chapters_short": "Chapitres",
    "back_short": "Retour",
    "back_to_home": "Retour à l'accueil"
  },
  "chapter1": {
    "introNarrator": "La blockchain Stellar – un réseau numérique qui déplace de la valeur à travers le monde. Et au beau milieu, tombe une petite étoile...",
    "introDialog1": "Bonjour ! Je suis Lumio et je viens d'atterrir sur la blockchain Stellar ! 🌟",
    "introDialog2": "Mais je n'ai pas encore de compte ici... peux-tu m'aider à en créer un ?",
    "keypairTitle": "Étape 1 – Qu'est-ce qu'une Paire de Clés ?",
    "keypairNarrator": "Chaque compte sur Stellar est composé de deux clés : la Clé Publique (votre adresse) et la Clé Secrète (votre mot de passe). Seul celui qui connaît la Clé Secrète peut envoyer de l'argent.",
    "choicePublicKeyLabel": "Je partage la Clé Publique avec d'autres pour qu'ils puissent m'envoyer des XLM.",
    "choicePublicKeyHint": "Exactement ! La Clé Publique est comme un numéro de compte bancaire – vous pouvez la partager publiquement. ✓",
    "choiceSecretShareLabel": "Je donne ma Clé Secrète à quelqu'un en qui j'ai confiance.",
    "choiceSecretShareHint": "Attention ! PERSONNE ne doit connaître la Clé Secrète – pas même Stellar ou Lumio. Elle donne un accès complet à votre compte.",
    "choiceSameLabel": "Les deux clés sont en réalité la même chose.",
    "choiceSameHint": "Ce n'est pas correct. La Clé Publique et la Clé Secrète forment une paire, mais ont des rôles complètement différents.",
    "createTitle": "Étape 2 – Votre première Paire de Clés",
    "createDialog": "Super ! Maintenant créons notre compte de test partagé. Appuyez sur le bouton – je surveille !",
    "createActionLabel": "Générer une Paire de Clés",
    "createActionDesc": "Crée une Clé Publique et une Clé Secrète aléatoires pour le Testnet Stellar. À des fins d'entraînement uniquement !",
    "warningDialog1": "Wow, nous avons maintenant une paire de clés ! Notez la Clé Secrète quelque part – mais ne la montrez jamais à personne !",
    "warningDialog2": "Sur le vrai réseau, je recommanderais de l'écrire sur papier et de la conserver en lieu sûr.",
    "activateTitle": "Étape 3 – Activer le Compte",
    "activateNarrator": "Un nouveau compte Stellar doit d'abord être activé – il a besoin d'au moins 1 XLM en réserve. Sur le Testnet, le 'Friendbot' nous donne gratuitement des XLM de test.",
    "friendbotLabel": "Demander au Friendbot",
    "friendbotDesc": "Envoie une requête au Friendbot Stellar, qui active notre compte de test avec 10 000 XLM de test.",
    "friendbotError": "Aucune paire de clés trouvée – veuillez d'abord en générer une.",
    "outroDialog1": "Nous avons un vrai compte sur le Testnet Stellar ! Je peux déjà voir les XLM dans la blockchain...",
    "outroDialog2": "Tu as appris vite ! Dans le prochain chapitre, nous enverrons des XLM ensemble.",
    "summaryTitle": "L'Arrivée",
    "summaryLearning1": "Chaque compte Stellar est composé d'une Clé Publique (adresse) et d'une Clé Secrète (mot de passe)",
    "summaryLearning2": "La Clé Secrète ne doit jamais être partagée",
    "summaryLearning3": "Les nouveaux comptes ont besoin d'au moins 1 XLM de solde minimum (réserve de base)",
    "summaryLearning4": "Le Friendbot active les comptes Testnet gratuitement",
    "keypair_warning": "Notez votre Clé Secrète maintenant ! Elle ne peut pas être récupérée. Quiconque la connaît a un accès complet à votre compte.",
    "keypair_confirm": "J'ai noté ma Clé Secrète et je comprends qu'elle ne peut pas être récupérée.",
    "keypair_public_label": "Votre Clé Publique (Adresse)",
    "keypair_secret_label": "Votre Clé Secrète – GARDEZ-LA SECRÈTE !",
    "keypair_copy": "Copier",
    "keypair_copied": "Copié !",
    "keypair_continue": "J'ai tout noté – continuer",
    "explorer_title": "Votre compte dans Stellar Explorer",
    "explorer_desc": "Dans Stellar Explorer, vous pouvez voir publiquement votre compte et toutes les transactions – comme un relevé bancaire, mais visible par tous.",
    "explorer_hint": "Copiez l'adresse et ouvrez-la manuellement dans votre navigateur.",
    "explorer_url_label": "URL Explorer",
    "explorer_copy_url": "Copier l'URL",
    "explorer_open": "Voir dans l'explorateur",
    "explorer_confirm_title": "Lien externe",
    "explorer_confirm_text": "Tu vas être redirigé vers {{explorer}}. Un nouvel onglet s'ouvrira.",
    "explorer_confirm_cancel": "Annuler",
    "explorer_confirm_ok": "Ouvrir",
    "summaryLearning4a": "Sur le Testnet, le Friendbot active les comptes gratuitement avec des XLM de test",
    "summaryLearning4b": "Sur le vrai réseau (Mainnet), un autre compte doit envoyer au moins 1 XLM pour activer ton compte – le Friendbot n'y existe pas !",
    "title": "Créer un compte",
    "explorer_after_fund": "Après l'activation du compte, vous pourrez le voir dans l'Explorer",
    "q1_question": "Que fais-tu avec ta [[Public Key|publicKey]] ?"
  },
  "chapter2": {
    "title": "La première transaction de Lumio",
    "section_tx": "Étape 1 – Qu'est-ce qu'une transaction ?",
    "section_memo": "Étape 2 – Le champ Mémo",
    "section_action": "Étape 3 – Envoyer un paiement",
    "narrator_intro": "Lumio a maintenant un compte avec des XLM de test. Mais avoir de l'argent ne suffit pas – il faut aussi pouvoir l'envoyer. Comment cela fonctionne-t-il sur Stellar ?",
    "lumio_1a": "Je veux envoyer 10 XLM à mon ami Cosmo ! Mais comment ça marche ?",
    "lumio_1b": "J'entends qu'il existe quelque chose appelé une transaction... qu'est-ce que c'est exactement ?",
    "narrator_tx": "Une transaction sur Stellar est une instruction au réseau : envoyer X XLM du compte A au compte B. Le réseau vérifie le solde, déduit un petit frais et écrit tout dans le ledger.",
    "choice1_a": "Elle paie les nœuds du réseau et empêche les transactions spam.",
    "choice1_b": "Elle va directement à la Stellar Development Foundation comme bénéfice.",
    "choice1_c": "Elle est optionnelle – on peut la laisser de côté.",
    "choice1_a_hint": "Exactement ! Les frais de base sont très faibles (0.00001 XLM) mais importants pour la sécurité du réseau.",
    "choice1_b_hint": "Faux – les frais sont brûlés, pas collectés.",
    "choice1_c_hint": "Faux – sans frais la transaction sera rejetée.",
    "lumio_2": "Et c'est quoi ce champ Mémo que je vois dans certains portefeuilles ?",
    "narrator_memo": "Le champ Mémo est un commentaire optionnel sur la transaction – 28 caractères maximum. Les exchanges l'utilisent pour identifier l'expéditeur. Sans le bon Mémo votre argent peut être perdu !",
    "choice2_a": "Toujours – sans Mémo la transaction sera rejetée.",
    "choice2_b": "Quand j'envoie à un exchange qui exige un Mémo.",
    "choice2_c": "Jamais – le champ Mémo est obsolète et n'est plus utilisé.",
    "choice2_a_hint": "Pas toujours – entre portefeuilles normaux le Mémo est optionnel.",
    "choice2_b_hint": "Correct ! Chez les exchanges le Mémo identifie votre compte.",
    "choice2_c_hint": "Faux – le Mémo est actif et essentiel pour les dépôts en exchange.",
    "lumio_3": "Ok, je crois que je comprends ! Essayons une vraie transaction !",
    "action_label": "Envoyer 10 XLM à Cosmo",
    "action_desc": "Envoie 10 XLM de test au compte Testnet de Cosmo avec le Mémo 'Hallo Cosmo'. Ensuite vous verrez le hash de la transaction sur la blockchain.",
    "error_no_keypair": "Aucune paire de clés trouvée – veuillez d'abord terminer le Chapitre 1.",
    "lumio_4a": "Je le vois ! La transaction est sur la blockchain ! Le hash de transaction est comme un numéro de reçu – n'importe qui peut rechercher la transaction avec.",
    "lumio_4b": "Dans le Stellar Explorer, vous pouvez consulter publiquement n'importe quelle transaction en utilisant le hash.",
    "narrator_hash": "Le hash de transaction est un identifiant unique pour chaque transaction. Il prouve de façon irréfutable que la transaction a eu lieu.",
    "learning_1": "Une transaction envoie des XLM d'un compte à un autre",
    "learning_2": "Les frais de base (0.00001 XLM) paient le réseau et préviennent le spam",
    "learning_3": "Le champ Mémo est essentiel pour les dépôts en exchange",
    "learning_4": "Chaque transaction a un hash unique comme preuve",
    "q1_question": "À quoi sert la [[Base Fee|base_fee]] dans une transaction Stellar ?",
    "q2_question": "Quand as-tu besoin du champ [[Memo|memo]] ?",
    "preset_cosmo": "Cosmo (Testnet)"
  },
  "ui": {
    "tap_to_continue": "Appuyez pour continuer",
    "testnet_badge": "Testnet – pas de vrais jetons",
    "retry_hint": "Réessaie !",
    "learn_more": "En savoir plus",
    "glossary_title": "Glossaire",
    "glossary_not_found": "Terme introuvable.",
    "glossary_hint": "Tu peux en apprendre davantage dans le glossaire.",
    "continue": "Continuer",
    "tx_success": "Transaction réussie !",
    "tx_hash_label": "Hash de transaction",
    "open_in_explorer": "Voir dans l'Explorer ↗",
    "hash_copied": "Copié !",
    "copy_hash": "Copier le hash",
    "explorer_confirm_title": "Lien externe",
    "explorer_confirm_text": "Un nouvel onglet s'ouvrira.",
    "explorer_confirm_cancel": "Annuler",
    "explorer_confirm_ok": "Ouvrir"
  },
  "placeholder": {
    "chapter_label": "Chapitre",
    "wip_title": "En cours de construction",
    "wip_text": "Ce chapitre est encore en cours de construction. Lumio y travaille dur – revenez bientôt !",
    "back_to_start": "Retour au Chapitre 1",
    "to_chapter_select": "Aller à la sélection des chapitres",
    "wip_hint": "Le chapitre {{next}} est également en cours de construction – mais tu peux déjà y jeter un œil.",
    "next_chapter": "Continuer au chapitre {{n}} →"
  },
  "chapter3": {
    "title": "Le Marchand",
    "narrator_intro": "Un port sur le réseau Stellar. Lumio découvre un étal de marché – et dans l'air flotte le parfum du café fraîchement torréfié...",
    "marco_1a": "☕ Marco : Bienvenue ! Je suis Marco, le torréfacteur de café. Chacun de mes tokens CAFE représente 100g de mon meilleur café – directement sur la blockchain Stellar !",
    "marco_1b": "☕ Marco : Je voudrais t'envoyer 10 CAFE en cadeau ! Mais d'abord, nous devons résoudre un petit problème...",
    "lumio_1": "Un problème ? Qu'est-ce que tu veux dire, Marco ?",
    "section_asset": "Qu'est-ce qu'un Asset ?",
    "lumio_2": "Qu'est-ce qu'exactement un Asset sur Stellar ? Et qu'est-ce qui fait d'une entité un Anchor ?",
    "narrator_asset": "Sur Stellar, n'importe qui peut émettre son propre token – nous appelons ça un '[[Asset|asset]]'. Un [[Anchor|anchor]] est une organisation réelle qui représente de la valeur du monde réel (comme du café ou de l'argent) via des tokens Stellar.",
    "marco_asset_1": "☕ Marco : Exactement ! Je suis un Anchor – mes tokens CAFE sont adossés à du vrai café dans mon entrepôt. Chaque token peut être échangé contre 100g de café.",
    "marco_asset_2": "☕ Marco : Le problème : pour que tu puisses recevoir des CAFE, ton compte doit d'abord 'faire confiance' à CAFE. Autrement dit : tu as besoin d'une Trust Line.",
    "section_trustline": "Les Trust Lines expliquées",
    "narrator_trustline_intro": "Une [[Trust Line|trustline]] est une autorisation de recevoir un token spécifique. Sans elle, Stellar rejette les tokens entrants – te protégeant des tokens indésirables ou dangereux.",
    "tl_components_title": "Composants d'une Trust Line",
    "tl_code_label": "Code de l'Asset",
    "tl_issuer_label": "Adresse de l'Émetteur",
    "tl_limit_label": "Limite",
    "tl_limit_val": "montant maximum (défaut : illimité)",
    "narrator_tl_why": "Pourquoi l'adresse de l'émetteur est-elle nécessaire ? N'importe qui pourrait créer un token appelé 'CAFE'. C'est seulement le Code + l'Adresse de l'Émetteur ensemble qui rendent un token identifiable de façon unique.",
    "tl_methods_title": "3 façons d'ajouter une Trust Line",
    "tl_method1": "Manuellement : saisir directement le Code de l'Asset et l'Adresse de l'Émetteur",
    "tl_method2": "QR Code / Deep Link : le formulaire est rempli automatiquement – pratique, mais attention aux faux codes",
    "tl_method3": "Fichier TOML (SEP-1) : l'anchor publie ses assets sur son domaine officiel",
    "tl_continue": "Compris – continuer",
    "section_danger": "Attention : Trust Lines dangereuses",
    "marco_danger": "☕ Marco : J'ai entendu quelque chose d'alarmant : quelqu'un distribue de faux QR codes CAFE en ville ! Sois prudent.",
    "narrator_danger_qr": "Un faux QR code peut pointer vers une mauvaise adresse d'émetteur. Le token peut toujours s'appeler 'CAFE' – mais il ne vaut rien, car il provient du mauvais émetteur.",
    "narrator_danger_toml": "Les domaines de phishing sont aussi dangereux : 'marco-cafe.com' et 'marcocafe.com' semblent presque identiques. Vérifie toujours l'orthographe exacte du domaine.",
    "narrator_verify": "Comment identifier le vrai émetteur :\n• Vérifie sur stellar.expert – l'émetteur est-il connu et vérifié ?\n• Le site officiel de l'anchor liste toujours l'adresse de l'émetteur\n• Le domaine TOML doit correspondre exactement au site officiel de l'anchor",
    "section_qr": "Teste tes connaissances",
    "q_qr": "Lumio reçoit deux QR codes pour des tokens CAFE. Lequel est le vrai ?",
    "choice_real_label": "QR Code A : Émetteur GCAFE...A7F2 (vérifié sur stellar.expert – adresse officielle de Marco)",
    "choice_real_hint": "Correct ! Ce code provient du vrai compte émetteur de Marco, vérifié sur stellar.expert. Compare toujours avec le site officiel.",
    "choice_fake_label": "QR Code B : Émetteur GCAFE...B8G3 (adresse inconnue, aucune vérification trouvée)",
    "choice_fake_hint": "Attention ! Cette adresse d'émetteur est inconnue. Les tokens ne vaudraient rien. Vérifie toujours l'émetteur en premier.",
    "section_action_tl": "Configurer la Trust Line",
    "marco_before_tl": "☕ Marco : Tu sais maintenant comment distinguer les vraies trust lines des fausses. Configurons la vraie trust line – et je pourrai t'envoyer tes 10 CAFE !",
    "tl_preview_title": "Ta nouvelle Trust Line",
    "tl_setup_ready": "Configurer la Trust Line",
    "action_tl_label": "Ajouter Trust Line pour CAFE",
    "action_tl_desc": "Configure une Trust Line pour les tokens CAFE depuis le compte émetteur Testnet de Marco. Permet de recevoir des tokens CAFE.",
    "error_no_keypair": "Aucune paire de clés trouvée – complète d'abord le Chapitre 1.",
    "section_quiz": "Quiz – Teste tes connaissances",
    "q1_question": "Quels 3 éléments définissent de façon unique une [[Trust Line|trustline]] ?",
    "q1_a": "Code de l'Asset + Adresse de l'Émetteur + Limite",
    "q1_a_hint": "Exactement ! Ces trois éléments ensemble définissent une trust line. Sans l'adresse de l'émetteur, le code de l'asset n'est pas unique.",
    "q1_b": "Clé Publique + Clé Secrète + Montant",
    "q1_b_hint": "Non – ce sont des composants de la paire de clés, pas des éléments d'une trust line.",
    "q1_c": "Réseau + Frais + Mémo",
    "q1_c_hint": "Non – ce sont des champs de transaction, pas des composants d'une trust line.",
    "q2_question": "Pourquoi un token CAFE de l'Émetteur A ne peut-il pas être confondu avec un token CAFE de l'Émetteur B ?",
    "q2_a": "Parce qu'il ne peut exister qu'un seul token 'CAFE' sur Stellar",
    "q2_a_hint": "Faux – n'importe qui peut créer un token appelé CAFE. L'adresse de l'émetteur le rend unique.",
    "q2_b": "Parce que l'adresse de l'émetteur identifie le token de façon unique – même nom, émetteurs différents = tokens différents",
    "q2_b_hint": "Correct ! Seule la combinaison Code de l'Asset + Adresse de l'Émetteur crée un asset unique sur Stellar.",
    "q2_c": "Parce que les tokens différents doivent toujours avoir des noms différents",
    "q2_c_hint": "Faux – les tokens peuvent partager le même nom. L'adresse de l'émetteur les distingue.",
    "q3_question": "Tu reçois un QR code dans un message de chat te demandant d'ajouter une Trust Line. Que fais-tu ?",
    "q3_a": "Je scanne le code immédiatement – c'est juste une trust line, pas de l'argent réel",
    "q3_a_hint": "Attention ! Les trust lines peuvent aussi être risquées – le token pourrait être sans valeur ou un piège de phishing. Vérifie toujours en premier.",
    "q3_b": "Je vérifie d'abord l'émetteur sur stellar.expert et sur le site officiel de l'anchor",
    "q3_b_hint": "Exactement ! Ne fais jamais confiance à un QR code aveuglément – vérifie toujours l'adresse de l'émetteur et le domaine.",
    "q3_c": "Je demande à un ami s'il connaît le QR code",
    "q3_c_hint": "Mieux que de faire confiance aveuglément – mais la méthode la plus fiable est la vérification directe sur stellar.expert.",
    "section_receive": "Recevoir les tokens CAFE",
    "marco_send": "☕ Marco : Maintenant que tu as configuré la trust line, je peux enfin t'envoyer les 10 tokens CAFE ! C'est exactement pour ça que la trust line était nécessaire.",
    "lumio_receive": "Ah, je comprends ! Sans la trust line, Stellar aurait simplement rejeté les tokens – peu importe qui les envoyait ?",
    "marco_confirm": "☕ Marco : Exactement ! Le réseau aurait répondu : 'Ce compte n'accepte pas CAFE.' La trust line est ton autorisation explicite.",
    "action_receive_label": "Recevoir 10 CAFE de Marco",
    "action_receive_desc": "Marco envoie 10 tokens CAFE sur ton compte. Cela fonctionne uniquement parce que tu as configuré la trust line dans la scène précédente.",
    "learning_1": "Un Asset est tout token émis sur Stellar – de XLM à CAFE",
    "learning_2": "Un Anchor relie la valeur du monde réel (p.ex. café, argent) aux tokens Stellar",
    "learning_3": "Une Trust Line est composée de : Code de l'Asset + Adresse de l'Émetteur + Limite",
    "learning_4": "Seuls Code de l'Asset + Adresse de l'Émetteur ensemble identifient un token de façon unique",
    "learning_5": "Faux QR codes et domaines de phishing : vérifie toujours l'émetteur sur stellar.expert et sur le site officiel de l'anchor"
  },
  "chapter4": {
    "title": "Le Scélérat",
    "section_intro": "Étape 1 – Un message suspect",
    "section_social_eng": "Étape 2 – Ingénierie sociale",
    "section_choice1": "Étape 3 – Ton premier choix",
    "section_choice2": "Étape 4 – Le piège de phishing",
    "section_simulator": "Étape 5 – Détecter l'arnaque",
    "section_emergency": "Étape 6 – Que faire en cas d'urgence ?",
    "section_quiz": "Mini Quiz",
    "intro_narrator1": "Lumio vient de recevoir son premier token CAFE et explore le monde Stellar. Soudain, un message d'un inconnu arrive...",
    "intro_narrator2": "Parfois les ennemis les plus dangereux ne sont pas des hackers avec du code – ce sont des gens qui exploitent ta confiance.",
    "scammer_name": "CryptoHelper99",
    "scammer_subtitle": "Contact non vérifié",
    "unverified": "Non vérifié",
    "scam_msg1": "Bonjour ! Je suis du support officiel de Stellar. Nous avons détecté une activité inhabituelle sur ton compte. 🚨",
    "scam_msg2": "Pour protéger ton compte, nous devons vérifier ton identité. Envoie-nous ta Clé Secrète.",
    "scam_msg3": "C'est totalement sûr et confidentiel. Nous en avons besoin seulement 30 secondes pour vérification.",
    "scam_msg_cta": "Que dois-je faire maintenant ?",
    "social_eng_label": "Comprendre la menace",
    "social_eng_title": "Qu'est-ce que l'ingénierie sociale ?",
    "social_eng_desc": "Les attaquants utilisent la psychologie plutôt que la technologie. Ils jouent sur les émotions comme la peur, la cupidité ou la confiance pour te manipuler.",
    "tactic1_title": "Prétendre l'autorité",
    "tactic1_text": "\"Je suis du support officiel\" – les vrais services ne demandent JAMAIS ta Clé Secrète.",
    "tactic2_title": "Créer l'urgence",
    "tactic2_text": "\"Seulement 30 secondes !\" – L'urgence t'empêche de réfléchir clairement.",
    "tactic3_title": "Promettre des récompenses",
    "tactic3_text": "\"Double en XLM !\" – Si c'est trop beau pour être vrai, c'est généralement le cas.",
    "tactic4_title": "Construire la confiance",
    "tactic4_text": "Mélanger de petites vérités pour placer ensuite un grand mensonge.",
    "social_eng_cta": "Je comprends le danger →",
    "choice1_question": "CryptoHelper99 te demande ta Clé Secrète. Que fais-tu ?",
    "choice1_yes": "J'envoie la Clé Secrète – le support en a besoin.",
    "choice1_yes_hint": "Jamais ! Le vrai support ne demande JAMAIS la Clé Secrète.",
    "choice1_no": "J'ignore le message – aucun support légitime ne demande ça.",
    "choice1_no_hint": "Correct ! Aucun service ou support Stellar ne demandera jamais ta Clé Secrète.",
    "choice1_ask": "Je demande si c'est vraiment nécessaire.",
    "choice1_ask_hint": "Mieux que de partager, mais la bonne étape est d'ignorer et de signaler directement.",
    "choice1_hint2": "Souviens-toi : celui qui a ta Clé Secrète a TOUT. Il n'y a jamais de raison de la partager.",
    "drain_title": "Compte vidé !",
    "drain_text": "CryptoHelper99 a utilisé ta Clé Secrète pour transférer tous les XLM et tokens en quelques secondes. Ton compte est vide.",
    "retry": "Réessayer",
    "choice_correct_cta": "Continuer",
    "after_choice1_1": "Bien joué ! La Clé Secrète est comme le passe-partout de ta maison. Donne-la et n'importe qui peut entrer.",
    "after_choice1_2": "Le vrai support Stellar, les wallets ou les apps ne demanderont JAMAIS ta Clé Secrète. C'est un signal d'alarme absolu !",
    "choice2_question": "CryptoHelper99 t'envoie maintenant un lien : 'stellar-support-verify.net'. Que fais-tu ?",
    "choice2_click": "Je clique sur le lien – je veux voir ce qu'il y a derrière.",
    "choice2_click_hint": "Les sites de phishing semblent souvent vrais et volent tes données.",
    "choice2_ignore": "J'ignore le lien et signale le compte comme arnaque.",
    "choice2_ignore_hint": "Parfait ! Ignore et signale toujours les liens inconnus de inconnus.",
    "choice2_reply": "Je réponds et demande pourquoi le lien est nécessaire.",
    "choice2_reply_hint": "Toute interaction dit à l'arnaqueur que ton compte est actif – mieux vaut ignorer complètement.",
    "choice2_hint2": "Les URL de phishing semblent légitimes, mais le domaine est toujours faux. Stellar n'utilise que stellar.org.",
    "mini_sim_msg1": "Félicitations ! Tu as été sélectionné pour un airdrop exclusif de XLM ! 🎉",
    "mini_sim_msg2": "Pour réclamer tes 500 XLM, entre simplement ta Clé Secrète pour vérifier ton wallet.",
    "mini_sim_msg3": "Offre valable 10 minutes seulement ! Dépêche-toi !",
    "mini_sim_prompt": "Ta réponse",
    "mini_sim_opt_share": "J'entre ma Clé Secrète.",
    "mini_sim_opt_ignore": "J'ignore le message.",
    "mini_sim_opt_report": "Je signale le message comme fraude.",
    "mini_sim_scam_result": "⚠️ Tu aurais été arnaqué !",
    "mini_sim_scam_desc": "Un vrai airdrop n'a jamais besoin de ta Clé Secrète. Avec cette clé, l'attaquant aurait un accès immédiat et complet à ton compte.",
    "mini_sim_safe_result": "✓ Bien repéré !",
    "mini_sim_safe_desc": "Aucun service légitime n'a besoin de ta Clé Secrète. Les airdrops fonctionnent via ta Clé Publique – pas la Clé Secrète.",
    "mini_sim_cta": "Continuer",
    "emergency_label": "Si c'est arrivé",
    "emergency_title": "Plan d'urgence : Clé Secrète compromise",
    "emergency_desc": "Si tu penses que ta Clé Secrète a été volée ou partagée, agis immédiatement :",
    "emergency1": "Agis immédiatement : chaque minute compte – ouvre ton application wallet.",
    "emergency2": "Transfère tous les fonds : envoie XLM et tous les tokens immédiatement vers une nouvelle adresse sécurisée.",
    "emergency3": "Supprime les adresses de confiance : vérifie toutes les lignes de confiance définies.",
    "emergency4": "Crée une nouvelle paire de clés : génère une paire de clés entièrement nouvelle et n'utilise plus jamais l'ancienne.",
    "emergency5": "Signale-le : informe la communauté et signale les adresses d'arnaque sur les plateformes pertinentes.",
    "emergency_cta": "Compris – continuer",
    "quiz1_q": "Que ne fait JAMAIS un agent du support légitime ?",
    "quiz1_a1": "Te contacter par chat",
    "quiz1_a1_hint": "Cela seul n'est pas un problème – de nombreux services ont un chat en direct.",
    "quiz1_a2": "Demander ta Clé Secrète",
    "quiz1_a2_hint": "Correct ! C'est le signal d'alarme ultime. Le vrai support n'a jamais besoin de ta Clé Secrète.",
    "quiz1_a3": "Expliquer comment Stellar fonctionne",
    "quiz1_a3_hint": "Une aide légitime peut expliquer des choses – c'est bien.",
    "quiz2_q": "Tu reçois un message : 'Envoie 1 XLM et reçois 10 en retour'. Qu'est-ce que c'est ?",
    "quiz2_a1": "Une offre légitime d'un fournisseur vérifié",
    "quiz2_a1_hint": "De telles offres ne sont jamais légitimes, peu importe qui les fait.",
    "quiz2_a2": "Un exercice sur le testnet",
    "quiz2_a2_hint": "Non – cela ressemble à une vraie tentative d'arnaque.",
    "quiz2_a3": "Une arnaque classique – trop beau pour être vrai",
    "quiz2_a3_hint": "Exactement ! Ce schéma est l'une des plus anciennes arnaques crypto et fonctionne malheureusement encore.",
    "quiz3_q": "Ta Clé Secrète a peut-être été volée. Quelle est la PREMIÈRE étape ?",
    "quiz3_a1": "Transférer immédiatement tous les fonds vers un nouveau compte",
    "quiz3_a1_hint": "Correct ! Chaque seconde compte – sauve d'abord ce qui peut l'être.",
    "quiz3_a2": "Demander à l'attaquant de rendre les fonds",
    "quiz3_a2_hint": "Cela ne fonctionne jamais – les transactions blockchain sont irréversibles.",
    "quiz3_a3": "Appeler le support Stellar pour geler le compte",
    "quiz3_a3_hint": "Les comptes blockchain ne peuvent pas être gelés – c'est un mythe.",
    "learning1": "L'ingénierie sociale utilise la psychologie, pas la technologie – confiance, peur, pression temporelle",
    "learning2": "Aucun service, support ou app ne demande jamais ta Clé Secrète",
    "learning3": "Ignore et signale les liens inconnus – le phishing semble souvent très réel",
    "learning4": "Clé Secrète compromise ? Transfère tous les fonds immédiatement !",
    "learning5": "Les offres trop belles (10x retour, airdrop gratuit) sont toujours des arnaques"
  },
  "chapter5": {
    "title": "La Mission de Lumio",
    "section_intro": "Introduction",
    "section_recap": "Ce que tu as appris",
    "section_usecases": "Stellar dans le monde",
    "section_action": "Ta mission",
    "section_quiz": "Quiz final",
    "section_cert": "Certificat",
    "intro_narrator1": "Félicitations – tu as maîtrisé les quatre chapitres et tu sais maintenant comment fonctionnent les comptes, paiements, tokens et la sécurité sur Stellar.",
    "intro_narrator2": "Lumio a une dernière mission pour toi...",
    "lumio_intro1": "Tu as tellement appris ! Maintenant vient le test final : peux-tu aider une vraie personne à comprendre Stellar ?",
    "lumio_intro2": "Ton amie Lena a entendu parler de Stellar et veut recevoir son premier paiement. Tu es partant·e ?",
    "lena_age": "Débutante curieuse",
    "lena_greeting": "Salut ! J'ai entendu dire que tu t'y connaissais en Stellar ?",
    "lena_request": "Tu peux m'envoyer 1 XLM ? Je veux voir comment ça marche !",
    "lumio_accept": "Bien sûr, on y va !",
    "recap_label": "Récapitulatif",
    "recap_title": "5 leçons en un coup d'œil",
    "lesson1_title": "Ton portefeuille",
    "lesson1_text": "Clé publique = numéro de compte, Clé secrète = code PIN. Ta paire de clés protège tous tes fonds.",
    "lesson2_title": "Transactions",
    "lesson2_text": "Les paiements sur Stellar sont rapides (3–5 sec.), bon marché (<0,01 XLM) et irréversibles.",
    "lesson3_title": "Lignes de confiance",
    "lesson3_text": "Tu veux détenir un token (ex. USDC) ? Tu dois d'abord établir une ligne de confiance avec l'émetteur.",
    "lesson4_title": "Anchors",
    "lesson4_text": "Les Anchors connectent Stellar au monde réel – ils permettent par ex. des tokens Euro sur la blockchain.",
    "lesson5_title": "Sécurité",
    "lesson5_text": "Ta Clé secrète est sacrée. Aucun service, support ou application ne te la demandera jamais.",
    "recap_cta": "J'ai compris ! Continuer →",
    "usecases_label": "Pratique",
    "usecases_title": "Stellar dans le monde réel",
    "usecases_desc": "Stellar est utilisé dans le monde entier – des particuliers aux institutions financières.",
    "usecase1_title": "Transferts transfrontaliers",
    "usecase1_text": "Les migrants envoient de l'argent chez eux – en quelques secondes, pour quelques centimes au lieu de frais bancaires de 5–10 %.",
    "usecase2_title": "Micro-paiements pour le contenu",
    "usecase2_text": "Les créateurs reçoivent de minuscules paiements par stream ou article – impossible avec les systèmes traditionnels.",
    "usecase3_title": "Stablecoins et DeFi",
    "usecase3_text": "USDC, EURC et d'autres stablecoins fonctionnent sur Stellar – des valeurs stables à la vitesse de la blockchain.",
    "usecases_cta": "Compris ! Maintenant la mission →",
    "marco_action1": "OK, tu sais ce qu'il faut faire. Envoie 1 XLM à Lena – c'est sa première expérience Stellar !",
    "marco_action2": "Utilise ton compte testnet pour le virement.",
    "action_label": "Envoyer 1 XLM à Lena",
    "action_desc": "Envoie à Lena ses premiers Stellar Lumens – elle attend déjà !",
    "action_error": "Aucune paire de clés disponible – crée d'abord un compte testnet.",
    "after_action": "Parfait ! Lena a reçu le paiement. Tu viens de permettre à quelqu'un de vivre sa première expérience crypto – c'est Stellar !",
    "quiz_wrong": "Faux",
    "quiz_retry": "Réessayer",
    "quiz_correct_cta": "Continuer",
    "quiz1_q": "Qu'est-ce qu'une Clé publique sur Stellar ?",
    "quiz1_a1": "Un mot de passe qui doit rester secret",
    "quiz1_a1_hint": "Pas tout à fait – c'est la fonction de la Clé secrète.",
    "quiz1_a2": "L'adresse publique de ton compte, comme un IBAN",
    "quiz1_a2_hint": "Exactement ! Tu peux partager ta Clé publique librement – c'est ton adresse de réception.",
    "quiz1_a3": "Un token spécial pour les transactions",
    "quiz1_a3_hint": "Non – XLM est le token, la Clé publique est ton adresse.",
    "quiz1_explanation": "La Clé publique est ton adresse publique – comparable à un numéro de compte ou un IBAN. Tu peux la partager librement. La Clé secrète, en revanche, doit rester secrète.",
    "quiz1_hint2": "Indice : Pense au système bancaire classique – qu'est-ce que tu partages pour recevoir de l'argent ?",
    "quiz2_q": "Qu'est-ce qu'une ligne de confiance ?",
    "quiz2_a1": "Un type de paiement spécial",
    "quiz2_a1_hint": "Non – une ligne de confiance n'est pas une transaction de paiement.",
    "quiz2_a2": "Une autorisation de détenir un token spécifique",
    "quiz2_a2_hint": "Exactement ! Sans ligne de confiance, ton compte ne peut pas recevoir ni détenir ce token.",
    "quiz2_a3": "Un contrat entre deux portefeuilles",
    "quiz2_a3_hint": "Non – une ligne de confiance est une autorisation unilatérale de ton compte pour un token.",
    "quiz2_explanation": "Une ligne de confiance est une autorisation explicite que tu dois établir pour chaque token (sauf XLM). Seulement alors ton compte peut détenir et recevoir ce token.",
    "quiz2_hint2": "Indice : 'Trust' = confiance – tu fais confiance à l'émetteur du token.",
    "quiz3_q": "Combien de temps prend normalement une transaction Stellar ?",
    "quiz3_a1": "10–60 minutes, comme Bitcoin",
    "quiz3_a1_hint": "C'est la vitesse de Bitcoin – Stellar est bien plus rapide.",
    "quiz3_a2": "1–2 jours, comme un virement SEPA",
    "quiz3_a2_hint": "Non – Stellar est bien plus rapide que les banques traditionnelles.",
    "quiz3_a3": "3–5 secondes",
    "quiz3_a3_hint": "Correct ! Stellar confirme les transactions en environ 3–5 secondes – un grand avantage par rapport à Bitcoin ou aux banques.",
    "quiz3_explanation": "Stellar utilise le Stellar Consensus Protocol (SCP), qui finalise les transactions en 3–5 secondes. Cela le rend idéal pour les paiements du quotidien.",
    "quiz3_hint2": "Indice : Stellar a été spécialement conçu pour les paiements rapides – pense à la banque en temps réel.",
    "quiz4_q": "Que fait un Anchor sur Stellar ?",
    "quiz4_a1": "Il sécurise le réseau comme un validateur",
    "quiz4_a1_hint": "Non – c'est le rôle des validateurs dans le réseau.",
    "quiz4_a2": "Il crée de nouveaux comptes Stellar pour les utilisateurs",
    "quiz4_a2_hint": "Non – n'importe qui peut créer des comptes, ce n'est pas la fonction de l'Anchor.",
    "quiz4_a3": "Il connecte les monnaies fiduciaires (ex. EUR) à la blockchain Stellar",
    "quiz4_a3_hint": "Exactement ! Les Anchors sont des ponts entre le monde financier réel et Stellar – ils émettent des tokens comme EURC.",
    "quiz4_explanation": "Un Anchor est une institution financière réglementée qui convertit les monnaies fiduciaires (comme EUR ou USD) en tokens Stellar. Ainsi les vraies monnaies peuvent être utilisées sur la blockchain.",
    "quiz4_hint2": "Indice : Pense à un 'pont' entre la banque traditionnelle et la blockchain.",
    "quiz5_q": "Quelqu'un te contacte en prétendant être du 'Support Stellar'. Il a besoin de ta Clé secrète pour résoudre un 'problème de sécurité'. Que fais-tu ?",
    "quiz5_a1": "Envoyer la clé, car le personnel de support est digne de confiance",
    "quiz5_a1_hint": "Ce serait une erreur – aucun support légitime ne demande la Clé secrète.",
    "quiz5_a2": "Ignorer et bloquer le contact immédiatement – c'est une arnaque",
    "quiz5_a2_hint": "Correct ! Il n'existe pas de 'Support Stellar' qui aurait besoin de ta Clé secrète. C'est une tentative de phishing classique.",
    "quiz5_a3": "Envoyer la clé dans un message chiffré",
    "quiz5_a3_hint": "Peu importe la sécurité de la transmission – tu ne partages jamais ta Clé secrète.",
    "quiz5_explanation": "Aucun service légitime, aucune autorité ni support ne demande jamais ta Clé secrète. Quiconque la connaît contrôle entièrement ton compte. Bloquer et signaler est la seule bonne réponse.",
    "quiz5_hint2": "Indice : Imagine quelqu'un te demandant ton code PIN de banque en ligne par téléphone.",
    "cert_title": "Certificat de base",
    "cert_tagline": "Stellar Account Manager – Cours terminé !",
    "cert_public_key_label": "Adresse Testnet",
    "cert_date_label": "Terminé le",
    "cert_chapters_label": "Chapitres complétés",
    "cert_xp_label": "XP total",
    "cert_print_btn": "Imprimer le certificat",
    "cert_home_btn": "Aller à l'accueil",
    "learning1": "Stellar permet des paiements mondiaux en quelques secondes pour quelques centimes",
    "learning2": "Les lignes de confiance sont la base des tokens sur Stellar",
    "learning3": "Les Anchors connectent les monnaies fiduciaires à la blockchain",
    "learning4": "Ne partage jamais ta Clé secrète – pas même avec le 'support'",
    "learning5": "Stellar est utilisé dans le monde entier – des remises aux DeFi"
  },
  "hud": {
    "chapter_short": "Ch."
  },
  "action": {
    "already_done": "Déjà effectué",
    "continue_with_existing": "Continuer",
    "redo": "Exécuter à nouveau ?",
    "redo_keypair_warning": "Attention : une nouvelle paire de clés écrasera l'ancienne. Votre compte Testnet actuel sera perdu.",
    "redo_cancel": "Annuler",
    "redo_confirm": "Créer quand même"
  },
  "payment": {
    "title": "Envoyer un paiement",
    "from_label": "De (ton compte)",
    "to_label": "À (destinataire)",
    "to_placeholder": "G... (saisir la clé publique)",
    "amount_label": "Montant (XLM)",
    "memo_label": "Mémo (facultatif)",
    "memo_hint": "Astuce : les exchanges ont souvent besoin d'un mémo pour identification",
    "error_secret_key": "C'est une clé secrète ! Une clé secrète n'est jamais une adresse de destinataire. Ne saisis jamais ta clé secrète nulle part.",
    "error_invalid_key": "Ce n'est pas une clé publique Stellar valide. Les clés publiques commencent par 'G' et font 56 caractères.",
    "error_own_key": "C'est ta propre clé publique. Tu ne peux pas t'envoyer un paiement à toi-même.",
    "cancel": "Annuler",
    "send": "Envoyer"
  },
  "chapter6": {
    "title": "Le Comptable",
    "section_intro": "Le Chaos de Marco",
    "section_explain": "Qu'est-ce qu'un Compte Muxed ?",
    "section_payroll": "Comptabilité des Salaires",
    "section_usecases": "Plus d'Applications",
    "section_decision": "Comment l'organises-tu ?",
    "section_action": "Envoyer un Paiement Muxed",
    "section_quiz": "Mini Quiz",
    "intro_narrator1": "La cafétéria de Marco est en pleine croissance. Des dizaines de paiements arrivent chaque jour sur son compte Stellar – mais qui a payé quoi et quand ?",
    "intro_narrator2": "Sa comptable Sofia arrive avec une pile de questions sans réponse...",
    "marco_chaos1": "Je n'arrive plus à suivre ! Chaque jour de nouveaux paiements arrivent, mais ils ont tous l'air identiques sur la blockchain.",
    "marco_chaos2": "Comment suis-je censé savoir si c'est d'Anna, de Ben ou d'un client ?",
    "sofia_frustrated1": "Marco, je ne peux pas faire une paie correcte comme ça. Chaque paiement d'employé est identique sur la blockchain !",
    "sofia_frustrated2": "J'ai besoin d'un moyen fiable d'identifier chaque paiement de façon unique – sans demander à chaque fois.",
    "lumio_fix": "Je sais exactement comment résoudre ça. Avez-vous entendu parler des Comptes Muxed ?",
    "explain_label": "Concept",
    "explain_title": "Les Comptes Muxed Expliqués",
    "explain_desc": "Un Compte Muxed n'est pas un portefeuille séparé – c'est la même adresse Stellar, mais avec un ID virtuel attaché.",
    "explain_base_label": "Adresse de base de Marco (G…)",
    "explain_muxed_label": "Adresses M virtuelles",
    "explain_anna": "Barista",
    "explain_ben": "Torréfacteur",
    "explain_clara": "Comptabilité",
    "explain_flow_desc": "Tous les paiements arrivent sur la même adresse G – l'ID intégré révèle qui a reçu quoi.",
    "explain_memo_vs_title": "Compte Muxed vs. Mémo",
    "explain_memo_desc": "Champ de texte libre, non standardisé. Peut être oublié ou saisi incorrectement.",
    "explain_muxed_desc": "ID numérique structuré directement dans l'adresse. Fiable pour la comptabilité automatisée.",
    "explain_cta": "Compris ! Au cas d'usage →",
    "payroll_label": "Cas d'usage",
    "payroll_title": "Paie avec les Comptes Muxed",
    "payroll_step1": "L'entreprise a UN seul compte Stellar – moins cher et plus facile à gérer.",
    "payroll_step2": "Chaque employé se voit attribuer un ID Muxed unique par l'entreprise.",
    "payroll_step3": "Chaque mois, le logiciel de paie envoie le salaire à l'adresse M correspondante.",
    "payroll_step4": "Le logiciel de comptabilité de Sofia lit l'ID Muxed et enregistre automatiquement au bon employé.",
    "payroll_step5": "Pas de rapprochement manuel, pas de devinette, pas d'erreurs.",
    "payroll_note": "L'employé n'a pas besoin de savoir quoi que ce soit sur les Comptes Muxed – l'entreprise gère ça en interne.",
    "payroll_cta": "Super ! Plus d'exemples →",
    "usecases_label": "Pratique",
    "usecases_title": "Plus de Cas d'Usage",
    "exchange_title": "Bourses de Crypto",
    "exchange_text": "Une bourse utilise une seule adresse Stellar pour tous les clients. Chaque client reçoit un ID Muxed comme adresse de dépôt – pas de mémo nécessaire, pas de dépôts perdus.",
    "shop_title": "Boutiques en Ligne",
    "shop_text": "Chaque commande reçoit un ID Muxed unique. Le paiement est automatiquement associé à la bonne commande – sans traitement manuel ultérieur.",
    "usecases_cta": "Compris ! Maintenant à moi →",
    "decision_question": "Comment Marco devrait-il organiser sa comptabilité salariale ?",
    "decision_a1": "Créer un compte Stellar séparé pour chaque employé",
    "decision_a2": "Utiliser le champ mémo avec les noms des employés",
    "decision_a3": "Comptes Muxed avec un ID unique par employé",
    "wrong_a1_title": "Pas idéal",
    "wrong_a1_text": "Des comptes séparés signifient plus de frais, plus de clés secrètes à gérer et un risque de sécurité plus élevé. Ça ne passe pas à l'échelle pour une entreprise en croissance.",
    "wrong_a1_hint2": "Indice : Moins de comptes = moins de complexité. Existe-t-il une solution qui fonctionne avec une seule adresse ?",
    "wrong_a2_title": "Pas assez fiable",
    "wrong_a2_text": "Les mémos ne sont pas standardisés et peuvent être oubliés ou saisis incorrectement. La comptabilité automatisée a besoin d'une méthode structurée et fiable.",
    "wrong_a2_hint2": "Indice : Quelle méthode encode l'ID directement dans l'adresse – sans champ de texte supplémentaire ?",
    "correct_sofia": "Enfin ! C'est exactement ce dont j'avais besoin. Avec les Comptes Muxed, je peux automatiser complètement la paie !",
    "retry_btn": "Réessayer",
    "action_label": "Envoyer un Paiement Muxed",
    "action_desc": "Envoyer 1 XLM à une adresse Muxed (M-adresse) – adresse de base + ID 42.",
    "action_maddress_label": "Adresse M cible",
    "action_success": "Sur la blockchain, ça ressemble à un paiement normal – mais l'ID 42 est intégré !",
    "action_error": "Aucune paire de clés disponible – veuillez d'abord créer un compte testnet.",
    "lumio_after_action": "Tu vois ? La transaction sur testnet ressemble à un paiement XLM normal – mais l'ID Muxed est encodé dans l'adresse. Le logiciel de Sofia le lirait automatiquement.",
    "quiz_wrong": "Faux",
    "quiz_retry": "Réessayer",
    "quiz_correct_cta": "Continuer",
    "quiz1_q": "Qu'est-ce qu'un Compte Muxed sur Stellar ?",
    "quiz1_a1": "Un portefeuille séparé avec son propre solde",
    "quiz1_a1_hint": "Non – un Compte Muxed n'est pas un portefeuille indépendant.",
    "quiz1_a2": "Une sous-adresse virtuelle avec ID numérique, liée à une adresse G de base",
    "quiz1_a2_hint": "Exactement ! L'adresse M pointe vers le même compte – juste avec un ID supplémentaire pour distinguer.",
    "quiz1_a3": "Un compte de tokens spécial pour les entreprises",
    "quiz1_a3_hint": "Non – les Comptes Muxed fonctionnent avec XLM et tous les tokens.",
    "quiz1_explanation": "Un Compte Muxed n'est pas son propre portefeuille – il partage le solde, les lignes de confiance et les signataires avec le compte G de base. L'adresse M ne contient qu'un ID numérique supplémentaire.",
    "quiz1_hint2": "Indice : Pense à un numéro de compte bancaire avec un numéro de référence intégré – un compte, plusieurs IDs.",
    "quiz2_q": "Pourquoi les Comptes Muxed sont-ils meilleurs que les mémos pour la comptabilité salariale ?",
    "quiz2_a1": "Les Comptes Muxed sont moins chers que les mémos",
    "quiz2_a1_hint": "Non – les frais de transaction sont les mêmes.",
    "quiz2_a2": "Les mémos sont interdits pour les paiements professionnels",
    "quiz2_a2_hint": "Non – les mémos sont autorisés, juste pas idéaux pour l'automatisation.",
    "quiz2_a3": "Les IDs Muxed sont structurés et fiables ; les mémos peuvent manquer ou être incorrects",
    "quiz2_a3_hint": "Exactement ! L'ID est encodé directement dans l'adresse – il ne peut pas être oublié ou saisi incorrectement.",
    "quiz2_explanation": "Les mémos sont des champs de texte libres et non standardisés. Ils peuvent être oubliés, saisis incorrectement ou intentionnellement omis. Les IDs Muxed font partie de l'adresse elle-même – structurés et lisibles de façon fiable par machine.",
    "quiz2_hint2": "Indice : Que se passe-t-il si un employé laisse simplement le champ mémo vide lors d'un virement ?",
    "quiz3_q": "Un employé a-t-il besoin de son propre portefeuille Stellar pour recevoir un paiement Muxed ?",
    "quiz3_a1": "Non – l'employé a son propre portefeuille ; l'ID Muxed est géré en interne par l'entreprise",
    "quiz3_a1_hint": "Correct ! L'ID Muxed est une fonction comptable interne – l'employé reçoit sur sa propre adresse normale.",
    "quiz3_a2": "Oui – chaque employé a besoin d'une M-adresse comme son propre portefeuille",
    "quiz3_a2_hint": "Non – les M-adresses ne sont pas des portefeuilles indépendants.",
    "quiz3_a3": "Non – les employés n'ont pas du tout besoin d'un compte Stellar",
    "quiz3_a3_hint": "Pas tout à fait – les employés peuvent avoir leurs propres comptes Stellar ; l'ID Muxed n'est pertinent que du côté comptable.",
    "quiz3_explanation": "Les IDs Muxed sont un outil d'organisation interne de l'entreprise. L'employé a son propre compte Stellar. L'adresse M aide le logiciel de Sofia à affecter en interne les paiements entrants.",
    "quiz3_hint2": "Indice : Les Comptes Muxed sont conçus du point de vue de l'entreprise – pas du destinataire.",
    "learning1": "Un Compte Muxed est une sous-adresse virtuelle (M-adresse) sur une adresse de base Stellar",
    "learning2": "Les Comptes Muxed simplifient la paie : une adresse, plusieurs IDs – entièrement automatisable",
    "learning3": "Les bourses et les boutiques en ligne utilisent les Comptes Muxed pour l'attribution unique des clients",
    "learning4": "Les mémos peuvent être oubliés – les IDs Muxed sont encodés dans l'adresse et fiables"
  },
  "chapter7": {
    "title": "Le Coffre-Fort",
    "section_intro": "Scène 1 – Le Problème du Contrôle",
    "section_explain": "Qu'est-ce que la Multisignature ?",
    "section_family": "Exemple : Épargne Familiale",
    "section_decision1": "Scène de Décision 1",
    "section_company": "Exemple : Coffre-Fort d'Entreprise",
    "section_decision2": "Scène de Décision 2",
    "section_usecases": "Quand a-t-on besoin du Multisig ?",
    "section_quiz": "Mini Quiz",
    "section_cert": "Certificat Avancé",
    "intro_narrator1": "Marco a maintenant une associée : Rosa. Ensemble, ils dirigent une entreprise en pleine croissance. Mais il y a un problème...",
    "intro_narrator2": "Quand une seule personne contrôle le portefeuille de l'entreprise, des choses peuvent mal tourner – par perte de confiance ou de clés.",
    "marco_problem1": "Rosa, je m'inquiète. Que se passe-t-il avec notre argent si je perds ma clé secrète ?",
    "marco_problem2": "Ou que se passe-t-il si tu ne peux jamais vraiment me faire confiance parce que je contrôle tout seul ?",
    "rosa_concern": "C'est exactement ce qui m'inquiète aussi, Marco. Nous avons besoin d'une solution où nous sommes tous les deux en sécurité.",
    "lumio_solution": "Je sais exactement ce dont vous avez besoin – un coffre que vous ne pouvez ouvrir qu'ensemble. C'est ce qu'on appelle la Multisignature !",
    "explain_label": "Notions de base",
    "explain_title": "Qu'est-ce que la Multisignature ?",
    "explain_desc": "Normalement, une seule clé contrôle un portefeuille. Avec le Multisig, tu définis combien de signataires parmi les signataires possibles doivent approuver une transaction.",
    "explain_1of1_label": "Normal : 1-sur-1",
    "explain_1of1_desc": "Une clé contrôle tout. Qui possède cette clé a un accès complet – aucune protection contre le mauvais usage ou la perte.",
    "explain_multisig_label": "Multisig : N-sur-M",
    "explain_multisig_desc": "Plusieurs signataires, seuil défini. Ce n'est que lorsqu'il y a suffisamment de signatures que la transaction est exécutée.",
    "explain_threshold_label": "Qu'est-ce qu'un Seuil ?",
    "explain_threshold_desc": "Le seuil est le nombre minimum de signatures nécessaires pour autoriser une transaction. Avec 2-sur-3, n'importe quels 2 des 3 signataires doivent signer.",
    "explain_vault_desc": "Imagine un coffre avec plusieurs serrures – toutes les clés nécessaires doivent être tournées simultanément.",
    "explain_cta": "Montre-moi un exemple →",
    "family_label": "Exemple 1",
    "family_title": "Épargne Familiale (2-sur-2)",
    "family_desc": "Elena et David créent un portefeuille d'épargne commun. Tous les deux doivent signer chaque transaction – sécurité maximale, zéro achat impulsif.",
    "family_scenario_title": "Scénario",
    "family_scenario_text": "David veut acheter une nouvelle cafetière. Il envoie une demande de transaction – Elena doit également signer avant que l'argent soit débité. Tous les deux ont un contrôle égal.",
    "family_risk": "Risque : Si un parent perd sa clé secrète, le portefeuille est définitivement verrouillé. 2-sur-2 signifie zéro tolérance aux erreurs – les deux signatures sont toujours requises.",
    "family_cta": "Passer à l'exemple d'entreprise →",
    "d1_question": "Elena a perdu sa clé secrète. David a encore la sienne. Que se passe-t-il avec le portefeuille 2-sur-2 ?",
    "d1_a1": "David peut accéder aux fonds seul puisqu'il a encore sa clé",
    "d1_a2": "Ils peuvent réinitialiser le portefeuille avec leur adresse e-mail",
    "d1_a3": "Le portefeuille est définitivement inaccessible – les deux signatures sont toujours requises",
    "d1_wrong_a1_title": "Faux – 2-sur-2 ne connaît pas d'exceptions",
    "d1_wrong_a1_text": "Avec un portefeuille multisig 2-sur-2, les DEUX signatures sont TOUJOURS requises. Même si David a sa clé – sans la clé d'Elena, aucune transaction n'est possible. C'est à la fois la force et le risque.",
    "d1_wrong_a1_hint2": "Conseil : 2-sur-2 signifie que le seuil est toujours 2 – pas d'exceptions, pas de contournement.",
    "d1_wrong_a2_title": "Faux – la blockchain n'a pas de réinitialisation de mot de passe",
    "d1_wrong_a2_text": "La blockchain ne dispose pas de récupération par e-mail, d'assistance ni de réinitialisation de mot de passe. La clé EST l'accès – sans elle, il n'y a aucun moyen d'accéder au portefeuille.",
    "d1_wrong_a2_hint2": "Conseil : Sur la blockchain, il n'y a pas d'autorité centrale qui pourrait réinitialiser les clés – c'est intentionnel, mais implique une responsabilité.",
    "d1_correct_lumio": "Exactement ! C'est le risque fondamental du 2-sur-2 : si une clé est perdue, les fonds sont à jamais inaccessibles. C'est pourquoi le stockage sécurisé est si important.",
    "company_label": "Exemple 2",
    "company_title": "Coffre-Fort d'Entreprise (2-sur-3)",
    "company_desc": "Marco, Rosa et l'avocat Dr. Weber sont trois signataires. N'importe quels deux doivent signer – sécurité avec tolérance aux erreurs.",
    "company_scenario_title": "Scénario",
    "company_scenario_text": "Marco veut payer un fournisseur → Rosa co-signe → terminé. Le Dr. Weber n'est pas nécessaire. Si Marco est en vacances, Rosa et le Dr. Weber peuvent agir ensemble. L'entreprise reste opérationnelle.",
    "company_risk": "2-sur-3 équilibre sécurité et tolérance aux erreurs : même si un signataire perd sa clé, les deux autres peuvent encore agir. Ce n'est que lorsque deux clés sont perdues que le seuil devient inaccessible.",
    "company_cta": "Choisir maintenant →",
    "d2_question": "Marco, Rosa et le Dr. Weber dirigent une entreprise avec 3 associés. Quelle configuration multisig est correcte : majorité requise, fonctionne même si un associé est injoignable ?",
    "d2_a1": "1-sur-3 – chaque associé individuel peut exécuter des transactions seul",
    "d2_a2": "3-sur-3 – les trois associés doivent toujours signer",
    "d2_a3": "2-sur-3 – n'importe quels deux des trois associés doivent signer",
    "d2_wrong_a1_title": "Faux – 1-sur-3 n'offre aucune protection",
    "d2_wrong_a1_text": "1-sur-3 signifie que chaque signataire individuel pourrait déplacer tous les fonds seul. Cela n'offre aucune protection contre la fraude, le vol ou une clé compromise – plus dangereux qu'un portefeuille à clé unique normale.",
    "d2_wrong_a1_hint2": "Conseil : Pour les fonds d'entreprise, le seuil doit être suffisamment élevé pour qu'aucune personne ne puisse agir seule.",
    "d2_wrong_a2_title": "Faux – 3-sur-3 est trop rigide",
    "d2_wrong_a2_text": "3-sur-3 semble sécurisé, mais si un associé est malade, voyage ou perd sa clé, toute l'entreprise est bloquée. Les organisations ont besoin de tolérance aux erreurs.",
    "d2_wrong_a2_hint2": "Conseil : La solution est un seuil qui exige une majorité mais fonctionne quand même quand quelqu'un est injoignable.",
    "d2_correct_lumio": "Parfait ! 2-sur-3 est la configuration la plus courante pour les petites organisations – pour une bonne raison : majorité requise, mais avec tolérance aux erreurs.",
    "usecases_label": "Cas d'Usage",
    "usecases_title": "Quand a-t-on besoin du Multisig ?",
    "usecase1_title": "Portefeuilles d'Entreprise",
    "usecase1_text": "Plusieurs associés ou dirigeants – aucune personne ne peut déplacer des fonds seule.",
    "usecase2_title": "Épargne Familiale",
    "usecase2_text": "Les deux partenaires doivent être d'accord – protège contre les achats impulsifs et donne un contrôle égal.",
    "usecase3_title": "DAOs et Fonds Communautaires",
    "usecase3_text": "Les organisations décentralisées gèrent des fonds communs sans fiduciaire central.",
    "usecase4_title": "Portefeuille Personnel Haute Sécurité",
    "usecase4_text": "Tu détiens 2 clés sur des appareils séparés, un partenaire de confiance en détient 1 en sauvegarde – 2-sur-3.",
    "usecase5_title": "Arrangements de Séquestre",
    "usecase5_text": "Les fonds ne sont libérés que lorsque les deux parties signent – aucune fraude possible.",
    "usecases_cta": "Passer au quiz →",
    "quiz_wrong": "Pas tout à fait",
    "quiz_retry": "Réessayer",
    "quiz_correct_cta": "Continuer",
    "retry_btn": "Réessayer",
    "quiz1_q": "Que signifie '2-sur-3 Multisig' ?",
    "quiz1_a1": "Exactement 2 des 3 signataires possibles doivent toujours signer, sinon rien ne se passe",
    "quiz1_a2": "N'importe quels 2 des 3 signataires doivent signer une transaction pour qu'elle soit exécutée",
    "quiz1_a3": "Deux transactions doivent être confirmées en 3 minutes",
    "quiz1_a1_hint": "Presque ! N'importe quels 2 sur 3 peuvent signer – pas toujours les mêmes deux.",
    "quiz1_a2_hint": "Exactement ! N'importe quels 2 des 3 signataires suffisent – cela donne flexibilité et sécurité.",
    "quiz1_a3_hint": "Ce n'est pas correct – le Multisig n'a rien à voir avec des limites de temps.",
    "quiz1_explanation": "Avec le Multisig 2-sur-3, n'importe quelle combinaison de 2 des 3 signataires peut approuver la transaction. Ils n'ont pas toujours à être les mêmes deux – c'est la différence avec les signatures 'fixes'.",
    "quiz1_hint2": "Pense au coffre-fort d'entreprise : Marco+Rosa, Rosa+Weber ou Marco+Weber – les trois combinaisons fonctionnent.",
    "quiz2_q": "Marco, Rosa et le Dr. Weber ont un portefeuille 2-sur-3. Rosa perd sa clé. Peuvent-ils encore accéder aux fonds ?",
    "quiz2_a1": "Non – puisqu'un signataire a perdu sa clé, le portefeuille est verrouillé",
    "quiz2_a2": "Oui – Marco et le Dr. Weber atteignent ensemble le seuil de 2",
    "quiz2_a3": "Non – les trois signataires sont toujours requis",
    "quiz2_a1_hint": "Le seuil est 2, pas 3 – Marco et Weber peuvent encore agir.",
    "quiz2_a2_hint": "Correct ! C'est exactement la force du 2-sur-3 : tolérance aux erreurs quand une clé est perdue.",
    "quiz2_a3_hint": "Avec 2-sur-3, seules 2 signatures sont requises, pas les 3.",
    "quiz2_explanation": "Avec 2-sur-3, n'importe quelles 2 signatures suffisent. Si Rosa perd sa clé, Marco et le Dr. Weber peuvent encore exécuter toutes les transactions ensemble. C'est la différence avec 2-sur-2.",
    "quiz2_hint2": "À retenir : 2-sur-3 = une signature perdue = encore opérationnel. 2-sur-2 = une signature perdue = définitivement verrouillé.",
    "quiz3_q": "Elena et David ont un portefeuille 2-sur-2. Elena perd sa clé. Que se passe-t-il ?",
    "quiz3_a1": "Le portefeuille est définitivement verrouillé – les deux signatures sont toujours requises",
    "quiz3_a2": "David peut accéder aux fonds seul puisqu'il a encore sa clé",
    "quiz3_a3": "Ils peuvent contacter Stellar pour récupérer la clé",
    "quiz3_a1_hint": "Correct ! 2-sur-2 a une tolérance aux erreurs nulle – les deux clés sont toujours requises.",
    "quiz3_a2_hint": "Avec 2-sur-2, une seule clé ne suffit pas – le seuil reste toujours 2.",
    "quiz3_a3_hint": "Stellar est décentralisé – il n'y a pas d'autorité centrale qui peut réinitialiser les clés.",
    "quiz3_explanation": "Avec 2-sur-2, les deux signatures sont toujours requises. Si une clé est perdue, il n'y a aucun moyen d'exécuter une transaction – le portefeuille est définitivement verrouillé. C'est pourquoi le stockage sécurisé des clés est si critique.",
    "quiz3_hint2": "À retenir : 2-sur-2 = sécurité maximale, tolérance zéro aux erreurs. Chaque clé doit être stockée en sécurité – dans plusieurs endroits physiques.",
    "quiz4_q": "Pourquoi le Multisig 1-sur-3 est-il risqué pour une caisse d'entreprise ?",
    "quiz4_a1": "Parce que la configuration est trop compliquée et déroute les employés",
    "quiz4_a2": "Parce que Stellar ne prend en charge que les seuils de 2-sur-3 ou plus",
    "quiz4_a3": "Parce que chaque signataire individuel peut déplacer tous les fonds seul – aucune protection contre la fraude",
    "quiz4_a1_hint": "Ce n'est pas la raison – le seuil rend la configuration risquée.",
    "quiz4_a2_hint": "Stellar prend en charge des seuils flexibles – ce n'est pas le problème.",
    "quiz4_a3_hint": "Exactement ! 1-sur-3 signifie aucun contrôle réel de majorité – n'importe qui peut agir seul.",
    "quiz4_explanation": "Avec 1-sur-3, chacun des trois signataires peut déplacer tous les fonds seul. C'est pire qu'un portefeuille à clé unique normal, car trois personnes différentes constituent une cible d'attaque potentielle.",
    "quiz4_hint2": "Pense à une caisse d'entreprise : tu ne veux pas qu'un seul employé puisse initier des virements seul.",
    "cert_title": "Certificat Avancé",
    "cert_tagline": "Tu es maintenant un pro de Stellar!",
    "cert_public_key_label": "Clé Publique",
    "cert_date_label": "Date d'Achèvement",
    "cert_chapters_label": "Chapitres Complétés",
    "cert_xp_label": "XP total",
    "cert_badge1": "Certificat de Base",
    "cert_badge2": "Certificat Avancé",
    "cert_print_btn": "Enregistrer le Certificat",
    "cert_home_btn": "Aller à l'Accueil",
    "learning1": "La Multisignature nécessite plusieurs signatures pour exécuter une transaction",
    "learning2": "2-sur-3 offre une tolérance aux erreurs : une clé perdue ne verrouille pas le portefeuille",
    "learning3": "Le Multisig convient aux entreprises, familles, DAOs et portefeuilles haute sécurité",
    "learning4": "2-sur-2 a une tolérance aux erreurs nulle – si une clé est perdue, les fonds sont à jamais inaccessibles"
  }
}
