{
  "title": "Konto + Multisig erstellen",
  "menu": "Konto erstellen + Multisig",
  "menuHint": "Neues Konto erzeugen und optional Multisig setzen",
  "hint": "Erzeuge ein neues Konto, aktiviere es und konfiguriere optional Multisig.",
  "generateKeys": "Schlüssel generieren",
  "enableMultisig": "Multisig aktivieren",
  "signersTitle": "Unterzeichner",
  "signersInfo": "Füge weitere Unterzeichner hinzu und setze geeignete Schwellenwerte.",
  "signersCount": "Anzahl Unterzeichner",
  "bestPractices": {
    "title": "Best Practices",
    "text": "Bewahre Secret Keys sicher auf und verteile sie nicht unnötig."
  },
  "instructions": {
    "public": "Teile diesen Public Key mit anderen für Zahlungen.",
    "secret": "Bewahre diesen Secret Key sicher auf; niemals weitergeben."
  },
  "generateFirst": "Bitte generiere zuerst ein Schlüsselpaar.",
  "confirmLowBalance": "Startguthaben {bal} XLM ist unterhalb der empfohlenen Reserve {req} XLM (Unterzeichner: {count}). Fortfahren?",
  "activated": "Konto wurde aktiviert. Hash: {hash}",
  "activatedTestnet": "Konto wurde im Testnet über Friendbot aktiviert.",
  "alreadyActive": "Konto ist bereits aktiviert.",
  "createdNoSigners": "Konto erstellt, Multisig nicht konfiguriert.",
  "createdAndConfigured": "Konto erstellt und Multisig konfiguriert. Hash: {hash}",
  "info": {
    "more": "Mehr Infos",
    "keysOnPage": {
      "title": "Schlüssel auf dieser Seite",
      "text": "⚠️ WICHTIG: Diese Webseite speichert NIEMALS Deinen Geheimschlüssel!\n\nDer hier angezeigte Secret Key existiert nur in Deinem Browser (lokal im Arbeitsspeicher). Sobald Du die Seite neu lädst oder verlässt, ist er unwiederbringlich verloren.\n\nKopiere oder notiere den Secret Key sofort nach der Erzeugung, bevor Du die Seite schließt.\n\nÜberprüfung: Du kannst mit den Browser-Entwickler-Tools (F12 → Netzwerk) nachprüfen, dass kein Geheimschlüssel nach außen übermittelt wird. Es werden nur signierte Transaktionen gesendet, niemals Dein Secret Key."
    },
    "title": "Wichtige Informationen",
    "secureKeys": {
      "title": "Geheimschlüssel sichern",
      "text": "Der Public Key (öffentlicher Schlüssel) kann sicher geteilt werden – er ist wie eine Kontonummer.\n\nDer Secret Key (Geheimschlüssel) ist der Zugang zu Ihrem Konto. Behandeln Sie ihn wie ein Passwort:\n• Speichern Sie ihn NIEMALS in Cloud-Diensten, E-Mails oder unsicheren Notizen\n• Notieren Sie ihn auf Papier oder verwenden Sie einen Hardware-Wallet\n• Erstellen Sie mehrere Backups und lagern Sie diese an sicheren, getrennten Orten\n• Bei Verlust des Secret Keys ist der Zugang zum Konto unwiderruflich verloren"
    },
    "multisigSection": {
      "title": "Multisig (Mehrfachsignatur)",
      "text": "Mit Multisig können Sie mehrere Unterzeichner für Ihr Konto definieren. Transaktionen erfordern dann Signaturen von mehreren Keys (z. B. 2 von 3).\n\nVorteile:\n• Erhöhte Sicherheit (ein kompromittierter Key reicht nicht)\n• Gemeinsame Konten (z. B. Firmen, Partnerschaften)\n• Notfall-Wiederherstellung (mehrere Backups bei verschiedenen Personen)\n\nACHTUNG: Testen Sie Multisig zuerst im Testnet, bevor Sie es auf dem Mainnet einsetzen! Bei falscher Konfiguration kann der Zugang zum Konto verloren gehen."
    },
    "diagram": {
      "title": "Signatur-Ablauf"
    }
  },
  "activateHint": "Aktivierung ist notwendig, damit das Konto existiert. Im Testnet per Friendbot, im Mainnet per \"Create Account\" von einem bestehenden Wallet.",
  "activateNow": "Konto sofort aktivieren",
  "activateOnly": "Nur aktivieren",
  "balanceWarning": "Startguthaben ist wahrscheinlich zu niedrig, um die {{count}} zusätzlichen Signer hinzuzufügen (Mindestreserve: {{req}} XLM)",
  "createButton": "Erstellen / Multisig setzen",
  "mainnetActivateNote": "Hinweis: Für Multisig sind zusätzliche Reserven nötig. 1 XLM reicht oft nicht.",
  "reserve": {
    "base": "Basisreserve pro Eintrag: {{val}} XLM",
    "recommended": "Empfohlenes Startguthaben: {{val}} XLM (inkl. Puffer)",
    "required": "Benötigte Mindestreserve (neu): {{val}} XLM"
  },
  "signersCountHint": "Die Mindestanzahl an Signaturen stellst du unten bei \"Erforderliche Signaturen\" (niedrig/mittel/hoch) ein.",
  "signersCountLimit": "Hinweis: Netzwerkgrenze (Stellar): max. 20 zusätzliche Unterzeichner.",
  "startingBalance": "Startguthaben (XLM)",
  "keyWarning": {
    "title": "⚠️ Schlüssel jetzt sichern!",
    "text1": "Sie haben ein neues Schlüsselpaar erzeugt.",
    "text2": "Sichern Sie BEIDE Schlüssel SOFORT, bevor Sie fortfahren:",
    "list1": "Public Key (öffentlicher Schlüssel): Ihre Kontoadresse, kann geteilt werden",
    "list2": "Secret Key (Geheimschlüssel): Ihr Passwort – NIEMALS teilen oder online speichern!",
    "list3": "Bei Verlust des Secret Keys ist der Zugang unwiderruflich verloren",
    "confirm": "Ich habe beide Schlüssel gesichert"
  },
  "muxedId": "Muxed-ID",
  "muxedInfo": "Mit der Muxed-ID wird eine M-Adresse (M...) erstellt. Sie zeigt auf dasselbe Konto wie die reguläre Adresse (G...).",
  "muxedIdInvalid": "Die Muxed-ID muss eine Ganzzahl zwischen 0 und 18'446'744'073'709'551'615 sein.",
  "muxedAddress": "Muxed-Adresse",
  "muxedActivationInfo": "Muxed-Adressen sind Alias-Adressen. Sie müssen nicht separat aktiviert werden."
}
