{
  "pageTitle": "Glossar",
  "pageIntro": "Hier findest du wichtige Wörter aus der Blockchain Welt und aus dem Stellar Netzwerk. Alles ist in einfachen Worten erklärt.",
  "searchLabel": "Begriff suchen",
  "searchPlaceholder": "Begriff suchen (z. B. Konto, Account, Muxed)",
  "searchHint": "Die Suche findet Wörter und Erklärungen.",
  "noResults": "Kein Treffer.",
  "groups": {
    "accountsKeys": "Konten & Schlüssel",
    "multisigSecurity": "Multisig & Kontosicherheit",
    "walletsCustody": "Wallets & Verwahrung",
    "tokensAssets": "Token & Assets",
    "transactionsFees": "Transaktionen & Gebühren",
    "marketsTrading": "Märkte & Handel",
    "networkProtocol": "Netzwerk & Protokoll",
    "smartContracts": "Smart Contracts",
    "blockchainBasics": "Blockchain-Grundlagen",
    "security": "Sicherheit & Betrug"
  },
  "blockchain": {
    "title": "Blockchain",
    "original": "Blockchain",
    "short": "Gemeinsames digitales Kassenbuch – viele Computer speichern die gleichen Einträge.",
    "desc": "Eine Blockchain ist wie ein digitales Kassenbuch. Viele Computer speichern dieselben Einträge. So kann niemand heimlich etwas ändern."
  },
  "wallet": {
    "title": "Wallet",
    "original": "Wallet",
    "short": "Digitale Geldbörse, die deine Schlüssel verwaltet.",
    "desc": "Ein Wallet ist deine digitale Geldbörse. Es verwaltet die Schlüssel die du brauchst um auf dein Konto zuzugreifen und Transaktionen zu senden. Ein Wallet kann ein Programm sein oder eine App oder auch nur ein Zettel mit deinem Geheimschlüssel."
  },
  "account": {
    "title": "Konto",
    "original": "Account",
    "short": "Ein Blockchain-Konto kann Vermögenswerte halten und Transaktionen senden.",
    "desc": "Ein Konto ist die Stelle auf der Blockchain an der deine Werte liegen. Ein Konto hat eine öffentliche Adresse die mit G beginnt. Mehrere Wallets können auf dasselbe Konto zugreifen wenn sie den richtigen Schlüssel haben."
  },
  "addressG": {
    "title": "G-Adresse",
    "original": "G Address",
    "short": "Die öffentliche Hauptadresse eines Stellar-Kontos (beginnt mit G).",
    "desc": "Die G-Adresse ist die Hauptadresse eines Stellar Kontos. Sie beginnt mit dem Buchstaben G. Du gibst sie anderen damit sie dir etwas schicken können."
  },
  "publicKey": {
    "title": "Öffentlicher Schlüssel",
    "original": "Public Key",
    "short": "Adresse, die du teilen darfst; bei Stellar meist die G‑Adresse.",
    "desc": "Der öffentliche Schlüssel ist die Adresse die du zeigen darfst. Bei Stellar ist das die G-Adresse. Andere nutzen ihn um dir Geld zu senden."
  },
  "privateKey": {
    "title": "Geheimer Schlüssel",
    "original": "Secret Key",
    "short": "Passwort zum Konto – niemals weitergeben.",
    "desc": "Der geheime Schlüssel ist dein Passwort für das Konto. Wer diesen Schlüssel hat kann dein Geld bewegen. Niemals weitergeben."
  },
  "addressFederation": {
    "title": "Föderationsadresse",
    "original": "Federation Address",
    "short": "Kurze Adresse wie E‑Mail, zeigt auf eine G‑Adresse.",
    "desc": "Eine Föderationsadresse sieht aus wie eine E-Mail. Beispiel: name*domain.com. Diese kurze Adresse zeigt auf eine normale G-Adresse. Das ist einfacher zu merken."
  },
  "addressMuxed": {
    "title": "Muxed-Konto",
    "original": "Muxed Account",
    "short": "M‑Adresse mit zusätzlicher ID – teilt ein Basiskonto.",
    "desc": "Eine M-Adresse zeigt auf ein bestehendes Stellar Konto hat aber zusätzlich eine eigene Nummer (ID). So kann man z. B. mehrere Personen oder Abteilungen unter derselben G-Adresse unterscheiden. Technisch gehört das Geld weiter dem Hauptkonto."
  },
  "multisig": {
    "title": "Mehrfachsignatur",
    "original": "Multi‑Sig",
    "short": "Wichtige Aktionen brauchen mehr als eine Unterschrift.",
    "desc": "Multi-Sig steht für mehrere Unterschriften. Eine wichtige Aktion braucht mehr als einen Schlüssel. Beispiel: Du und ein zweiter Schlüssel müssen beide zustimmen bevor etwas gesendet wird. Das macht Diebstahl schwerer.",
    "help": {
      "title": "Allgemeine Erklärung eines Mehrfachsignatur (Multi-Signature) Firmenkontos",
      "intro": "Ein Unternehmen kann ein gemeinsames Blockchain-Konto verwenden, an dem mehrere berechtigte Personen beteiligt sind. Typischerweise sind mindestens drei Unterzeichner (Signer) eingebunden, zum Beispiel Geschäftsführung, Finanzverantwortlicher und Compliance/Backup. Ziel ist, dass einzelne Personen Zahlungen eigenständig ausführen können, ohne dass eine einzelne Person das Konto allein kontrollieren oder übernehmen kann.",
      "problem": "Wenn ein Unterzeichner (Signer) genug Gewicht hat, um Zahlungen auszuführen, und zugleich genug Gewicht für Kontoänderungen besitzt, könnte diese Person andere Unterzeichner (Signer) entfernen oder den Schwellenwert/Gewichtung (Thresholds) anpassen und damit das Konto übernehmen. Umgekehrt soll auch der ursprüngliche Owner nicht in der Lage sein, andere Unterzeichner (Signer) ohne Gegenkontrolle einfach auszuschließen. Eine Multi-Sig-Struktur sorgt dafür, dass wichtige Entscheidungen immer von mehreren Personen gemeinsam getragen werden.",
      "setupTitle": "Beispiel einer sicheren Multi-Sig-Struktur mit drei Signern",
      "setupWeights": "In einem Beispiel mit drei gleichberechtigten Rollen erhalten alle dieselbe Signaturstärke:\n- Unterzeichner (Signer) A (Geschäftsführung): Gewicht 2\n- Unterzeichner (Signer) B (Finanzen): Gewicht 2\n- Unterzeichner (Signer) C (Compliance/Backup): Gewicht 2",
      "setupThresholds": "Dazu werden geeignete Schwellenwerte/Gewichtungen gesetzt:\n- Niedrig (low_threshold): 1\n- Mittel (med_threshold): 2 (für Zahlungen und andere mittlere Aktionen)\n- Hoch (high_threshold): 4 (für Strukturänderungen wie Unterzeichner (Signer) hinzufügen/entfernen oder den Schwellenwert/Gewichtung (Thresholds) ändern)\nDamit kann jede einzelne berechtigte Person Zahlungen ausführen, aber keine Person allein die Konto-Struktur verändern.",
      "behavior": "Mit dieser Konfiguration können Zahlungen von jeder der drei berechtigten Personen alleine durchgeführt werden, weil das individuelle Gewicht jeweils den mittleren Schwellenwert/Gewichtung (Threshold) erfüllt. Für Strukturänderungen wie das Entfernen eines Unterzeichners (Signers), das Anpassen der Schwellenwerte/Gewichtungen oder das Zusammenlegen bzw. Schließen des Kontos wird hingegen der hohe Schwellenwert/Gewichtung (high_threshold) benötigt. Dieser Wert kann nur erreicht werden, wenn mindestens zwei der drei Unterzeichner (Signer) gemeinsam unterschreiben. Das Konto bleibt so gleichzeitig flexibel im Alltag und gut gegen Missbrauch geschützt.",
      "removal": "Wenn eine Person das Unternehmen verlässt oder nicht mehr vertrauenswürdig ist, können zwei der verbleibenden Unterzeichner (Signer) gemeinsam die Signaturrechte dieser Person entfernen. Kein einzelner Unterzeichner (Signer) – weder ein Mitarbeiter noch die Geschäftsführung – kann andere eigenständig aus dem Konto ausschließen. Der Entzug von Berechtigungen erfolgt also immer kontrolliert und nachvollziehbar durch mindestens zwei Verantwortliche.",
      "summary": "Diese Art von Multi-Sig-Struktur ermöglicht es, dass einzelne Personen Zahlungen effizient abwickeln können, während die Kontrolle über das Konto immer bei mehreren Beteiligten bleibt. Sie reduziert das Risiko von Kontoübernahmen, schützt vor einseitigen Entscheidungen und eignet sich besonders für Firmenkonten, bei denen sowohl Sicherheit als auch operative Flexibilität wichtig sind.",
      "closeLabel": "Schließen",
      "linkLabel": "Was bedeutet Multi-Signature?",
      "glossaryLinkLabel": "Im Glossar ansehen"
    }
  },
  "multisigCorporate": {
    "title": "Multisig erklärt am Firmenbeispiel",
    "original": "Multi-Signature (corporate example)",
    "short": "Beispielhafte Multi-Sig-Struktur für Firmenkonten mit Rollen, Gewichten und Thresholds."
  },
  "trustline": {
    "title": "Trustline",
    "original": "Trustline",
    "short": "Zustimmung, einen Token eines bestimmten Herausgebers zu halten.",
    "desc": "Eine Trustline ist wie ein Ja ich akzeptiere diesen Token. Du sagst damit dass dein Konto bereit ist einen bestimmten Token von einem bestimmten Herausgeber zu halten. Ohne Trustline kannst du diesen Token nicht empfangen.\n\nBeispiel: Eine Trustline wird als CODE:ISSUER angegeben. Für EURT vom Herausgeber GDUKMGUGDZQK6Y… lautet sie EURT:GDUKMGUGDZQK6Y…"
  },
  "token": {
    "title": "Token",
    "original": "Token",
    "short": "Digitale Einheit – z. B. Geld, Punkte oder Guthaben.",
    "desc": "Ein Token ist eine digitale Einheit auf der Blockchain. Ein Token kann Geld darstellen oder Punkte oder Guthaben für einen Dienst."
  },
  "asset": {
    "title": "Asset",
    "original": "Asset",
    "short": "Token auf Stellar, immer mit Herausgeber verknüpft.",
    "desc": "Auf Stellar heißt ein Token Asset. Ein Asset ist immer verknüpft mit einem Herausgeber Konto. Zum Beispiel kann ein Konto einen Euro Token ausgeben. Dieser Euro Token ist dann ein Asset."
  },
  "xlm": {
    "title": "XLM",
    "original": "XLM",
    "short": "Native Währung von Stellar für Gebühren und Aktivierung.",
    "desc": "XLM ist die Grundwährung von Stellar. Du brauchst XLM um Gebühren zu zahlen und ein neues Konto zu starten."
  },
  "mainnet": {
    "title": "Mainnet",
    "original": "Mainnet",
    "short": "Echtes Stellar‑Netzwerk mit realem Wert.",
    "desc": "Das echte Stellar Netzwerk mit realem Wert. Transaktionen sind endgültig und Gebühren werden in echtem XLM bezahlt."
  },
  "testnet": {
    "title": "Testnet",
    "original": "Testnet",
    "short": "Öffentliches Übungsnetzwerk ohne echten Wert.",
    "desc": "Ein öffentliches Übungsnetzwerk. Tokens haben keinen echten Wert. Ideal zum Lernen und Ausprobieren ohne Risiko."
  },
  "memo": {
    "title": "Memo",
    "original": "Memo",
    "short": "Kurze Notiz in einer Transaktion.",
    "desc": "Ein Memo ist eine kleine Notiz die du mit einer Transaktion mitschicken kannst. Oft verlangt eine Börse ein bestimmtes Memo damit sie weiß wem das Geld gehört."
  },
  "transaction": {
    "title": "Transaktion",
    "original": "Transaction",
    "short": "Aktion auf der Blockchain, z. B. Zahlung oder Trustline.",
    "desc": "Eine Transaktion ist eine Aktion auf der Blockchain. Zum Beispiel Geld senden oder eine Trustline anlegen. Eine Transaktion wird für immer gespeichert wenn sie bestätigt ist."
  },
  "fee": {
    "title": "Gebühr",
    "original": "Fee",
    "short": "Sehr kleiner Betrag pro Transaktion.",
    "desc": "Die Gebühr ist ein sehr kleiner Betrag den du bei jeder Transaktion zahlst. Die Gebühr geht an das Netzwerk. Bei Stellar sind die Gebühren sehr klein."
  },
  "ledger": {
    "title": "Ledger",
    "original": "Ledger",
    "short": "Kette der bestätigten Daten und Kontostände.",
    "desc": "Das Ledger ist die Kette aller bestätigten Daten. Dort steht welche Konten wie viel besitzen und welche Transaktionen passiert sind. Jeder kann das Ledger prüfen."
  },
  "horizon": {
    "title": "Horizon",
    "original": "Horizon",
    "short": "API‑Dienst, über den Apps mit Stellar sprechen.",
    "desc": "Horizon ist der Service über den Programme mit der Stellar Blockchain reden. Unser Tool fragt Horizon um Kontostände und Transaktionen zu laden."
  },
  "horizonHistory": {
    "title": "Horizon-Historie",
    "original": "Horizon history depth",
    "short": "Beschreibt, wie weit die von öffentlichen Horizon-Servern bereitgestellte Transaktionshistorie zurückreicht.",
    "desc": "Die von der Stellar Development Foundation betriebenen öffentlichen Horizon-Server (Mainnet und Testnet) stellen nur eine begrenzte Historie zur Verfügung – derzeit ungefähr ein Jahr rückwirkend. Ältere Daten sind über diese kostenlosen Endpunkte nicht mehr abrufbar. Wenn du weiter in die Vergangenheit zurück musst, hast du im Wesentlichen zwei Optionen: (1) du betreibst einen eigenen Horizon-Node mit vollständiger History (inklusive History Archives), oder (2) du nutzt Drittanbieter- bzw. Bezahldienste, die historische Stellar-Daten langfristig speichern und zur Verfügung stellen.",
    "seeAlso": [
      "horizon",
      "serverHorizon",
      "historyArchive"
    ]
  },
  "anchor": {
    "title": "Anchor",
    "original": "Anchor",
    "short": "Firma, die Fiat‑Geld mit Stellar verbindet.",
    "desc": "Ein Anchor ist eine Firma die echtes Geld wie Euro oder Dollar mit Stellar verbindet. Du gibst dem Anchor z. B. Euro und bekommst dafür einen Euro Token auf Stellar."
  },
  "exchange": {
    "title": "Börse",
    "original": "Exchange",
    "short": "Ort zum Kaufen und Verkaufen von Tokens.",
    "desc": "Eine Börse ist ein Ort an dem du Token kaufen oder verkaufen kannst. Viele Börsen verlangen ein KYC Verfahren also eine Ausweisprüfung bevor du Geld in Euro oder Franken rausziehen kannst."
  },
  "dex": {
    "title": "DEX",
    "original": "Decentralized Exchange",
    "short": "Dezentrale Börse direkt auf der Blockchain.",
    "desc": "DEX bedeutet Dezentrale Börse. Hier handeln die Leute direkt miteinander auf der Blockchain. Es gibt keinen einzelnen Betreiber. Stellar hat eine DEX direkt eingebaut."
  },
  "liquidityPool": {
    "title": "Liquiditätspool",
    "original": "Liquidity Pool",
    "short": "Gemeinsamer Topf mit zwei Tokens zum sofortigen Tausch.",
    "desc": "Ein Liquiditätspool ist ein gemeinsamer Topf mit zwei Tokens. Leute legen beide Tokens hinein. Andere dürfen dann diese Tokens sofort tauschen. Die Einzahler verdienen dafür kleine Gebühren."
  },
  "balanceClaimable": {
    "title": "Claimable Balance",
    "original": "Claimable Balance",
    "short": "Reserviertes Geld, das du noch annehmen musst.",
    "desc": "Eine Claimable Balance ist Geld das schon für dich reserviert ist aber du musst es noch abholen. Erst wenn du es annimmst geht es in dein Konto."
  },
  "protocolUpdate": {
    "title": "Protocol Update",
    "original": "Protocol Update",
    "short": "Aktualisierung der Netzwerk‑Regeln.",
    "desc": "Ein Protocol Update ist ein Upgrade der Regeln im Stellar Netzwerk. Zum Beispiel neue Funktionen oder Sicherheitsänderungen. Alle Knoten im Netzwerk müssen dieselben Regeln benutzen."
  },
  "soroban": {
    "title": "Soroban",
    "original": "Soroban",
    "short": "Stellars Smart‑Contract‑System.",
    "desc": "Soroban ist das Smart Contract System von Stellar. Ein Smart Contract ist Programmcode auf der Blockchain. Der Code kann selbst Regeln prüfen und Aktionen auslösen ohne eine Bank dazwischen."
  },
  "multiSignature": {
    "title": "Mehrfachsignatur",
    "original": "Multi-Signature",
    "short": "Mehrere Unterschriften nötig; Gewichte + Threshold bestimmen die Freigabe.",
    "desc": "Bei einer Mehrfachsignatur müssen mehrere Schlüssel unterschreiben, bevor eine Aktion gültig wird. Jeder Signer hat ein Gewicht, und die Summe muss das erforderliche Threshold erreichen. Das erhöht die Sicherheit, weil ein einzelner gestohlener Schlüssel nicht reicht."
  },
  "signer": {
    "title": "Unterzeichner",
    "original": "Signer",
    "short": "Öffentlicher Schlüssel mit Gewicht, Teil der Kontokonfiguration.",
    "desc": "Ein Signer ist ein öffentlicher Schlüssel, der zu einem Konto gehört und ein Gewicht hat. Seine Signatur zählt zum benötigten Threshold. Mehrere Signer können gemeinsam eine Transaktion freigeben.\n\nSigner-Typen:\n- ed25519 (normaler Schlüssel)\n- hashX (Hash-Vorlage)\n- preAuthTx (vorab autorisierte Transaktion)\n\nSKM unterstützt nur ed25519. Weitere Optionen findest du unter https://lab.stellar.org."
  },
  "thresholds": {
    "title": "Schwellenwerte",
    "original": "Thresholds",
    "short": "Grenzwerte (low/med/high), die die nötige Gewichtssumme festlegen.",
    "desc": "Thresholds definieren, wie viele gewichtete Signaturen für Aktionen nötig sind: low für einfache Operationen, med für Zahlungen, high für kritische Änderungen. Die Summe der Signer-Gewichte muss den jeweiligen Schwellenwert erreichen."
  },
  "masterWeight": {
    "title": "Mastergewicht",
    "original": "master_weight",
    "short": "Gewicht des Master-Schlüssels; steuert, wie stark der Hauptschlüssel zählt.",
    "desc": "Das Mastergewicht ist das Gewicht des Hauptschlüssels eines Kontos. Ein hohes master_weight erlaubt dem Master-Key, viele Aktionen allein zu signieren; ein niedriger Wert zwingt zu zusätzlichen Signern."
  },
  "accountConfig": {
    "title": "Kontokonfiguration",
    "original": "Account Configuration",
    "short": "Zusammenspiel von Signern und Thresholds, bestimmt die Sicherheit des Kontos.",
    "desc": "Die Kontokonfiguration legt fest, welche Signer mit welchen Gewichten existieren und welche Thresholds gelten. Änderungen an Signern oder Thresholds sind sicherheitskritisch, weil sie bestimmen, wie viele Unterschriften nötig sind."
  },
  "distributedNetwork": { "title": "Verteiltes Netzwerk", "original": "Distributed Network", "short": "Viele Computer arbeiten zusammen, statt dass einer alles entscheidet.", "desc": "Stell dir einen Markt vor, auf dem viele Händler die gleichen Regeln kennen. Fällt ein Teilnehmer aus, läuft es weiter, weil andere übernehmen können. So bleibt das System stabil und schwerer zu manipulieren." },
  "node": { "title": "Knoten / Node", "original": "Node", "short": "Ein einzelner Teilnehmer im Netzwerk.", "desc": "Ein Node ist wie ein Kassenbuch-Schreiber, der eine Kopie der Daten hält. Er prüft neue Einträge und gibt sie weiter. Viele Nodes zusammen machen das Netzwerk verlässlich." },
  "block": { "title": "Block", "original": "Block", "short": "Ein Block ist ein Paket von Einträgen.", "desc": "Wie eine Seite im Kassenbuch sammelt ein Block mehrere Vorgänge. Ist er voll, wird er abgeschlossen und an die Kette gehängt. So entsteht Schritt für Schritt die Historie." },
  "consensusMechanism": { "title": "Konsensmechanismus", "original": "Consensus Mechanism", "short": "Regeln, nach denen sich alle auf gültige Einträge einigen.", "desc": "Wie wenn eine Gruppe entscheidet, welcher Kassenbon zählt. So wird verhindert, dass jemand heimlich etwas ändert. Verschiedene Blockchains nutzen unterschiedliche Wege, das Ziel ist immer Einigkeit." },
  "finality": { "title": "Finalität / Endgültigkeit", "original": "Finality", "short": "Die Sicherheit, dass eine Transaktion endgültig ist.", "desc": "Wenn etwas final ist, fühlt es sich an wie ein fest gebuchter Kontoauszug. Man muss nicht mehr damit rechnen, dass es rückgängig gemacht wird. Das schafft Vertrauen." },
  "immutability": { "title": "Unveränderlichkeit", "original": "Immutability", "short": "Einträge sollen nachträglich nicht verändert werden.", "desc": "Wie beim Kassenbuch: Nachträgliches Radieren fällt auf. Änderungen werden als neuer Eintrag hinzugefügt, nicht übermalt. Das macht die Historie nachvollziehbar." },
  "decentralization": { "title": "Dezentralisierung", "original": "Decentralization", "short": "Keine zentrale Stelle kontrolliert alles.", "desc": "Statt eines Tresors gibt es viele Tresore mit denselben Informationen. Entscheidungen entstehen aus dem Zusammenspiel vieler Teilnehmer. Das macht das System robuster." },
  "publicBlockchain": { "title": "Öffentliche Blockchain", "original": "Public Blockchain", "short": "Offen für alle, die teilnehmen möchten.", "desc": "Jeder kann mitmachen und die Daten einsehen, ähnlich wie ein öffentlicher Aushang. Das erhöht Transparenz, aber jede Aktion ist für alle sichtbar. Regeln sorgen dafür, dass trotzdem niemand schummeln kann." },
  "privateBlockchain": { "title": "Private Blockchain", "original": "Private Blockchain", "short": "Zugang nur für ausgewählte Teilnehmer.", "desc": "Wie ein Firmen-Kassenbuch, das nur Mitarbeitende sehen dürfen. Das kann schneller und kontrollierter sein, ist aber weniger offen. Vertrauen entsteht hier durch die Organisation." },
  "permissionlessBlockchain": { "title": "Erlaubnisfreie Blockchain", "original": "Permissionless Blockchain", "short": "Jeder darf mitmachen, ohne Erlaubnis.", "desc": "Wie ein Markt, auf den jeder kommen kann. Das senkt Hürden, kann aber mehr Regeln brauchen, um fair zu bleiben. Beispiele sind viele öffentliche Blockchains." },
  "permissionedBlockchain": { "title": "Erlaubnispflichtige Blockchain", "original": "Permissioned Blockchain", "short": "Teilnahme nur mit Erlaubnis.", "desc": "Wie ein Club mit Mitgliederliste. Das kann klare Verantwortlichkeiten schaffen. Dafür ist es weniger offen." },
  "seedPhrase": { "title": "Wiederherstellungssatz", "original": "Seed Phrase / Recovery Phrase", "short": "Eine Wortliste, mit der du deine Wallet wiederherstellen kannst.", "desc": "Sie ist wie der Ersatzschlüssel zu deinem Tresor. Wer sie hat, kann deine Wallet wiederherstellen. Darum sollte sie niemals online gespeichert werden." },
  "selfCustody": { "title": "Selbstverwahrung", "original": "Self-Custody", "short": "Du verwahrst deine Schlüssel selbst.", "desc": "Wie Bargeld im eigenen Tresor: du hast die Kontrolle, aber auch die Verantwortung. Verlierst du den Zugang, kann niemand helfen. Für Anfänger ist Sorgfalt besonders wichtig." },
  "custodian": { "title": "Verwahrstelle", "original": "Custodian", "short": "Ein Dienstleister verwahrt deine Schlüssel für dich.", "desc": "Wie eine Bank, die dein Konto führt. Sie kann praktisch sein, nimmt dir aber die volle Kontrolle. Du musst ihr vertrauen." },
  "hardwareWallet": { "title": "Hardware-Wallet", "original": "Hardware Wallet", "short": "Ein physisches Gerät für deine Schlüssel.", "desc": "Wie ein kleiner Tresor in der Hosentasche. Die Schlüssel bleiben auf dem Gerät und gehen nicht ins Internet. Das schützt vor vielen Online-Angriffen." },
  "hotWallet": { "title": "Hot Wallet", "original": "Hot Wallet", "short": "Eine Wallet mit Internetzugang.", "desc": "Wie ein Portemonnaie in der Jacke: bequem, aber leichter angreifbar. Gut für kleine Beträge und den Alltag. Für große Summen eher nicht." },
  "coldWallet": { "title": "Cold Wallet", "original": "Cold Wallet", "short": "Eine Wallet ohne Internetverbindung.", "desc": "Wie ein Tresor im Keller. Sehr sicher, aber unpraktischer im Alltag. Eignet sich für langfristige Aufbewahrung." },
  "cryptocurrency": { "title": "Kryptowährung", "original": "Cryptocurrency", "short": "Digitale Währung, die direkt zwischen Menschen gesendet wird.", "desc": "Wie digitales Bargeld, nur ohne Bank. Du kannst es direkt an andere senden. Der Wert kann schwanken." },
  "altcoin": { "title": "Altcoin", "original": "Altcoin", "short": "Alle Kryptowährungen außer Bitcoin.", "desc": "Wie andere Marken auf dem Markt neben dem Platzhirsch. Manche sind bekannt, viele klein. Qualität und Risiko unterscheiden sich stark." },
  "stablecoin": { "title": "Stablecoin", "original": "Stablecoin", "short": "Kryptowährung mit möglichst stabilem Wert.", "desc": "Wie digitales Geld, das an eine normale Währung gekoppelt ist. Das macht es ruhiger im Preis. Trotzdem ist Vertrauen in den Anbieter wichtig." },
  "utilityToken": { "title": "Nutzungs-Token", "original": "Utility Token", "short": "Ein Token, mit dem man einen Dienst nutzen kann.", "desc": "Wie ein Gutschein auf einem Marktstand. Er gibt Zugang oder Rabatt. Sein Wert hängt vom Nutzen des Dienstes ab." },
  "securityToken": { "title": "Wertpapier-Token", "original": "Security Token", "short": "Ein Token mit Wertpapier-Charakter.", "desc": "Wie ein Anteilsschein. Er kann Rechte oder Gewinne versprechen. Dafür gelten oft strengere Regeln." },
  "governanceToken": { "title": "Governance-Token", "original": "Governance Token", "short": "Ein Token zum Mitbestimmen über Regeln.", "desc": "Wie eine Stimmkarte im Verein. Wer Token hat, kann über Regeln abstimmen. Das bedeutet Verantwortung." },
  "liquidityToken": { "title": "Liquiditäts-Token / LP-Token", "original": "Liquidity Token", "short": "Ein Token für bereitgestellte Liquidität.", "desc": "Wie eine Quittung, dass du Geld in einen gemeinsamen Topf gelegt hast. Du bekommst anteilig Gebühren. Der Wert kann sich bewegen." },
  "nft": { "title": "Nicht-fungibler Token / NFT", "original": "Non-Fungible Token", "short": "Ein einzigartiger digitaler Token.", "desc": "Wie ein signiertes Sammlerstück. Er steht für etwas Einmaliges, nicht für eine austauschbare Münze. Der Wert hängt von der Nachfrage ab." },
  "cbdc": { "title": "Zentralbank-Digitalgeld / CBDC", "original": "Central Bank Digital Currency", "short": "Digitales Geld, das von einer Zentralbank stammt.", "desc": "Wie digitales Bargeld vom Staat. Es wäre offizielles Geld, nur in digitaler Form. Details hängen vom jeweiligen Land ab." },
  "transactionStatus": { "title": "Transaktionsstatus", "original": "Transaction Status", "short": "Zeigt, ob eine Transaktion noch offen oder schon abgeschlossen ist.", "desc": "Wie die Sendungsverfolgung beim Paket: ausstehend, bestätigt oder fehlgeschlagen. So siehst du, ob alles geklappt hat. Manchmal dauert es ein wenig." },
  "gasFee": { "title": "Gas-Gebühr", "original": "Gas Fee", "short": "Eine Gebühr für Rechenarbeit im Netzwerk.", "desc": "Wie eine Bearbeitungsgebühr am Marktstand. Je mehr los ist, desto teurer kann es werden. Nicht jede Blockchain nennt das Gas." },
  "onChain": { "title": "On-Chain", "original": "On-Chain", "short": "Findet direkt auf der Blockchain statt.", "desc": "Wie ein Eintrag direkt ins Kassenbuch. Jeder kann ihn sehen. Das ist transparent, aber oft langsamer oder teurer." },
  "offChain": { "title": "Off-Chain", "original": "Off-Chain", "short": "Findet außerhalb der Blockchain statt.", "desc": "Wie eine mündliche Absprache, die später ins Kassenbuch kommt. Das kann schneller und günstiger sein. Vertrauen spielt hier eine größere Rolle." },
  "liquidity": { "title": "Liquidität", "original": "Liquidity", "short": "Zeigt, wie leicht man etwas handeln kann.", "desc": "Wie viele Käufer und Verkäufer es gibt. Hohe Liquidität bedeutet, du kannst schnell tauschen, ohne den Preis stark zu bewegen. Niedrige Liquidität fühlt sich zäh an." },
  "volatility": { "title": "Volatilität", "original": "Volatility", "short": "Wie stark Preise schwanken.", "desc": "Wie ein Markt mit wilden Preissprüngen. Hohe Volatilität bedeutet Chancen, aber auch Risiko. Für Anfänger kann das stressig sein." },
  "marketCap": { "title": "Marktkapitalisierung", "original": "Market Capitalization", "short": "Der Gesamtwert eines Coins oder Projekts.", "desc": "Wie der Gesamtwert aller Waren eines Marktes. Er ergibt sich grob aus Preis mal Umlaufmenge. Große Werte wirken stabiler, sind es aber nicht automatisch." },
  "circulatingSupply": { "title": "Umlaufmenge", "original": "Circulating Supply", "short": "Die Menge an Coins, die wirklich im Umlauf ist.", "desc": "Wie die Anzahl der Münzen, die wirklich auf dem Markt sind. Nicht alles, was existiert, ist schon im Umlauf. Das beeinflusst den Preis." },
  "priceDiscovery": { "title": "Preisfindung", "original": "Price Discovery", "short": "So entsteht der Preis durch Angebot und Nachfrage.", "desc": "Wie auf dem Markt: Angebot und Nachfrage treffen sich. Viele kleine Entscheidungen ergeben den Preis. Es gibt keinen festen Schalter." },
  "spread": { "title": "Handelsspanne", "original": "Spread", "short": "Der Abstand zwischen Kauf- und Verkaufspreis.", "desc": "Wie die Handelsspanne im Laden. Je kleiner der Abstand, desto fairer fühlt es sich an. Große Spreads machen Trades teurer." },
  "phishing": { "title": "Phishing", "original": "Phishing", "short": "Betrug durch gefälschte Nachrichten oder Webseiten.", "desc": "Wie eine falsche Bank-E-Mail, die dich in die Falle lockt. Ziel ist, dass du deine Zugangsdaten preisgibst. Niemals Links blind anklicken." },
  "smartContract": { "title": "Smart Contract", "original": "Smart Contract", "short": "Ein Programm, das feste Regeln automatisch ausführt.", "desc": "Wie ein Automat, der nach festen Regeln reagiert. Er führt Abmachungen automatisch aus. Das spart Vertrauen, braucht aber klare Regeln." },
  "programmableLogic": { "title": "Automatisierte Regeln", "original": "Programmable Logic", "short": "Regeln, die automatisch ablaufen, wenn etwas passiert.", "desc": "Wie eine Wenn-Dann-Regel in einem Automaten. Damit kann man Abläufe steuern, ohne jedes Mal manuell einzugreifen. So entstehen einfache digitale Verträge." },
  "networkCongestion": { "title": "Netzwerk-Auslastung", "original": "Network Congestion", "short": "Wenn sehr viele Transaktionen gleichzeitig anstehen.", "desc": "Wie Stau auf der Autobahn. Transaktionen brauchen länger und Gebühren können steigen. Mit weniger Verkehr geht es wieder schneller." },
  "blockchainTypes": { "title": "Blockchain-Typen", "original": "Blockchain Types", "short": "Es gibt verschiedene Arten von Blockchains mit unterschiedlichen Zielen.", "desc": "Wie verschiedene Fahrzeugtypen für unterschiedliche Wege. Manche sind für Zahlungen gebaut, andere für Programme. Es lohnt sich, den Zweck zu kennen." },
  "paymentBlockchain": { "title": "Zahlungs-Blockchain", "original": "Payment Blockchain", "short": "Eine Blockchain, die auf schnelle Zahlungen ausgelegt ist.", "desc": "Wie ein schnelles Kassenbuch für Geld. Der Fokus liegt auf günstigen und schnellen Überweisungen. Funktionen sind oft bewusst einfach gehalten." },
  "smartContractBlockchain": { "title": "Smart-Contract-Blockchain", "original": "Smart Contract Blockchain", "short": "Eine Blockchain, die Programme und Apps ausführen kann.", "desc": "Wie ein Markt mit vielen Automaten. Neben Zahlungen können dort Regeln und Apps laufen. Das macht sie vielseitig, aber oft komplexer." },
  "blockchainComparison": { "title": "Blockchain-Vergleich", "original": "Blockchain Comparison", "short": "Ein Vergleich zeigt Stärken und Schwächen verschiedener Blockchains.", "desc": "Wie der Vergleich von Banken oder Märkten: Jede hat Stärken und Schwächen. Wichtig sind Kosten, Geschwindigkeit und Sicherheit. Es gibt kein perfektes System für alles." },
  "stellarVsBitcoinVsEthereum": { "title": "Stellar vs. Bitcoin vs. Ethereum", "original": "Stellar vs. Bitcoin vs. Ethereum", "short": "Drei bekannte Blockchains mit unterschiedlichen Schwerpunkten.", "desc": "Bitcoin ist wie digitales Gold und wird oft als Wertspeicher gesehen. Ethereum ist wie eine Plattform für Programme und Apps. Stellar ist stark auf günstige Zahlungen ausgerichtet." },
  "missingKey": "Fehlender Glossar-Schlüssel: {{detail}}"
}
