{
  "pageTitle": "Glossar",
  "pageIntro": "Hier findest du wichtige Wörter aus der Blockchain Welt und aus dem Stellar Netzwerk. Alles ist in einfachen Worten erklärt.",
  "searchLabel": "Begriff suchen",
  "searchPlaceholder": "Begriff suchen (z. B. Konto, Account, Muxed)",
  "searchHint": "Die Suche findet Wörter und Erklärungen.",
  "noResults": "Kein Treffer.",
  "blockchain": {
    "title": "Blockchain",
    "original": "Blockchain",
    "short": "Gemeinsames digitales Kassenbuch – viele Computer speichern die gleichen Einträge.",
    "desc": "Eine Blockchain ist wie ein digitales Kassenbuch. Viele Computer speichern dieselben Einträge. So kann niemand heimlich etwas ändern."
  },
  "wallet": {
    "title": "Wallet",
    "original": "Wallet",
    "short": "Digitale Geldbörse, die deine Schlüssel verwaltet.",
    "desc": "Ein Wallet ist deine digitale Geldbörse. Es verwaltet die Schlüssel die du brauchst um auf dein Konto zuzugreifen und Transaktionen zu senden. Ein Wallet kann ein Programm sein oder eine App oder auch nur ein Zettel mit deinem Geheimschlüssel."
  },
  "account": {
    "title": "Konto",
    "original": "Account",
    "short": "Ein Blockchain-Konto kann Vermögenswerte halten und Transaktionen senden.",
    "desc": "Ein Konto ist die Stelle auf der Blockchain an der deine Werte liegen. Ein Konto hat eine öffentliche Adresse die mit G beginnt. Mehrere Wallets können auf dasselbe Konto zugreifen wenn sie den richtigen Schlüssel haben."
  },
  "addressG": {
    "title": "G-Adresse",
    "original": "G Address",
    "short": "Die öffentliche Hauptadresse eines Stellar-Kontos (beginnt mit G).",
    "desc": "Die G-Adresse ist die Hauptadresse eines Stellar Kontos. Sie beginnt mit dem Buchstaben G. Du gibst sie anderen damit sie dir etwas schicken können."
  },
  "publicKey": {
    "title": "Öffentlicher Schlüssel",
    "original": "Public Key",
    "short": "Adresse, die du teilen darfst; bei Stellar meist die G‑Adresse.",
    "desc": "Der öffentliche Schlüssel ist die Adresse die du zeigen darfst. Bei Stellar ist das die G-Adresse. Andere nutzen ihn um dir Geld zu senden."
  },
  "privateKey": {
    "title": "Geheimer Schlüssel",
    "original": "Secret Key",
    "short": "Passwort zum Konto – niemals weitergeben.",
    "desc": "Der geheime Schlüssel ist dein Passwort für das Konto. Wer diesen Schlüssel hat kann dein Geld bewegen. Niemals weitergeben."
  },
  "addressFederation": {
    "title": "Föderationsadresse",
    "original": "Federation Address",
    "short": "Kurze Adresse wie E‑Mail, zeigt auf eine G‑Adresse.",
    "desc": "Eine Föderationsadresse sieht aus wie eine E-Mail. Beispiel: name*domain.com. Diese kurze Adresse zeigt auf eine normale G-Adresse. Das ist einfacher zu merken."
  },
  "addressMuxed": {
    "title": "Muxed-Konto",
    "original": "Muxed Account",
    "short": "M‑Adresse mit zusätzlicher ID – teilt ein Basiskonto.",
    "desc": "Eine M-Adresse zeigt auf ein bestehendes Stellar Konto hat aber zusätzlich eine eigene Nummer (ID). So kann man z. B. mehrere Personen oder Abteilungen unter derselben G-Adresse unterscheiden. Technisch gehört das Geld weiter dem Hauptkonto."
  },
  "multisig": {
    "title": "Mehrfachsignatur",
    "original": "Multi‑Sig",
    "short": "Wichtige Aktionen brauchen mehr als eine Unterschrift.",
    "desc": "Multi-Sig steht für mehrere Unterschriften. Eine wichtige Aktion braucht mehr als einen Schlüssel. Beispiel: Du und ein zweiter Schlüssel müssen beide zustimmen bevor etwas gesendet wird. Das macht Diebstahl schwerer."
  },
  "trustline": {
    "title": "Trustline",
    "original": "Trustline",
    "short": "Zustimmung, einen Token eines bestimmten Herausgebers zu halten.",
    "desc": "Eine Trustline ist wie ein Ja ich akzeptiere diesen Token. Du sagst damit dass dein Konto bereit ist einen bestimmten Token von einem bestimmten Herausgeber zu halten. Ohne Trustline kannst du diesen Token nicht empfangen.\n\nBeispiel: Eine Trustline wird als CODE:ISSUER angegeben. Für EURT vom Herausgeber GDUKMGUGDZQK6Y… lautet sie EURT:GDUKMGUGDZQK6Y…"
  },
  "token": {
    "title": "Token",
    "original": "Token",
    "short": "Digitale Einheit – z. B. Geld, Punkte oder Guthaben.",
    "desc": "Ein Token ist eine digitale Einheit auf der Blockchain. Ein Token kann Geld darstellen oder Punkte oder Guthaben für einen Dienst."
  },
  "asset": {
    "title": "Asset",
    "original": "Asset",
    "short": "Token auf Stellar, immer mit Herausgeber verknüpft.",
    "desc": "Auf Stellar heißt ein Token Asset. Ein Asset ist immer verknüpft mit einem Herausgeber Konto. Zum Beispiel kann ein Konto einen Euro Token ausgeben. Dieser Euro Token ist dann ein Asset."
  },
  "xlm": {
    "title": "XLM",
    "original": "XLM",
    "short": "Native Währung von Stellar für Gebühren und Aktivierung.",
    "desc": "XLM ist die Grundwährung von Stellar. Du brauchst XLM um Gebühren zu zahlen und ein neues Konto zu starten."
  },
  "mainnet": {
    "title": "Mainnet",
    "original": "Mainnet",
    "short": "Echtes Stellar‑Netzwerk mit realem Wert.",
    "desc": "Das echte Stellar Netzwerk mit realem Wert. Transaktionen sind endgültig und Gebühren werden in echtem XLM bezahlt."
  },
  "testnet": {
    "title": "Testnet",
    "original": "Testnet",
    "short": "Öffentliches Übungsnetzwerk ohne echten Wert.",
    "desc": "Ein öffentliches Übungsnetzwerk. Tokens haben keinen echten Wert. Ideal zum Lernen und Ausprobieren ohne Risiko."
  },
  "memo": {
    "title": "Memo",
    "original": "Memo",
    "short": "Kurze Notiz in einer Transaktion.",
    "desc": "Ein Memo ist eine kleine Notiz die du mit einer Transaktion mitschicken kannst. Oft verlangt eine Börse ein bestimmtes Memo damit sie weiß wem das Geld gehört."
  },
  "transaction": {
    "title": "Transaktion",
    "original": "Transaction",
    "short": "Aktion auf der Blockchain, z. B. Zahlung oder Trustline.",
    "desc": "Eine Transaktion ist eine Aktion auf der Blockchain. Zum Beispiel Geld senden oder eine Trustline anlegen. Eine Transaktion wird für immer gespeichert wenn sie bestätigt ist."
  },
  "fee": {
    "title": "Gebühr",
    "original": "Fee",
    "short": "Sehr kleiner Betrag pro Transaktion.",
    "desc": "Die Gebühr ist ein sehr kleiner Betrag den du bei jeder Transaktion zahlst. Die Gebühr geht an das Netzwerk. Bei Stellar sind die Gebühren sehr klein."
  },
  "ledger": {
    "title": "Ledger",
    "original": "Ledger",
    "short": "Kette der bestätigten Daten und Kontostände.",
    "desc": "Das Ledger ist die Kette aller bestätigten Daten. Dort steht welche Konten wie viel besitzen und welche Transaktionen passiert sind. Jeder kann das Ledger prüfen."
  },
  "horizon": {
    "title": "Horizon",
    "original": "Horizon",
    "short": "API‑Dienst, über den Apps mit Stellar sprechen.",
    "desc": "Horizon ist der Service über den Programme mit der Stellar Blockchain reden. Unser Tool fragt Horizon um Kontostände und Transaktionen zu laden."
  },
  "horizonHistory": {
    "title": "Horizon-Historie",
    "original": "Horizon history depth",
    "short": "Beschreibt, wie weit die von öffentlichen Horizon-Servern bereitgestellte Transaktionshistorie zurückreicht.",
    "desc": "Die von der Stellar Development Foundation betriebenen öffentlichen Horizon-Server (Mainnet und Testnet) stellen nur eine begrenzte Historie zur Verfügung – derzeit ungefähr ein Jahr rückwirkend. Ältere Daten sind über diese kostenlosen Endpunkte nicht mehr abrufbar. Wenn du weiter in die Vergangenheit zurück musst, hast du im Wesentlichen zwei Optionen: (1) du betreibst einen eigenen Horizon-Node mit vollständiger History (inklusive History Archives), oder (2) du nutzt Drittanbieter- bzw. Bezahldienste, die historische Stellar-Daten langfristig speichern und zur Verfügung stellen.",
    "seeAlso": [
      "horizon",
      "serverHorizon",
      "historyArchive"
    ]
  },
  "anchor": {
    "title": "Anchor",
    "original": "Anchor",
    "short": "Firma, die Fiat‑Geld mit Stellar verbindet.",
    "desc": "Ein Anchor ist eine Firma die echtes Geld wie Euro oder Dollar mit Stellar verbindet. Du gibst dem Anchor z. B. Euro und bekommst dafür einen Euro Token auf Stellar."
  },
  "exchange": {
    "title": "Börse",
    "original": "Exchange",
    "short": "Ort zum Kaufen und Verkaufen von Tokens.",
    "desc": "Eine Börse ist ein Ort an dem du Token kaufen oder verkaufen kannst. Viele Börsen verlangen ein KYC Verfahren also eine Ausweisprüfung bevor du Geld in Euro oder Franken rausziehen kannst."
  },
  "dex": {
    "title": "DEX",
    "original": "Decentralized Exchange",
    "short": "Dezentrale Börse direkt auf der Blockchain.",
    "desc": "DEX bedeutet Dezentrale Börse. Hier handeln die Leute direkt miteinander auf der Blockchain. Es gibt keinen einzelnen Betreiber. Stellar hat eine DEX direkt eingebaut."
  },
  "liquidityPool": {
    "title": "Liquiditätspool",
    "original": "Liquidity Pool",
    "short": "Gemeinsamer Topf mit zwei Tokens zum sofortigen Tausch.",
    "desc": "Ein Liquiditätspool ist ein gemeinsamer Topf mit zwei Tokens. Leute legen beide Tokens hinein. Andere dürfen dann diese Tokens sofort tauschen. Die Einzahler verdienen dafür kleine Gebühren."
  },
  "balanceClaimable": {
    "title": "Claimable Balance",
    "original": "Claimable Balance",
    "short": "Reserviertes Geld, das du noch annehmen musst.",
    "desc": "Eine Claimable Balance ist Geld das schon für dich reserviert ist aber du musst es noch abholen. Erst wenn du es annimmst geht es in dein Konto."
  },
  "protocolUpdate": {
    "title": "Protocol Update",
    "original": "Protocol Update",
    "short": "Aktualisierung der Netzwerk‑Regeln.",
    "desc": "Ein Protocol Update ist ein Upgrade der Regeln im Stellar Netzwerk. Zum Beispiel neue Funktionen oder Sicherheitsänderungen. Alle Knoten im Netzwerk müssen dieselben Regeln benutzen."
  },
  "soroban": {
    "title": "Soroban",
    "original": "Soroban",
    "short": "Stellars Smart‑Contract‑System.",
    "desc": "Soroban ist das Smart Contract System von Stellar. Ein Smart Contract ist Programmcode auf der Blockchain. Der Code kann selbst Regeln prüfen und Aktionen auslösen ohne eine Bank dazwischen."
  },
  "multiSignature": {
    "title": "Mehrfachsignatur (Multi-Signature)",
    "original": "Multi-Signature",
    "short": "Mehrere Unterschriften nötig; Gewichte + Threshold bestimmen die Freigabe.",
    "desc": "Bei einer Mehrfachsignatur müssen mehrere Schlüssel unterschreiben, bevor eine Aktion gültig wird. Jeder Signer hat ein Gewicht, und die Summe muss das erforderliche Threshold erreichen. Das erhöht die Sicherheit, weil ein einzelner gestohlener Schlüssel nicht reicht."
  },
  "signer": {
    "title": "Unterzeichner (Signer)",
    "original": "Signer",
    "short": "Öffentlicher Schlüssel mit Gewicht, Teil der Kontokonfiguration.",
    "desc": "Ein Signer ist ein öffentlicher Schlüssel, der zu einem Konto gehört und ein Gewicht hat. Seine Signatur zählt zum benötigten Threshold. Mehrere Signer können gemeinsam eine Transaktion freigeben."
  },
  "thresholds": {
    "title": "Schwellenwerte (Thresholds)",
    "original": "Thresholds",
    "short": "Grenzwerte (low/med/high), die die nötige Gewichtssumme festlegen.",
    "desc": "Thresholds definieren, wie viele gewichtete Signaturen für Aktionen nötig sind: low für einfache Operationen, med für Zahlungen, high für kritische Änderungen. Die Summe der Signer-Gewichte muss den jeweiligen Schwellenwert erreichen."
  },
  "masterWeight": {
    "title": "Mastergewicht (master_weight)",
    "original": "master_weight",
    "short": "Gewicht des Master-Schlüssels; steuert, wie stark der Hauptschlüssel zählt.",
    "desc": "Das Mastergewicht ist das Gewicht des Hauptschlüssels eines Kontos. Ein hohes master_weight erlaubt dem Master-Key, viele Aktionen allein zu signieren; ein niedriger Wert zwingt zu zusätzlichen Signern."
  },
  "accountConfig": {
    "title": "Kontokonfiguration (Account Configuration)",
    "original": "Account Configuration",
    "short": "Zusammenspiel von Signern und Thresholds, bestimmt die Sicherheit des Kontos.",
    "desc": "Die Kontokonfiguration legt fest, welche Signer mit welchen Gewichten existieren und welche Thresholds gelten. Änderungen an Signern oder Thresholds sind sicherheitskritisch, weil sie bestimmen, wie viele Unterschriften nötig sind."
  },
  "missingKey": "Fehlender Glossar-Schlüssel: {{detail}}"
}
