{
  "title": "Allgemeine Erklärung eines Mehrfachsignatur (Multi-Signature) Firmenkontos",
  "intro": "Ein Unternehmen kann ein gemeinsames Blockchain-Konto verwenden, an dem mehrere berechtigte Personen beteiligt sind. Typischerweise sind mindestens drei Unterzeichner (Signer) eingebunden, zum Beispiel Geschäftsführung, Finanzverantwortlicher und Compliance/Backup. Ziel ist, dass einzelne Personen Zahlungen eigenständig ausführen können, ohne dass eine einzelne Person das Konto allein kontrollieren oder übernehmen kann.",
  "problem": "Wenn ein Unterzeichner (Signer) genug Gewicht hat, um Zahlungen auszuführen, und zugleich genug Gewicht für Kontoänderungen besitzt, könnte diese Person andere Unterzeichner (Signer) entfernen oder den Schwellenwert/Gewichtung (Thresholds) anpassen und damit das Konto übernehmen. Umgekehrt soll auch der ursprüngliche Owner nicht in der Lage sein, andere Unterzeichner (Signer) ohne Gegenkontrolle einfach auszuschließen. Eine Multi-Sig-Struktur sorgt dafür, dass wichtige Entscheidungen immer von mehreren Personen gemeinsam getragen werden.",
  "setupTitle": "Beispiel einer sicheren Multi-Sig-Struktur mit drei Signern",
  "setupWeights": "In einem Beispiel mit drei gleichberechtigten Rollen erhalten alle dieselbe Signaturstärke:\n- Unterzeichner (Signer) A (Geschäftsführung): Gewicht 2\n- Unterzeichner (Signer) B (Finanzen): Gewicht 2\n- Unterzeichner (Signer) C (Compliance/Backup): Gewicht 2",
  "setupThresholds": "Dazu werden geeignete Schwellenwerte/Gewichtungen gesetzt:\n- Niedrig (low_threshold): 1\n- Mittel (med_threshold): 2 (für Zahlungen und andere mittlere Aktionen)\n- Hoch (high_threshold): 4 (für Strukturänderungen wie Unterzeichner (Signer) hinzufügen/entfernen oder den Schwellenwert/Gewichtung (Thresholds) ändern)\nDamit kann jede einzelne berechtigte Person Zahlungen ausführen, aber keine Person allein die Konto-Struktur verändern.",
  "behavior": "Mit dieser Konfiguration können Zahlungen von jeder der drei berechtigten Personen alleine durchgeführt werden, weil das individuelle Gewicht jeweils den mittleren Schwellenwert/Gewichtung (Threshold) erfüllt. Für Strukturänderungen wie das Entfernen eines Unterzeichners (Signers), das Anpassen der Schwellenwerte/Gewichtungen oder das Zusammenlegen bzw. Schließen des Kontos wird hingegen der hohe Schwellenwert/Gewichtung (high_threshold) benötigt. Dieser Wert kann nur erreicht werden, wenn mindestens zwei der drei Unterzeichner (Signer) gemeinsam unterschreiben. Das Konto bleibt so gleichzeitig flexibel im Alltag und gut gegen Missbrauch geschützt.",
  "removal": "Wenn eine Person das Unternehmen verlässt oder nicht mehr vertrauenswürdig ist, können zwei der verbleibenden Unterzeichner (Signer) gemeinsam die Signaturrechte dieser Person entfernen. Kein einzelner Unterzeichner (Signer) – weder ein Mitarbeiter noch die Geschäftsführung – kann andere eigenständig aus dem Konto ausschließen. Der Entzug von Berechtigungen erfolgt also immer kontrolliert und nachvollziehbar durch mindestens zwei Verantwortliche.",
  "summary": "Diese Art von Multi-Sig-Struktur ermöglicht es, dass einzelne Personen Zahlungen effizient abwickeln können, während die Kontrolle über das Konto immer bei mehreren Beteiligten bleibt. Sie reduziert das Risiko von Kontoübernahmen, schützt vor einseitigen Entscheidungen und eignet sich besonders für Firmenkonten, bei denen sowohl Sicherheit als auch operative Flexibilität wichtig sind.",
  "closeLabel": "Schließen",
  "linkLabel": "Was bedeutet Multi-Signature?"
}
