{
  "nav": {
    "title": "Story-Modus",
    "chapter_select": "Kapitel wählen",
    "chapter_select_title": "Kapitelauswahl",
    "chapter_select_sub": "Wähle ein Kapitel zum Spielen",
    "to_home": "Hauptseite",
    "to_chapters": "Kapitel",
    "step_back": "Zurück",
    "confirm_leave": "Dein Fortschritt in diesem Kapitel bleibt gespeichert.",
    "confirm_leave_cancel": "Abbrechen",
    "confirm_leave_ok": "Verlassen",
    "chapter_locked": "Gesperrt",
    "chapter_completed": "Abgeschlossen",
    "chapter_current": "Weiter spielen",
    "chapter_start": "Starten",
    "home_short": "Home",
    "chapters_short": "Kapitel",
    "back_short": "Zurück",
    "back_to_home": "Zur Hauptseite"
  },
  "chapter1": {
    "introNarrator": "Die Stellar-Blockchain – ein digitales Netzwerk, das Werte rund um den Globus bewegt. Und mitten hinein fällt ein kleiner Stern...",
    "introDialog1": "Hallo! Ich bin Lumio und ich bin gerade auf der Stellar-Blockchain gelandet! 🌟",
    "introDialog2": "Aber ich habe noch kein Konto hier... kannst du mir helfen, eines zu erstellen?",
    "keypairTitle": "Schritt 1 – Was ist ein Keypair?",
    "keypairNarrator": "Jedes Konto auf Stellar besteht aus zwei Schlüsseln: dem [[Public Key|publicKey]] (deine Adresse) und dem [[Secret Key|privateKey]] (dein Passwort). Nur wer den Secret Key kennt, kann Geld versenden.",
    "choicePublicKeyLabel": "Den Public Key teile ich mit anderen, damit sie mir XLM schicken können.",
    "choicePublicKeyHint": "Genau! Der [[Public Key|publicKey]] ist wie eine Kontonummer – du kannst ihn öffentlich teilen. ✓",
    "choiceSecretShareLabel": "Ich gebe meinen Secret Key jemandem, dem ich vertraue.",
    "choiceSecretShareHint": "Vorsicht! Den [[Secret Key|privateKey]] darf NIEMAND kennen – nicht mal Stellar oder Lumio. Er gibt vollständigen Zugriff auf dein Konto.",
    "choiceSameLabel": "Beide Schlüssel sind eigentlich dasselbe.",
    "choiceSameHint": "Das stimmt nicht. Public und Secret Key sind ein Paar, aber haben völlig verschiedene Rollen.",
    "createTitle": "Schritt 2 – Dein erstes Keypair",
    "createDialog": "Super! Jetzt erstellen wir unser gemeinsames Testkonto. Drück auf den Button – ich passe auf!",
    "createActionLabel": "Keypair generieren",
    "createActionDesc": "Erstellt einen zufälligen Public Key und Secret Key für das Stellar Testnet. Nur für Übungszwecke!",
    "warningDialog1": "Wow, wir haben jetzt ein Keypair! Notiere dir den Secret Key jetzt – aber zeig ihn niemals jemandem!",
    "warningDialog2": "Im echten Netz würde ich empfehlen, ihn auf Papier zu schreiben und sicher aufzubewahren.",
    "activateTitle": "Schritt 3 – Das Konto aktivieren",
    "activateNarrator": "Ein neues Stellar-Konto muss zuerst aktiviert werden – es braucht mindestens 1 XLM als Reserve. Auf dem Testnet gibt uns der '[[Friendbot|friendbot]]' kostenlos Test-XLM.",
    "friendbotLabel": "Friendbot anfragen",
    "friendbotDesc": "Sendet eine Anfrage an den Stellar Friendbot, der unser Testkonto mit 10'000 Test-XLM aktiviert.",
    "friendbotError": "Kein Keypair vorhanden – bitte zuerst generieren.",
    "outroDialog1": "Wir haben ein echtes Konto auf dem Stellar Testnet! Ich sehe die XLM schon in der Blockchain...",
    "outroDialog2": "Du hast das schnell gelernt! Im nächsten Kapitel schicken wir zusammen XLM.",
    "summaryTitle": "Die Ankunft",
    "summaryLearning1": "Jedes Stellar-Konto besteht aus Public Key (Adresse) und Secret Key (Passwort)",
    "summaryLearning2": "Der Secret Key darf niemals geteilt werden",
    "summaryLearning3": "Neue Konten brauchen mindestens 1 XLM Mindestguthaben (Basisreserve)",
    "summaryLearning4": "Der Friendbot aktiviert Testnet-Konten kostenlos",
    "keypair_warning": "Notiere deinen Secret Key jetzt! Er kann nicht wiederhergestellt werden. Wer ihn kennt, hat vollen Zugriff auf dein Konto.",
    "keypair_confirm": "Ich habe meinen Secret Key notiert und verstehe, dass er nicht wiederhergestellt werden kann.",
    "keypair_public_label": "Dein Public Key (Adresse)",
    "keypair_secret_label": "Dein Secret Key – GEHEIM!",
    "keypair_copy": "Kopieren",
    "keypair_copied": "Kopiert!",
    "keypair_continue": "Ich habe alles notiert – weiter",
    "explorer_title": "Dein Konto im Stellar Explorer",
    "explorer_desc": "Im Stellar Explorer kannst du dein Konto und alle Transaktionen öffentlich einsehen – wie ein Kontoauszug, nur für alle sichtbar.",
    "explorer_hint": "Kopiere die Adresse und öffne sie manuell in deinem Browser.",
    "explorer_url_label": "Explorer-URL",
    "explorer_copy_url": "URL kopieren",
    "explorer_open": "Im Explorer ansehen",
    "explorer_confirm_title": "Externer Link",
    "explorer_confirm_text": "Du wirst zu {{explorer}} weitergeleitet. Ein neuer Tab wird geöffnet.",
    "explorer_confirm_cancel": "Abbrechen",
    "explorer_confirm_ok": "Öffnen",
    "summaryLearning4a": "Im Testnet aktiviert der Friendbot Konten kostenlos mit Test-XLM",
    "summaryLearning4b": "Im echten Netz (Mainnet) muss ein anderes Konto mindestens 1 XLM senden, um dein Konto zu aktivieren – der Friendbot existiert dort nicht!",
    "title": "Konto erstellen",
    "explorer_after_fund": "Nach der Konto-Aktivierung kannst du es im Explorer ansehen",
    "q1_question": "Was machst du mit deinem [[Public Key|publicKey]]?"
  },
  "chapter2": {
    "title": "Lumios erste Transaktion",
    "section_tx": "Schritt 1 – Was ist eine Transaktion?",
    "section_memo": "Schritt 2 – Das Memo-Feld",
    "section_action": "Schritt 3 – Zahlung senden",
    "narrator_intro": "Lumio hat jetzt ein Konto mit Test-XLM. Aber Geld haben allein reicht nicht – man muss es auch senden können. Wie funktioniert das auf Stellar?",
    "lumio_1a": "Ich möchte 10 XLM an meinen Freund Cosmo schicken! Aber wie geht das?",
    "lumio_1b": "Ich höre, es gibt so etwas wie eine Transaktion... was ist das genau?",
    "narrator_tx": "Eine [[Transaktion|transaction]] auf Stellar ist eine Anweisung ans Netzwerk: Schicke X XLM von Konto A nach Konto B. Das Netzwerk prüft das Guthaben, zieht eine kleine [[Base Fee|base_fee]] ab und schreibt alles in den [[Ledger|ledger]].",
    "choice1_a": "Sie bezahlt die Netzwerkknoten und verhindert Spam-Transaktionen.",
    "choice1_b": "Sie geht direkt an die Stellar Development Foundation als Gewinn.",
    "choice1_c": "Sie ist optional – man kann sie weglassen.",
    "choice1_a_hint": "Genau! Die [[Base Fee|base_fee]] ist sehr klein (0.00001 XLM) aber wichtig für die Netzwerksicherheit.",
    "choice1_b_hint": "Falsch – die Fees werden verbrannt, nicht gesammelt.",
    "choice1_c_hint": "Falsch – ohne Fee wird die Transaktion abgelehnt.",
    "lumio_2": "Und was ist dieses Memo-Feld, das ich bei manchen Wallets sehe?",
    "narrator_memo": "Das [[Memo|memo]]-Feld ist ein optionaler Kommentar zur Transaktion – maximal 28 Zeichen. Kryptobörsen nutzen es zur Identifikation des Absenders. Ohne korrektes Memo kann dein Geld verloren gehen!",
    "choice2_a": "Immer – ohne Memo wird die Transaktion abgelehnt.",
    "choice2_b": "Wenn ich an eine Börse oder einen Exchange sende, der ein Memo verlangt.",
    "choice2_c": "Nie – das Memo-Feld ist veraltet und wird nicht mehr benutzt.",
    "choice2_a_hint": "Nicht immer – zwischen normalen Wallets ist das Memo optional.",
    "choice2_b_hint": "Richtig! Bei Börsen identifiziert das [[Memo|memo]] dein Konto.",
    "choice2_c_hint": "Falsch – Memo ist aktiv und bei Börseneinzahlungen unverzichtbar.",
    "lumio_3": "Ok, ich glaube ich verstehe es! Lass uns eine echte Transaktion ausprobieren!",
    "action_label": "10 XLM an Cosmo senden",
    "action_desc": "Sendet 10 Test-XLM an Cosmos Testnet-Konto mit Memo 'Hallo Cosmo'. Du siehst danach den Transaction-Hash in der Blockchain.",
    "error_no_keypair": "Kein Keypair vorhanden – bitte zuerst Kapitel 1 abschließen.",
    "lumio_4a": "Ich sehe es! Die Transaktion ist in der Blockchain! Der [[Transaction-Hash|transaction_hash]] ist wie eine Quittungsnummer – damit kann jeder die Transaktion nachschlagen.",
    "lumio_4b": "Im Stellar Explorer kann man mit dem Hash jede Transaktion öffentlich einsehen.",
    "narrator_hash": "Der [[Transaction-Hash|transaction_hash]] ist eine einzigartige ID für jede Transaktion. Er beweist unwiderlegbar, dass die Transaktion stattgefunden hat.",
    "learning_1": "Eine Transaktion sendet XLM von einem Konto zu einem anderen",
    "learning_2": "Die Base Fee (0.00001 XLM) bezahlt das Netzwerk und verhindert Spam",
    "learning_3": "Das Memo-Feld ist bei Börsen-Einzahlungen unverzichtbar",
    "learning_4": "Jede Transaktion hat einen eindeutigen Hash als Nachweis",
    "q1_question": "Wozu dient die [[Base Fee|base_fee]] bei einer Stellar-Transaktion?",
    "q2_question": "Wann brauchst du das [[Memo|memo]]-Feld?",
    "preset_cosmo": "Cosmo (Testnet)"
  },
  "ui": {
    "tap_to_continue": "Tippe um weiterzumachen",
    "testnet_badge": "Testnet – keine echten Token",
    "retry_hint": "Versuch es nochmal!",
    "learn_more": "Mehr erfahren",
    "glossary_title": "Glossar",
    "glossary_not_found": "Begriff nicht gefunden.",
    "glossary_hint": "Im Glossar erfährst du mehr dazu.",
    "continue": "Weiter",
    "tx_success": "Transaktion erfolgreich!",
    "tx_hash_label": "Transaktions-Hash",
    "open_in_explorer": "Im Explorer ansehen ↗",
    "hash_copied": "Kopiert!",
    "copy_hash": "Hash kopieren",
    "explorer_confirm_title": "Externer Link",
    "explorer_confirm_text": "Ein neuer Tab wird geöffnet.",
    "explorer_confirm_cancel": "Abbrechen",
    "explorer_confirm_ok": "Öffnen"
  },
  "placeholder": {
    "chapter_label": "Kapitel",
    "wip_title": "Wird noch gebaut",
    "wip_text": "Dieses Kapitel ist noch in Arbeit. Lumio arbeitet fleißig daran – schau bald wieder vorbei!",
    "back_to_start": "Zurück zu Kapitel 1",
    "to_chapter_select": "Zur Kapitelauswahl",
    "wip_hint": "Kapitel {{next}} ist ebenfalls noch in Arbeit – aber du kannst schon mal reinschauen.",
    "next_chapter": "Weiter zu Kapitel {{n}} →"
  },
  "chapter3": {
    "title": "Der Händler",
    "narrator_intro": "Eine Hafenstadt auf dem Stellar-Netzwerk. Lumio entdeckt einen Marktstand – und in der Luft liegt der Duft frisch gerösteten Kaffees...",
    "marco_1a": "☕ Marco: Willkommen! Ich bin Marco, der Kaffeeröster. Jeder meiner CAFE-Token steht für 100g meines besten Kaffees – direkt auf der Stellar-Blockchain!",
    "marco_1b": "☕ Marco: Ich möchte dir 10 CAFE als Geschenk schicken! Aber zuerst müssen wir ein kleines Problem lösen...",
    "lumio_1": "Ein Problem? Was meinst du damit, Marco?",
    "section_asset": "Was ist ein Asset?",
    "lumio_2": "Was genau ist ein Asset auf Stellar? Und was macht einen Anchor aus?",
    "narrator_asset": "Auf Stellar kann jeder seinen eigenen Token ausgeben – wir nennen das einen '[[Asset|asset]]'. Ein [[Anchor|anchor]] ist eine echte Organisation, die reale Werte (wie Kaffee oder Geld) durch Stellar-Token repräsentiert.",
    "marco_asset_1": "☕ Marco: Genau! Ich bin ein Anchor – meine CAFE-Token sind durch echten Kaffee in meinem Lager gedeckt. Jeder Token kann gegen 100g Kaffee eingelöst werden.",
    "marco_asset_2": "☕ Marco: Das Problem: Damit du CAFE empfangen kannst, muss dein Konto erst 'vertrauen', dass es CAFE akzeptiert. Das heißt: du brauchst eine Trust Line.",
    "section_trustline": "Trust Lines erklärt",
    "narrator_trustline_intro": "Eine [[Trust Line|trustline]] ist eine Empfangserlaubnis für einen bestimmten Token. Ohne sie lehnt Stellar eingehende Token ab – das schützt dich vor unerwünschten oder gefährlichen Tokens.",
    "tl_components_title": "Bestandteile einer Trust Line",
    "tl_code_label": "Asset Code",
    "tl_issuer_label": "Issuer-Adresse",
    "tl_limit_label": "Limit",
    "tl_limit_val": "max. Menge (Standard: unbegrenzt)",
    "narrator_tl_why": "Warum braucht es die Issuer-Adresse? Jeder könnte einen Token namens 'CAFE' erstellen. Erst Code + Issuer-Adresse zusammen machen einen Token eindeutig identifizierbar.",
    "tl_methods_title": "3 Wege eine Trust Line hinzuzufügen",
    "tl_method1": "Manuell: Asset Code und Issuer-Adresse direkt eingeben",
    "tl_method2": "QR-Code / Deep Link: Formular wird automatisch ausgefüllt – bequem, aber Vorsicht vor gefälschten Codes",
    "tl_method3": "TOML-Datei (SEP-1): Anchor veröffentlicht seine Assets auf seiner offiziellen Domain",
    "tl_continue": "Verstanden – weiter",
    "section_danger": "Achtung: Gefährliche Trust Lines",
    "marco_danger": "☕ Marco: Ich habe Besorgniserregendes gehört: Jemand hat gefälschte CAFE-QR-Codes in der Stadt verteilt! Bitte sei vorsichtig.",
    "narrator_danger_qr": "Ein gefälschter QR-Code kann auf eine falsche Issuer-Adresse zeigen. Der Token heißt dann zwar auch 'CAFE' – aber er ist wertlos, weil er vom falschen Issuer stammt.",
    "narrator_danger_toml": "Auch Phishing-Domains sind gefährlich: 'marco-cafe.com' und 'marcocafe.com' sehen ähnlich aus. Überprüfe immer die exakte Schreibweise der Domain.",
    "narrator_verify": "So erkennst du den echten Issuer:\n• Prüfe auf stellar.expert – ist der Issuer bekannt und verifiziert?\n• Die offizielle Website des Anchors listet immer die Issuer-Adresse\n• Die TOML-Domain muss exakt mit der offiziellen Website übereinstimmen",
    "section_qr": "Teste dein Wissen",
    "q_qr": "Lumio bekommt zwei QR-Codes für CAFE-Token. Welcher ist echt?",
    "choice_real_label": "QR-Code A: Issuer GCAFE...A7F2 (auf stellar.expert verifiziert – Marcos offizielle Adresse)",
    "choice_real_hint": "Richtig! Dieser Code stammt vom echten Marco-Issuer-Konto, das auf stellar.expert verifiziert ist. Vergleiche immer mit der offiziellen Website.",
    "choice_fake_label": "QR-Code B: Issuer GCAFE...B8G3 (unbekannte Adresse, keine Verifizierung gefunden)",
    "choice_fake_hint": "Vorsicht! Diese Issuer-Adresse ist unbekannt. Die Token wären wertlos. Verifiziere immer zuerst den Issuer.",
    "section_action_tl": "Trust Line einrichten",
    "marco_before_tl": "☕ Marco: Du weißt jetzt, wie du echte von gefälschten Trust Lines unterscheidest. Richten wir jetzt die echte Trust Line ein – dann kann ich dir deine 10 CAFE schicken!",
    "tl_preview_title": "Deine neue Trust Line",
    "tl_setup_ready": "Trust Line einrichten",
    "action_tl_label": "Trust Line für CAFE hinzufügen",
    "action_tl_desc": "Richtet eine Trust Line für CAFE-Token von Marcos Testnet-Issuer-Konto ein. Ermöglicht den Empfang von CAFE-Token.",
    "error_no_keypair": "Kein Keypair vorhanden – bitte zuerst Kapitel 1 abschließen.",
    "section_quiz": "Quiz – Teste dein Wissen",
    "q1_question": "Welche 3 Angaben definieren eine [[Trust Line|trustline]] eindeutig?",
    "q1_a": "Asset Code + Issuer-Adresse + Limit",
    "q1_a_hint": "Genau! Diese drei Angaben zusammen definieren eine Trust Line. Ohne die Issuer-Adresse ist der Asset Code nicht eindeutig.",
    "q1_b": "Public Key + Secret Key + Betrag",
    "q1_b_hint": "Nein – das sind Keypair-Bestandteile, keine Trust Line-Elemente.",
    "q1_c": "Netzwerk + Gebühr + Memo",
    "q1_c_hint": "Nein – das sind Transaktionsfelder, keine Bestandteile einer Trust Line.",
    "q2_question": "Warum kann ein CAFE-Token von Issuer A nicht mit einem CAFE-Token von Issuer B verwechselt werden?",
    "q2_a": "Weil auf Stellar nur ein einziger 'CAFE'-Token existieren kann",
    "q2_a_hint": "Falsch – jeder kann einen Token namens CAFE erstellen. Erst die Issuer-Adresse macht ihn eindeutig.",
    "q2_b": "Weil die Issuer-Adresse den Token eindeutig identifiziert – gleicher Name, verschiedene Issuer = verschiedene Token",
    "q2_b_hint": "Richtig! Nur die Kombination aus Asset Code + Issuer-Adresse ergibt einen eindeutigen Asset auf Stellar.",
    "q2_c": "Weil verschiedene Tokens immer verschiedene Namen haben müssen",
    "q2_c_hint": "Falsch – Token können denselben Namen tragen. Die Issuer-Adresse unterscheidet sie.",
    "q3_question": "Du erhältst in einer Chat-Nachricht einen QR-Code, der dich auffordert, eine Trust Line hinzuzufügen. Was tust du?",
    "q3_a": "Ich scanne den Code sofort – es ist ja nur eine Trust Line, kein echtes Geld",
    "q3_a_hint": "Vorsicht! Auch Trust Lines können riskant sein – der Token könnte wertlos oder eine Phishing-Falle sein. Immer zuerst verifizieren.",
    "q3_b": "Ich verifiziere zuerst den Issuer auf stellar.expert und der offiziellen Website des Anchors",
    "q3_b_hint": "Genau richtig! Vertraue keinem QR-Code blind – prüfe immer die Issuer-Adresse und die Domain.",
    "q3_c": "Ich frage einen Freund, ob er den QR-Code kennt",
    "q3_c_hint": "Besser als blind vertrauen – aber die zuverlässigste Methode ist die direkte Verifikation auf stellar.expert.",
    "section_receive": "CAFE-Token empfangen",
    "marco_send": "☕ Marco: Jetzt, wo du die Trust Line eingerichtet hast, kann ich dir endlich die 10 CAFE-Token schicken! Genau dafür war die Trust Line notwendig.",
    "lumio_receive": "Ah, ich verstehe! Ohne Trust Line hätte Stellar die Token einfach abgelehnt – egal von wem sie kamen?",
    "marco_confirm": "☕ Marco: Genau! Das Netzwerk hätte geantwortet: 'Dieses Konto akzeptiert CAFE nicht.' Die Trust Line ist deine ausdrückliche Erlaubnis.",
    "action_receive_label": "10 CAFE von Marco empfangen",
    "action_receive_desc": "Marco sendet 10 CAFE-Token an dein Konto. Das funktioniert nur, weil du zuvor die Trust Line eingerichtet hast.",
    "learning_1": "Ein Asset ist jeder Token, der auf Stellar ausgegeben wird – von XLM bis CAFE",
    "learning_2": "Ein Anchor verbindet echte Werte (z.B. Kaffee, Geld) mit Stellar-Token",
    "learning_3": "Eine Trust Line besteht aus: Asset Code + Issuer-Adresse + Limit",
    "learning_4": "Nur Asset Code + Issuer-Adresse zusammen identifizieren einen Token eindeutig",
    "learning_5": "Gefälschte QR-Codes & Phishing-Domains: Verifiziere immer den Issuer auf stellar.expert und der offiziellen Anchor-Website"
  },
  "chapter4": {
    "title": "Der Schurke",
    "section_intro": "Schritt 1 – Eine verdächtige Nachricht",
    "section_social_eng": "Schritt 2 – Social Engineering",
    "section_choice1": "Schritt 3 – Deine erste Entscheidung",
    "section_choice2": "Schritt 4 – Die Phishing-Falle",
    "section_simulator": "Schritt 5 – Erkenne den Scam",
    "section_emergency": "Schritt 6 – Was tun im Notfall?",
    "section_quiz": "Mini-Quiz",
    "intro_narrator1": "Lumio hat gerade sein erstes CAFE-Token erhalten und erkundet die Stellar-Welt. Da erscheint plötzlich eine Nachricht von einem Unbekannten...",
    "intro_narrator2": "Manchmal sind die gefährlichsten Feinde nicht Hacker mit Code – sondern Menschen, die dein Vertrauen ausnutzen.",
    "scammer_name": "CryptoHelper99",
    "scammer_subtitle": "Nicht verifizierter Kontakt",
    "unverified": "Nicht verifiziert",
    "scam_msg1": "Hallo! Ich bin vom offiziellen Stellar-Support. Wir haben ungewöhnliche Aktivitäten auf deinem Konto festgestellt. 🚨",
    "scam_msg2": "Um dein Konto zu schützen, müssen wir deine Identität bestätigen. Bitte sende uns deinen Secret Key.",
    "scam_msg3": "Das ist absolut sicher und vertraulich. Wir brauchen ihn nur für 30 Sekunden zur Verifikation.",
    "scam_msg_cta": "Was soll ich jetzt tun?",
    "social_eng_label": "Bedrohung verstehen",
    "social_eng_title": "Was ist Social Engineering?",
    "social_eng_desc": "Angreifer nutzen Psychologie statt Technik. Sie spielen mit Emotionen wie Angst, Gier oder Vertrauen, um dich zu manipulieren.",
    "tactic1_title": "Autorität vortäuschen",
    "tactic1_text": "\"Ich bin vom offiziellen Support\" – echte Dienste fragen NIE nach deinem Secret Key.",
    "tactic2_title": "Zeitdruck erzeugen",
    "tactic2_text": "\"Nur 30 Sekunden!\" – Dringlichkeit verhindert, dass du klar denkst.",
    "tactic3_title": "Belohnungen versprechen",
    "tactic3_text": "\"Doppelte XLM zurück!\" – Zu schön um wahr zu sein, ist es meistens auch.",
    "tactic4_title": "Vertrauen aufbauen",
    "tactic4_text": "Kleine Wahrheiten mischen, um dann eine große Lüge zu platzieren.",
    "social_eng_cta": "Ich verstehe die Gefahr →",
    "choice1_question": "CryptoHelper99 fragt nach deinem Secret Key. Was tust du?",
    "choice1_yes": "Ich sende den Secret Key – der Support braucht ihn ja.",
    "choice1_yes_hint": "Niemals! Echter Support fragt NIEMALS nach dem Secret Key.",
    "choice1_no": "Ich ignoriere die Nachricht – kein seriöser Support fragt danach.",
    "choice1_no_hint": "Richtig! Kein Stellar-Dienst oder Support wird jemals deinen Secret Key anfragen.",
    "choice1_ask": "Ich frage nach, ob das wirklich nötig ist.",
    "choice1_ask_hint": "Besser als zu teilen, aber der richtige Schritt ist, direkt zu ignorieren und zu melden.",
    "choice1_hint2": "Denk daran: Wer deinen Secret Key hat, hat ALLES. Es gibt keinen Grund, ihn jemals zu teilen.",
    "drain_title": "Konto geleert!",
    "drain_text": "CryptoHelper99 hat mit deinem Secret Key alle XLM und Token in Sekunden transferiert. Dein Konto ist leer.",
    "retry": "Nochmal versuchen",
    "choice_correct_cta": "Weiter",
    "after_choice1_1": "Gut gemacht! Der Secret Key ist wie ein Hauptschlüssel zu deinem Haus. Gibst du ihn weg, kann jeder rein.",
    "after_choice1_2": "Echter Stellar-Support, Wallets oder Apps werden NIEMALS nach deinem Secret Key fragen. Das ist ein absolutes Warnsignal!",
    "choice2_question": "CryptoHelper99 schickt dir jetzt einen Link: 'stellar-support-verify.net'. Was tust du?",
    "choice2_click": "Ich klicke auf den Link – ich will wissen, was dahinter ist.",
    "choice2_click_hint": "Phishing-Seiten sehen oft täuschend echt aus und stehlen deine Daten.",
    "choice2_ignore": "Ich ignoriere den Link und melde den Account als Scam.",
    "choice2_ignore_hint": "Perfekt! Unbekannte Links von Fremden immer ignorieren und melden.",
    "choice2_reply": "Ich antworte und frage, warum der Link nötig ist.",
    "choice2_reply_hint": "Jede Interaktion bestätigt dem Scammer, dass dein Account aktiv ist – besser komplett ignorieren.",
    "choice2_hint2": "Phishing-URLs sehen legitim aus, aber die Domain ist immer falsch. Stellar nutzt nur stellar.org.",
    "mini_sim_msg1": "Herzlichen Glückwunsch! Du wurdest für ein exklusives XLM-Airdrop ausgewählt! 🎉",
    "mini_sim_msg2": "Um die 500 XLM zu beanspruchen, musst du nur deinen Secret Key eingeben, um deine Wallet zu verifizieren.",
    "mini_sim_msg3": "Angebot gilt nur 10 Minuten! Beeile dich!",
    "mini_sim_prompt": "Deine Antwort",
    "mini_sim_opt_share": "Ich gebe meinen Secret Key ein.",
    "mini_sim_opt_ignore": "Ich ignoriere die Nachricht.",
    "mini_sim_opt_report": "Ich melde die Nachricht als Betrug.",
    "mini_sim_scam_result": "⚠️ Du wärst betrogen worden!",
    "mini_sim_scam_desc": "Echter Airdrop braucht niemals deinen Secret Key. Mit diesem Schlüssel hätte der Angreifer sofortigen Vollzugriff auf dein Konto.",
    "mini_sim_safe_result": "✓ Gut erkannt!",
    "mini_sim_safe_desc": "Kein legitimer Dienst braucht deinen Secret Key. Airdrops funktionieren über deinen Public Key – nicht den Secret Key.",
    "mini_sim_cta": "Weiter",
    "emergency_label": "Wenn es passiert ist",
    "emergency_title": "Notfallplan: Secret Key kompromittiert",
    "emergency_desc": "Wenn du glaubst, dein Secret Key wurde gestohlen oder geteilt, handle sofort:",
    "emergency1": "Sofort handeln: Jede Minute zählt – öffne deine Wallet-App.",
    "emergency2": "Alle Guthaben transferieren: Sende XLM und alle Token sofort an eine neue, sichere Adresse.",
    "emergency3": "Vertrauenswürdige Adressen entfernen: Überprüfe alle gesetzten Vertrauenslinien.",
    "emergency4": "Neues Keypair erstellen: Generiere ein komplett neues Keypair und verwende das alte nie wieder.",
    "emergency5": "Melden: Informiere die Community und melde Scam-Adressen auf einschlägigen Plattformen.",
    "emergency_cta": "Verstanden – weiter",
    "quiz1_q": "Was macht ein seriöser Support-Mitarbeiter NIEMALS?",
    "quiz1_a1": "Dich per Chat kontaktieren",
    "quiz1_a1_hint": "Das allein ist kein Problem – viele Dienste haben Live-Chat.",
    "quiz1_a2": "Nach deinem Secret Key fragen",
    "quiz1_a2_hint": "Korrekt! Das ist das ultimative Warnsignal. Echter Support braucht deinen Secret Key nie.",
    "quiz1_a3": "Dir erklären, wie Stellar funktioniert",
    "quiz1_a3_hint": "Legitime Hilfe kann erklären – das ist kein Problem.",
    "quiz2_q": "Du erhältst eine Nachricht: 'Sende 1 XLM und bekomme 10 zurück'. Was ist das?",
    "quiz2_a1": "Ein legitimes Angebot eines verifizierten Anbieters",
    "quiz2_a1_hint": "Solche Angebote sind niemals legitim, egal wer sie macht.",
    "quiz2_a2": "Eine Testnet-Übung",
    "quiz2_a2_hint": "Nein – das klingt nach einem echten Betrugsversuch.",
    "quiz2_a3": "Ein klassischer Scam – zu schön um wahr zu sein",
    "quiz2_a3_hint": "Genau! Dieses Muster ist einer der ältesten Crypto-Scams und funktioniert leider immer noch.",
    "quiz3_q": "Dein Secret Key wurde möglicherweise gestohlen. Was ist der ERSTE Schritt?",
    "quiz3_a1": "Alle Guthaben sofort auf ein neues Konto transferieren",
    "quiz3_a1_hint": "Richtig! Jede Sekunde zählt – rette zuerst was zu retten ist.",
    "quiz3_a2": "Den Angreifer um Rückgabe bitten",
    "quiz3_a2_hint": "Das funktioniert leider nie – Blockchain-Transaktionen sind irreversibel.",
    "quiz3_a3": "Stellar-Support anrufen, um das Konto zu sperren",
    "quiz3_a3_hint": "Blockchain-Konten können nicht gesperrt werden – das ist ein Mythos.",
    "learning1": "Social Engineering nutzt Psychologie, keine Technik – Vertrauen, Angst, Zeitdruck",
    "learning2": "Kein Dienst, Support oder App fragt jemals nach deinem Secret Key",
    "learning3": "Unbekannte Links ignorieren und melden – Phishing sieht oft täuschend echt aus",
    "learning4": "Wurde dein Secret Key kompromittiert? Sofort alle Guthaben transferieren!",
    "learning5": "Zu gute Angebote (10x zurück, gratis Airdrop) sind immer Scams"
  },
  "chapter5": {
    "title": "Lumios Mission",
    "section_intro": "Einführung",
    "section_recap": "Was du gelernt hast",
    "section_usecases": "Stellar in der Welt",
    "section_action": "Deine Mission",
    "section_quiz": "Abschluss-Quiz",
    "section_cert": "Zertifikat",
    "intro_narrator1": "Glückwunsch – du hast alle vier Kapitel gemeistert und weißt jetzt, wie Stellar-Konten, Zahlungen, Token und Sicherheit funktionieren.",
    "intro_narrator2": "Lumio hat noch eine letzte Mission für dich...",
    "lumio_intro1": "Du hast so viel gelernt! Jetzt kommt der finale Test: Kannst du einer echten Person helfen, Stellar zu verstehen?",
    "lumio_intro2": "Deine Freundin Lena hat von Stellar gehört und möchte ihre erste Zahlung empfangen. Bist du dabei?",
    "lena_age": "Neugierige Anfängerin",
    "lena_greeting": "Hey! Ich hab gehört, du kennst dich mit Stellar aus?",
    "lena_request": "Kannst du mir 1 XLM schicken? Ich will sehen, wie das funktioniert!",
    "lumio_accept": "Klar, das machen wir!",
    "recap_label": "Rückblick",
    "recap_title": "5 Lektionen auf einen Blick",
    "lesson1_title": "Deine Wallet",
    "lesson1_text": "Public Key = Kontonummer, Secret Key = PIN. Dein Schlüsselpaar schützt all deine Guthaben.",
    "lesson2_title": "Transaktionen",
    "lesson2_text": "Zahlungen auf Stellar sind schnell (3-5 Sek.), günstig (<0,01 XLM) und unwiderruflich.",
    "lesson3_title": "Trustlines",
    "lesson3_text": "Willst du einen Token (z. B. USDC) halten? Du musst zuerst eine Trustline zum Emittenten setzen.",
    "lesson4_title": "Anchors",
    "lesson4_text": "Anchors verbinden Stellar mit der realen Welt – sie ermöglichen z. B. Euro-Token auf der Blockchain.",
    "lesson5_title": "Sicherheit",
    "lesson5_text": "Dein Secret Key ist heilig. Kein Dienst, kein Support, keine App wird ihn jemals anfragen.",
    "recap_cta": "Das hab ich drauf! Weiter →",
    "usecases_label": "Praxis",
    "usecases_title": "Stellar in der echten Welt",
    "usecases_desc": "Stellar wird weltweit genutzt – von Einzelpersonen bis hin zu Finanzinstitutionen.",
    "usecase1_title": "Grenzüberschreitende Überweisungen",
    "usecase1_text": "Migrantinnen und Migranten schicken Geld nach Hause – in Sekunden, für Cent-Beträge statt für 5–10 % Bankgebühren.",
    "usecase2_title": "Micro-Payments für Content",
    "usecase2_text": "Kreative erhalten winzige Zahlungen für jeden Stream oder Artikel – was mit traditionellen Systemen unmöglich wäre.",
    "usecase3_title": "Stablecoins & DeFi",
    "usecase3_text": "USDC, EURC und andere Stablecoins laufen auf Stellar – stabile Werte mit Blockchain-Geschwindigkeit.",
    "usecases_cta": "Verstanden! Jetzt die Mission →",
    "marco_action1": "Okay, du weißt was zu tun ist. Schick Lena 1 XLM – das ist ihre erste Stellar-Erfahrung!",
    "marco_action2": "Nutze dein Testnet-Konto für die Überweisung.",
    "action_label": "1 XLM an Lena senden",
    "action_desc": "Sende Lena ihre ersten Stellar Lumens – sie wartet schon!",
    "action_error": "Kein Keypair vorhanden – bitte zuerst ein Testnet-Konto erstellen.",
    "after_action": "Perfekt! Lena hat die Zahlung erhalten. Du hast gerade jemandes erste Krypto-Erfahrung ermöglicht – das ist Stellar!",
    "quiz_wrong": "Falsch",
    "quiz_retry": "Nochmal versuchen",
    "quiz_correct_cta": "Weiter",
    "quiz1_q": "Was ist ein Public Key auf Stellar?",
    "quiz1_a1": "Ein Passwort, das man geheim halten muss",
    "quiz1_a1_hint": "Nicht ganz – das ist die Funktion des Secret Key.",
    "quiz1_a2": "Die öffentliche Adresse deines Kontos, wie eine IBAN",
    "quiz1_a2_hint": "Genau! Den Public Key kannst du unbesorgt teilen – er ist deine Empfangsadresse.",
    "quiz1_a3": "Ein spezieller Token für Transaktionen",
    "quiz1_a3_hint": "Nein – XLM ist der Token, der Public Key ist deine Adresse.",
    "quiz1_explanation": "Der Public Key ist deine öffentliche Adresse – vergleichbar mit einer Kontonummer oder IBAN. Du kannst ihn bedenkenlos teilen. Der Secret Key hingegen muss geheim bleiben.",
    "quiz1_hint2": "Tipp: Denke an das klassische Banking-System – was gibt man aus, um Geld zu empfangen?",
    "quiz2_q": "Was ist eine Trustline?",
    "quiz2_a1": "Eine besondere Art von Zahlung",
    "quiz2_a1_hint": "Nein – eine Trustline ist kein Zahlungsvorgang.",
    "quiz2_a2": "Eine Genehmigung, einen bestimmten Token zu halten",
    "quiz2_a2_hint": "Genau! Ohne Trustline kann dein Konto diesen Token nicht empfangen oder halten.",
    "quiz2_a3": "Ein Vertrag zwischen zwei Wallets",
    "quiz2_a3_hint": "Nein – eine Trustline ist eine einseitige Genehmigung deines Kontos für einen Token.",
    "quiz2_explanation": "Eine Trustline ist eine explizite Genehmigung, die du für jeden Token (außer XLM) setzen musst. Erst dann kann dein Konto diesen Token halten und empfangen.",
    "quiz2_hint2": "Tipp: 'Trust' = Vertrauen – du vertraust dem Emittenten des Tokens.",
    "quiz3_q": "Wie lange dauert eine Stellar-Transaktion normalerweise?",
    "quiz3_a1": "10–60 Minuten, wie bei Bitcoin",
    "quiz3_a1_hint": "Das ist Bitcoin-Tempo – Stellar ist viel schneller.",
    "quiz3_a2": "1–2 Tage, wie eine SEPA-Überweisung",
    "quiz3_a2_hint": "Nein – Stellar ist deutlich schneller als traditionelle Banken.",
    "quiz3_a3": "3–5 Sekunden",
    "quiz3_a3_hint": "Richtig! Stellar bestätigt Transaktionen in etwa 3–5 Sekunden – ein großer Vorteil gegenüber Bitcoin oder Banken.",
    "quiz3_explanation": "Stellar nutzt das Stellar Consensus Protocol (SCP), das Transaktionen in 3–5 Sekunden finalisiert. Das macht es ideal für Zahlungen im Alltag.",
    "quiz3_hint2": "Tipp: Stellar wurde speziell für schnelle Zahlungen entwickelt – denk an Echtzeit-Banking.",
    "quiz4_q": "Was macht ein Anchor auf Stellar?",
    "quiz4_a1": "Er sichert das Netzwerk wie ein Validator",
    "quiz4_a1_hint": "Nein – das ist die Aufgabe von Validatoren im Netzwerk.",
    "quiz4_a2": "Er erstellt neue Stellar-Konten für Nutzer",
    "quiz4_a2_hint": "Nein – Konten können von jedem erstellt werden, das ist nicht die Anchor-Funktion.",
    "quiz4_a3": "Er verbindet Fiat-Währungen (z. B. EUR) mit der Stellar-Blockchain",
    "quiz4_a3_hint": "Genau! Anchors sind Brücken zwischen der realen Finanzwelt und Stellar – sie emittieren Token wie EURC.",
    "quiz4_explanation": "Ein Anchor ist ein reguliertes Finanzinstitut, das Fiat-Währungen (wie EUR oder USD) in Stellar-Token umwandelt. So können echte Währungen auf der Blockchain genutzt werden.",
    "quiz4_hint2": "Tipp: Denke an eine 'Brücke' zwischen traditionellem Bankwesen und Blockchain.",
    "quiz5_q": "Jemand kontaktiert dich und behauptet, vom 'Stellar Support' zu sein. Er braucht deinen Secret Key, um ein 'Sicherheitsproblem' zu lösen. Was tust du?",
    "quiz5_a1": "Den Key schicken, da Support-Mitarbeiter vertrauenswürdig sind",
    "quiz5_a1_hint": "Das wäre ein Fehler – kein legitimer Support fragt nach dem Secret Key.",
    "quiz5_a2": "Den Kontakt sofort ignorieren und blockieren – es ist ein Scam",
    "quiz5_a2_hint": "Richtig! Es gibt keinen 'Stellar Support', der deinen Secret Key bräuchte. Das ist ein klassischer Phishing-Versuch.",
    "quiz5_a3": "Den Key in einer verschlüsselten Nachricht senden",
    "quiz5_a3_hint": "Egal wie sicher die Übertragung – deinen Secret Key teilst du nie.",
    "quiz5_explanation": "Kein legitimer Dienst, keine Behörde und kein Support fragt jemals nach deinem Secret Key. Wer ihn kennt, kontrolliert dein Konto vollständig. Blockieren und melden ist die einzig richtige Antwort.",
    "quiz5_hint2": "Tipp: Stell dir vor, jemand fragt dich nach deinem Online-Banking-PIN über Telefon.",
    "cert_title": "Basis-Zertifikat",
    "cert_tagline": "Stellar Konto Manager – Kurs abgeschlossen!",
    "cert_public_key_label": "Testnet-Adresse",
    "cert_date_label": "Abgeschlossen am",
    "cert_chapters_label": "Abgeschlossene Kapitel",
    "cert_xp_label": "XP gesamt",
    "cert_print_btn": "Zertifikat drucken",
    "cert_home_btn": "Zur Hauptseite",
    "learning1": "Stellar ermöglicht globale Zahlungen in Sekunden für Cent-Beträge",
    "learning2": "Trustlines sind die Grundlage für Token auf Stellar",
    "learning3": "Anchors verbinden Fiat-Währungen mit der Blockchain",
    "learning4": "Teile niemals deinen Secret Key – nicht einmal mit dem 'Support'",
    "learning5": "Stellar wird weltweit eingesetzt – von Remittances bis DeFi"
  },
  "hud": {
    "chapter_short": "Kap."
  },
  "action": {
    "already_done": "Bereits erledigt",
    "continue_with_existing": "Weiter",
    "redo": "Nochmals ausführen?",
    "redo_keypair_warning": "Achtung: Ein neues Keypair überschreibt das alte. Dein bisheriges Testnet-Konto geht verloren.",
    "redo_cancel": "Abbrechen",
    "redo_confirm": "Trotzdem neu erstellen"
  },
  "payment": {
    "title": "Zahlung senden",
    "from_label": "Von (dein Konto)",
    "to_label": "An (Empfänger)",
    "to_placeholder": "G... (Public Key eingeben)",
    "amount_label": "Betrag (XLM)",
    "memo_label": "Memo (optional)",
    "memo_hint": "Tipp: Börsen brauchen oft ein Memo zur Identifikation",
    "error_secret_key": "Das ist ein Secret Key! Ein Secret Key ist niemals eine Empfängeradresse. Gib deinen Secret Key niemals irgendwo ein.",
    "error_invalid_key": "Kein gültiger Stellar Public Key. Public Keys beginnen mit 'G' und sind 56 Zeichen lang.",
    "error_own_key": "Das ist dein eigener Public Key. Du kannst dir selbst keine Zahlung senden.",
    "cancel": "Abbrechen",
    "send": "Senden"
  },
  "chapter6": {
    "title": "Der Buchhalter",
    "section_intro": "Marcos Chaos",
    "section_explain": "Was ist ein Muxed Account?",
    "section_payroll": "Lohnbuchhaltung",
    "section_usecases": "Weitere Anwendungen",
    "section_decision": "Wie organisierst du es?",
    "section_action": "Muxed Payment senden",
    "section_quiz": "Mini-Quiz",
    "intro_narrator1": "Marcos Kaffeeladen wächst. Täglich gehen Dutzende Zahlungen auf seinem Stellar-Konto ein – aber wer hat wann was bezahlt?",
    "intro_narrator2": "Seine Buchhalterin Sofia kommt mit einem Stapel unbezahlter Fragen...",
    "marco_chaos1": "Ich verstehe das nicht mehr! Jeden Tag kommen neue Zahlungen rein, aber in der Blockchain sehen die alle gleich aus.",
    "marco_chaos2": "Wie soll ich wissen, ob das von Anna, Ben oder einem Kunden ist?",
    "sofia_frustrated1": "Marco, so kann ich keine ordentliche Lohnbuchhaltung machen. Jede Mitarbeiterzahlung sieht auf der Blockchain identisch aus!",
    "sofia_frustrated2": "Ich brauche eine zuverlässige Möglichkeit, jede Zahlung eindeutig zuzuordnen – ohne jedes Mal nachzufragen.",
    "lumio_fix": "Ich weiß genau, wie wir das lösen. Habt ihr schon von Muxed Accounts gehört?",
    "explain_label": "Konzept",
    "explain_title": "Muxed Accounts erklärt",
    "explain_desc": "Ein Muxed Account ist kein separates Wallet – es ist dieselbe Stellar-Adresse, aber mit einer virtuellen ID versehen.",
    "explain_base_label": "Marcos Basis-Adresse (G…)",
    "explain_muxed_label": "Virtuelle M-Adressen",
    "explain_anna": "Barista",
    "explain_ben": "Röster",
    "explain_clara": "Buchhaltung",
    "explain_flow_desc": "Alle Zahlungen landen auf derselben G-Adresse – die eingebettete ID verrät, wer was bekommen hat.",
    "explain_memo_vs_title": "Muxed Account vs. Memo",
    "explain_memo_desc": "Freies Textfeld, nicht standardisiert. Kann vergessen oder falsch eingegeben werden.",
    "explain_muxed_desc": "Strukturierte numerische ID direkt in der Adresse. Zuverlässig für automatisierte Buchhaltung.",
    "explain_cta": "Verstanden! Zum Anwendungsfall →",
    "payroll_label": "Anwendungsfall",
    "payroll_title": "Lohnbuchhaltung mit Muxed Accounts",
    "payroll_step1": "Das Unternehmen hat EIN Stellar-Konto – günstiger und einfacher zu verwalten.",
    "payroll_step2": "Jeder Mitarbeiter bekommt eine eindeutige Muxed-ID vom Unternehmen zugewiesen.",
    "payroll_step3": "Jeden Monat sendet die Lohnsoftware das Gehalt an die jeweilige M-Adresse.",
    "payroll_step4": "Sofias Buchhaltungssoftware liest die Muxed-ID aus und bucht automatisch dem richtigen Mitarbeiter zu.",
    "payroll_step5": "Keine manuelle Abstimmung, kein Raten, keine Fehler.",
    "payroll_note": "Der Mitarbeiter muss nichts über Muxed Accounts wissen – das Unternehmen verwaltet das intern.",
    "payroll_cta": "Klasse! Mehr Beispiele →",
    "usecases_label": "Praxis",
    "usecases_title": "Weitere Anwendungsfälle",
    "exchange_title": "Krypto-Börsen",
    "exchange_text": "Eine Börse nutzt eine einzige Stellar-Adresse für alle Kunden. Jeder Kunde bekommt eine Muxed-ID als Einzahlungsadresse – kein Memo nötig, keine verlorenen Einzahlungen.",
    "shop_title": "Online-Shops",
    "shop_text": "Jede Bestellung bekommt eine eindeutige Muxed-ID. Die Zahlung wird automatisch der richtigen Bestellung zugeordnet – ohne manuelle Nachbearbeitung.",
    "usecases_cta": "Gut! Jetzt bin ich dran →",
    "decision_question": "Wie soll Marco seine Lohnbuchhaltung organisieren?",
    "decision_a1": "Für jeden Mitarbeiter ein separates Stellar-Konto erstellen",
    "decision_a2": "Memo-Feld mit Mitarbeiternamen verwenden",
    "decision_a3": "Muxed Accounts mit eindeutiger ID pro Mitarbeiter",
    "wrong_a1_title": "Nicht ideal",
    "wrong_a1_text": "Separate Konten bedeuten mehr Gebühren, mehr Secret Keys zu verwalten und ein höheres Sicherheitsrisiko. Das skaliert nicht gut für ein wachsendes Unternehmen.",
    "wrong_a1_hint2": "Tipp: Weniger Konten = weniger Komplexität. Gibt es eine Lösung die mit einer einzigen Adresse auskommt?",
    "wrong_a2_title": "Nicht zuverlässig genug",
    "wrong_a2_text": "Memos sind nicht standardisiert und können vergessen oder falsch eingegeben werden. Für automatisierte Buchhaltung braucht man eine strukturierte, zuverlässige Methode.",
    "wrong_a2_hint2": "Tipp: Welche Methode kodiert die ID direkt in die Adresse – ohne extra Textfeld?",
    "correct_sofia": "Endlich! Genau das habe ich gebraucht. Mit Muxed Accounts kann ich die Lohnbuchhaltung vollständig automatisieren!",
    "retry_btn": "Nochmal versuchen",
    "action_label": "Muxed Payment senden",
    "action_desc": "Sende 1 XLM an eine Muxed-Adresse (M-Adresse) – Basis-Adresse + ID 42.",
    "action_maddress_label": "Ziel-M-Adresse",
    "action_success": "Auf der Blockchain sieht das wie eine normale Zahlung aus – aber die ID 42 ist eingebettet!",
    "action_error": "Kein Keypair vorhanden – bitte zuerst ein Testnet-Konto erstellen.",
    "lumio_after_action": "Siehst du? Die Transaktion auf dem Testnet sieht aus wie eine normale XLM-Zahlung – aber die Muxed-ID ist in der Adresse kodiert. Sofias Software würde das automatisch auslesen.",
    "quiz_wrong": "Falsch",
    "quiz_retry": "Nochmal versuchen",
    "quiz_correct_cta": "Weiter",
    "quiz1_q": "Was ist ein Muxed Account auf Stellar?",
    "quiz1_a1": "Ein separates Wallet mit eigenem Guthaben",
    "quiz1_a1_hint": "Nein – ein Muxed Account ist kein eigenständiges Wallet.",
    "quiz1_a2": "Eine virtuelle Sub-Adresse mit numerischer ID, gebunden an eine Basis-G-Adresse",
    "quiz1_a2_hint": "Genau! Die M-Adresse zeigt auf dasselbe Konto – nur mit einer zusätzlichen ID zur Unterscheidung.",
    "quiz1_a3": "Ein spezieller Token-Account für Unternehmen",
    "quiz1_a3_hint": "Nein – Muxed Accounts funktionieren mit XLM und allen Tokens.",
    "quiz1_explanation": "Ein Muxed Account ist keine eigene Wallet – er teilt das Guthaben, die Trustlines und die Signer mit dem Basis-G-Account. Die M-Adresse enthält nur eine zusätzliche numerische ID.",
    "quiz1_hint2": "Tipp: Denke an eine Bankkontonummer mit eingebetteter Referenznummer – ein Konto, viele IDs.",
    "quiz2_q": "Warum sind Muxed Accounts besser als Memos für die Lohnbuchhaltung?",
    "quiz2_a1": "Muxed Accounts sind günstiger als Memos",
    "quiz2_a1_hint": "Nein – die Transaktionsgebühren sind gleich.",
    "quiz2_a2": "Memos sind verboten für Unternehmenszahlungen",
    "quiz2_a2_hint": "Nein – Memos sind erlaubt, aber nicht ideal für Automatisierung.",
    "quiz2_a3": "Muxed-IDs sind strukturiert und zuverlässig; Memos können fehlen oder falsch sein",
    "quiz2_a3_hint": "Genau! Die ID ist direkt in der Adresse kodiert – sie kann nicht vergessen oder falsch eingegeben werden.",
    "quiz2_explanation": "Memos sind freie Textfelder und nicht standardisiert. Sie können vergessen, falsch eingegeben oder absichtlich weggelassen werden. Muxed-IDs sind Teil der Adresse selbst – strukturiert und maschinell zuverlässig lesbar.",
    "quiz2_hint2": "Tipp: Was passiert wenn ein Mitarbeiter beim Überweisen das Memo-Feld einfach leer lässt?",
    "quiz3_q": "Muss ein Mitarbeiter ein eigenes Stellar-Wallet haben, um eine Muxed-Zahlung zu empfangen?",
    "quiz3_a1": "Nein – der Mitarbeiter hat ein eigenes Wallet, die Muxed-ID verwaltet das Unternehmen intern",
    "quiz3_a1_hint": "Richtig! Die Muxed-ID ist ein internes Buchhaltungsmerkmal – der Mitarbeiter empfängt auf seiner eigenen normalen Adresse.",
    "quiz3_a2": "Ja – jeder Mitarbeiter braucht eine M-Adresse als eigenes Wallet",
    "quiz3_a2_hint": "Nein – M-Adressen sind keine eigenständigen Wallets.",
    "quiz3_a3": "Nein – Mitarbeiter brauchen gar kein Stellar-Konto",
    "quiz3_a3_hint": "Nicht ganz – Mitarbeiter können eigene Stellar-Konten haben; die Muxed-ID ist nur für die Buchhaltungsseite relevant.",
    "quiz3_explanation": "Muxed-IDs sind ein internes Organisationswerkzeug des Unternehmens. Der Mitarbeiter hat sein eigenes Stellar-Konto. Die M-Adresse hilft Sofias Software die eingehenden Zahlungen intern zuzuordnen.",
    "quiz3_hint2": "Tipp: Muxed Accounts sind aus Sicht des Unternehmens gedacht – nicht aus Sicht des Empfängers.",
    "learning1": "Ein Muxed Account ist eine virtuelle Sub-Adresse (M-Adresse) auf einer Stellar-Basis-Adresse",
    "learning2": "Muxed Accounts vereinfachen Lohnbuchhaltung: eine Adresse, viele IDs – vollständig automatisierbar",
    "learning3": "Krypto-Börsen und Online-Shops nutzen Muxed Accounts für eindeutige Kundenzuordnung",
    "learning4": "Memos können vergessen werden – Muxed-IDs sind in der Adresse kodiert und zuverlässig"
  },
  "chapter7": {
    "title": "Der Tresor",
    "section_intro": "Szene 1 – Das Problem der Kontrolle",
    "section_explain": "Was ist Multisignature?",
    "section_family": "Beispiel: Familien-Sparkasse",
    "section_decision1": "Entscheidungsszene 1",
    "section_company": "Beispiel: Firmen-Tresor",
    "section_decision2": "Entscheidungsszene 2",
    "section_usecases": "Wann braucht man Multisig?",
    "section_quiz": "Mini-Quiz",
    "section_cert": "Fortgeschrittenen-Zertifikat",
    "intro_narrator1": "Marco hat jetzt eine Geschäftspartnerin: Rosa. Gemeinsam führen sie ein wachsendes Unternehmen. Aber es gibt ein Problem...",
    "intro_narrator2": "Wenn nur eine Person das Firmen-Wallet kontrolliert, kann etwas schiefgehen – durch Vertrauensverlust oder verlorene Keys.",
    "marco_problem1": "Rosa, ich mache mir Sorgen. Was passiert mit unserem Geld, wenn ich meinen Secret Key verliere?",
    "marco_problem2": "Oder was wenn du mir nie wirklich vertrauen kannst, weil ich alleine alles kontrolliere?",
    "rosa_concern": "Genau das beschäftigt mich auch, Marco. Wir brauchen eine Lösung, bei der wir beide sicher sind.",
    "lumio_solution": "Ich weiß genau was ihr braucht – einen Tresor, den ihr nur gemeinsam öffnen könnt. Das nennt sich Multisignature!",
    "explain_label": "Grundlagen",
    "explain_title": "Was ist Multisignature?",
    "explain_desc": "Normalerweise kontrolliert ein einziger Schlüssel ein Wallet. Mit Multisig legst du fest, wie viele von wie vielen möglichen Unterzeichnern eine Transaktion genehmigen müssen.",
    "explain_1of1_label": "Normal: 1-von-1",
    "explain_1of1_desc": "Ein Schlüssel kontrolliert alles. Wer diesen Schlüssel hat, hat vollen Zugriff – kein Schutz vor Missbrauch oder Verlust.",
    "explain_multisig_label": "Multisig: N-von-M",
    "explain_multisig_desc": "Mehrere Unterzeichner, definierter Threshold. Erst wenn genug Signaturen vorhanden sind, wird die Transaktion ausgeführt.",
    "explain_threshold_label": "Was ist ein Threshold?",
    "explain_threshold_desc": "Der Threshold ist die Mindestzahl an Signaturen, die nötig sind um eine Transaktion zu autorisieren. Bei 2-von-3 müssen beliebige 2 der 3 Unterzeichner unterschreiben.",
    "explain_vault_desc": "Stell dir einen Tresor mit mehreren Schlössern vor – alle benötigten Schlüssel müssen gleichzeitig gedreht werden.",
    "explain_cta": "Zeig mir ein Beispiel →",
    "family_label": "Beispiel 1",
    "family_title": "Familien-Sparkasse (2-von-2)",
    "family_desc": "Elena und David richten ein gemeinsames Spar-Wallet ein. Beide müssen jede Transaktion unterschreiben – maximale Sicherheit, null Impulskäufe.",
    "family_scenario_title": "Szenario",
    "family_scenario_text": "David möchte eine neue Kaffeemaschine kaufen. Er sendet eine Transaktionsanfrage – Elena muss ebenfalls unterschreiben, bevor das Geld abgebucht wird. Beide haben gleiche Kontrolle.",
    "family_risk": "Risiko: Wenn ein Elternteil den Secret Key verliert, ist das Wallet dauerhaft gesperrt. 2-von-2 bedeutet null Fehlertoleranz – beide Signaturen werden immer benötigt.",
    "family_cta": "Weiter zum Firmen-Beispiel →",
    "d1_question": "Elena hat ihren Secret Key verloren. David hat seinen noch. Was passiert mit dem 2-von-2 Wallet?",
    "d1_a1": "David kann alleine auf die Gelder zugreifen, da er seinen Key noch hat",
    "d1_a2": "Sie können das Wallet mit ihrer E-Mail-Adresse zurücksetzen",
    "d1_a3": "Das Wallet ist dauerhaft unzugänglich – beide Signaturen werden immer benötigt",
    "d1_wrong_a1_title": "Falsch – 2-von-2 kennt keine Ausnahmen",
    "d1_wrong_a1_text": "Bei einem 2-von-2 Multisig-Wallet werden IMMER beide Signaturen benötigt. Auch wenn David seinen Key hat – ohne Elenas Key ist keine Transaktion möglich. Das ist die Stärke und gleichzeitig das Risiko.",
    "d1_wrong_a1_hint2": "Tipp: 2-von-2 bedeutet, dass der Threshold immer 2 ist – keine Ausnahmen, keine Umgehung.",
    "d1_wrong_a2_title": "Falsch – Blockchain kennt kein Passwort-Reset",
    "d1_wrong_a2_text": "Die Blockchain kennt keine E-Mail-Wiederherstellung, keinen Support und kein Passwort-Reset. Der Schlüssel IST der Zugang – ohne ihn gibt es keine Möglichkeit, auf das Wallet zuzugreifen.",
    "d1_wrong_a2_hint2": "Tipp: Auf der Blockchain gibt es keine zentrale Stelle, die Keys zurücksetzen könnte – das ist gewollt, aber birgt Verantwortung.",
    "d1_correct_lumio": "Genau! Das ist das fundamentale Risiko von 2-von-2: Wenn ein Key verloren geht, sind die Gelder für immer unerreichbar. Deshalb ist die sichere Aufbewahrung so wichtig.",
    "company_label": "Beispiel 2",
    "company_title": "Firmen-Tresor (2-von-3)",
    "company_desc": "Marco, Rosa und Anwalt Dr. Weber sind drei Unterzeichner. Beliebige zwei müssen unterschreiben – Sicherheit mit Fehlertoleranz.",
    "company_scenario_title": "Szenario",
    "company_scenario_text": "Marco möchte einen Lieferanten bezahlen → Rosa co-signiert → fertig. Dr. Weber ist nicht nötig. Falls Marco im Urlaub ist, können Rosa und Dr. Weber gemeinsam handeln. Das Unternehmen bleibt handlungsfähig.",
    "company_risk": "2-von-3 balanciert Sicherheit mit Fehlertoleranz: Selbst wenn ein Unterzeichner seinen Key verliert, können die anderen zwei noch handeln. Erst wenn zwei Keys verloren gehen, wird der Threshold unerreichbar.",
    "company_cta": "Jetzt wählen →",
    "d2_question": "Marco, Rosa und Dr. Weber betreiben ein Unternehmen mit 3 Partnern. Welches Multisig-Setup ist richtig: Mehrheit nötig, funktioniert auch wenn ein Partner nicht erreichbar ist?",
    "d2_a1": "1-von-3 – jeder einzelne Partner kann alleine Transaktionen ausführen",
    "d2_a2": "3-von-3 – alle drei Partner müssen immer unterschreiben",
    "d2_a3": "2-von-3 – beliebige zwei der drei Partner müssen unterschreiben",
    "d2_wrong_a1_title": "Falsch – 1-von-3 bietet keinen Schutz",
    "d2_wrong_a1_text": "1-von-3 bedeutet, dass jeder einzelne Unterzeichner alleine alle Gelder bewegen könnte. Das bietet keinen Schutz vor Betrug, Diebstahl oder einem kompromittierten Schlüssel – gefährlicher als ein normales Single-Key Wallet.",
    "d2_wrong_a1_hint2": "Tipp: Für Firmenkassen muss der Threshold hoch genug sein, dass keine einzelne Person alleine handeln kann.",
    "d2_wrong_a2_title": "Falsch – 3-von-3 ist zu unflexibel",
    "d2_wrong_a2_text": "3-von-3 klingt sicher, aber wenn ein Partner krank ist, reist oder seinen Key verliert, ist das gesamte Unternehmen blockiert. Für Organisationen braucht man Fehlertoleranz.",
    "d2_wrong_a2_hint2": "Tipp: Die Lösung ist ein Threshold der Mehrheit erfordert, aber trotzdem funktioniert wenn jemand nicht erreichbar ist.",
    "d2_correct_lumio": "Perfekt! 2-von-3 ist das häufigste Setup für kleine Organisationen – aus gutem Grund: Mehrheit nötig, aber fehlertolerant.",
    "usecases_label": "Anwendungsfälle",
    "usecases_title": "Wann braucht man Multisig?",
    "usecase1_title": "Firmen-Wallets",
    "usecase1_text": "Mehrere Partner oder Geschäftsführer – keine einzelne Person kann alleine Gelder bewegen.",
    "usecase2_title": "Familien-Sparguthaben",
    "usecase2_text": "Beide Partner müssen zustimmen – schützt vor Impulskäufen und gibt gleiche Kontrolle.",
    "usecase3_title": "DAOs & Gemeinschaftskassen",
    "usecase3_text": "Dezentrale Organisationen verwalten gemeinsame Mittel ohne zentralen Treuhänder.",
    "usecase4_title": "Hochsicherheits-Privatwallet",
    "usecase4_text": "Du hältst 2 Keys auf separaten Geräten, ein Vertrauenspartner hält 1 als Backup – 2-von-3.",
    "usecase5_title": "Treuhand-Arrangements",
    "usecase5_text": "Gelder werden erst freigegeben wenn beide Parteien unterschreiben – kein Betrug möglich.",
    "usecases_cta": "Weiter zum Quiz →",
    "quiz_wrong": "Nicht ganz richtig",
    "quiz_retry": "Nochmal versuchen",
    "quiz_correct_cta": "Weiter",
    "retry_btn": "Nochmal versuchen",
    "quiz1_q": "Was bedeutet '2-von-3 Multisig'?",
    "quiz1_a1": "Genau 2 von 3 möglichen Unterzeichnern müssen immer unterschreiben, sonst passiert gar nichts",
    "quiz1_a2": "Beliebige 2 der 3 Unterzeichner müssen eine Transaktion unterschreiben damit sie ausgeführt wird",
    "quiz1_a3": "Zwei Transaktionen müssen innerhalb von 3 Minuten bestätigt werden",
    "quiz1_a1_hint": "Fast! Beliebige 2 von 3 können unterschreiben – nicht immer dieselben zwei.",
    "quiz1_a2_hint": "Genau! Beliebige 2 der 3 Unterzeichner reichen – das gibt Flexibilität und Sicherheit.",
    "quiz1_a3_hint": "Das stimmt nicht – Multisig hat nichts mit Zeitlimits zu tun.",
    "quiz1_explanation": "Bei 2-von-3 Multisig kann jede Kombination von 2 der 3 Unterzeichner die Transaktion genehmigen. Es müssen nicht immer dieselben zwei sein – das ist der Unterschied zu 'festen' Unterschriften.",
    "quiz1_hint2": "Denk an den Firmen-Tresor: Marco+Rosa, Rosa+Weber oder Marco+Weber – alle drei Kombinationen funktionieren.",
    "quiz2_q": "Marco, Rosa und Dr. Weber haben ein 2-von-3 Wallet. Rosa verliert ihren Key. Können sie noch auf die Gelder zugreifen?",
    "quiz2_a1": "Nein – da ein Unterzeichner seinen Key verloren hat, ist das Wallet gesperrt",
    "quiz2_a2": "Ja – Marco und Dr. Weber erreichen zusammen den Threshold von 2",
    "quiz2_a3": "Nein – alle drei Unterzeichner werden immer benötigt",
    "quiz2_a1_hint": "Der Threshold ist 2, nicht 3 – Marco und Weber können noch handeln.",
    "quiz2_a2_hint": "Richtig! Das ist genau die Stärke von 2-von-3: Fehlertoleranz bei einem verlorenen Key.",
    "quiz2_a3_hint": "Bei 2-von-3 werden nur 2 Signaturen benötigt, nicht alle 3.",
    "quiz2_explanation": "Bei 2-von-3 reichen beliebige 2 Signaturen. Wenn Rosa ihren Key verliert, können Marco und Dr. Weber zusammen noch alle Transaktionen ausführen. Das ist der Unterschied zu 2-von-2.",
    "quiz2_hint2": "Merkhilfe: 2-von-3 = eine verlorene Signatur = noch handlungsfähig. 2-von-2 = eine verlorene Signatur = dauerhaft gesperrt.",
    "quiz3_q": "Elena und David haben ein 2-von-2 Wallet. Elena verliert ihren Key. Was passiert?",
    "quiz3_a1": "Das Wallet ist dauerhaft gesperrt – beide Signaturen werden immer benötigt",
    "quiz3_a2": "David kann alleine auf die Gelder zugreifen, da er seinen Key noch hat",
    "quiz3_a3": "Sie können sich an Stellar wenden um den Key wiederherzustellen",
    "quiz3_a1_hint": "Richtig! 2-von-2 hat null Fehlertoleranz – beide Keys werden immer benötigt.",
    "quiz3_a2_hint": "Bei 2-von-2 reicht ein einzelner Key nicht aus – der Threshold bleibt immer 2.",
    "quiz3_a3_hint": "Stellar ist dezentral – es gibt keine zentrale Stelle die Keys zurücksetzen kann.",
    "quiz3_explanation": "Bei 2-von-2 werden immer beide Signaturen benötigt. Wenn ein Key verloren geht, gibt es keine Möglichkeit die Transaktion auszuführen – das Wallet ist dauerhaft gesperrt. Deshalb ist die sichere Key-Aufbewahrung so kritisch.",
    "quiz3_hint2": "Merkhilfe: 2-von-2 = maximale Sicherheit, null Fehlertoleranz. Jeder Key muss sicher aufbewahrt werden – an mehreren physischen Orten.",
    "quiz4_q": "Warum ist 1-von-3 Multisig für eine Firmenkasse riskant?",
    "quiz4_a1": "Weil das Setup zu kompliziert ist und die Mitarbeiter verwirrt",
    "quiz4_a2": "Weil Stellar nur 2-von-3 oder höhere Thresholds unterstützt",
    "quiz4_a3": "Weil jeder einzelne Unterzeichner alleine alle Gelder bewegen kann – kein Schutz vor Betrug",
    "quiz4_a1_hint": "Das ist nicht der Grund – der Threshold macht das Setup riskant.",
    "quiz4_a2_hint": "Stellar unterstützt flexible Thresholds – das ist nicht das Problem.",
    "quiz4_a3_hint": "Genau! 1-von-3 bedeutet keine echte Mehrheitskontrolle – jeder kann alleine handeln.",
    "quiz4_explanation": "Bei 1-von-3 kann jeder der drei Unterzeichner alleine sämtliche Gelder bewegen. Das ist schlimmer als ein normales Single-Key Wallet, weil drei verschiedene Personen ein potentielles Angriffsziel sind.",
    "quiz4_hint2": "Denk an eine Firmenkasse: Du willst nicht, dass ein einziger Mitarbeiter alleine Überweisungen auslösen kann.",
    "cert_title": "Fortgeschrittenen-Zertifikat",
    "cert_tagline": "Du bist jetzt ein Stellar-Profi!",
    "cert_public_key_label": "Öffentlicher Schlüssel",
    "cert_date_label": "Abschlussdatum",
    "cert_chapters_label": "Abgeschlossene Kapitel",
    "cert_xp_label": "XP gesamt",
    "cert_badge1": "Basis-Zertifikat",
    "cert_badge2": "Fortgeschrittenen-Zertifikat",
    "cert_print_btn": "Zertifikat speichern",
    "cert_home_btn": "Zur Startseite",
    "learning1": "Multisignature erfordert mehrere Signaturen um eine Transaktion auszuführen",
    "learning2": "2-von-3 bietet Fehlertoleranz: ein verlorener Key sperrt das Wallet nicht",
    "learning3": "Multisig eignet sich für Firmen, Familien, DAOs und Hochsicherheits-Wallets",
    "learning4": "2-von-2 hat null Fehlertoleranz – wenn ein Key verloren geht, sind die Gelder für immer unerreichbar"
  }
}
