{
  "title": "Crear cuenta + multifirma",
  "menu": "Crear cuenta + Multisig",
  "menuHint": "Crea una nueva cuenta y opcionalmente configura multisig.",
  "hint": "Crea una nueva cuenta, actívala y, opcionalmente, configura la firma múltiple.",
  "generateKeys": "Generar clave",
  "enableMultisig": "Habilitar multisig",
  "signersTitle": "Firmante",
  "signersInfo": "Agrega firmantes adicionales y establece umbrales apropiados.",
  "signersCount": "Número de firmantes",
  "bestPractices": {
    "title": "Mejores prácticas",
    "text": "Mantén las claves secretas seguras y no las distribuyas innecesariamente."
  },
  "instructions": {
    "public": "Comparte esta clave pública con otros para pagos.",
    "secret": "Mantén esta clave secreta segura; nunca la compartas."
  },
  "generateFirst": "Por favor, genera primero un par de claves.",
  "confirmLowBalance": "El saldo inicial de {bal} XLM está por debajo de la reserva recomendada de {req} XLM (Firmantes: {count}). ¿Desea continuar?",
  "activated": "La cuenta ha sido activada. Hash: {hash}",
  "activatedTestnet": "La cuenta fue activada en la testnet a través de Friendbot.",
  "alreadyActive": "La cuenta ya está activada.",
  "createdNoSigners": "Cuenta creada, multisig no configurado.",
  "createdAndConfigured": "Cuenta creada y multisig configurado. Hash: {hash}",
  "info": {
    "more": "Más información.",
    "keysOnPage": {
      "title": "Clave en esta página",
      "text": "⚠️ IMPORTANTE: ¡Este sitio web NUNCA almacena tu clave secreta!\n\nLa clave secreta que se muestra aquí existe solo en tu navegador. Una vez que recargues o abandones la página, se perderá irremediablemente.\n\nCopia o anota la clave secreta inmediatamente después de generarla antes de cerrar la página.\n\nVerificación: Puedes utilizar las herramientas de desarrollo del navegador (F12 → Red) para verificar que no se transmite ninguna clave secreta externamente. Solo se envían transacciones firmadas, nunca tu clave secreta."
    },
    "title": "Información importante",
    "secureKeys": {
      "title": "Clave secreta segura",
      "text": "The public key can be safely shared – it is like an account number.\n\nThe secret key grants access to your account. Treat it like a password:\n• NEVER store it in cloud services, emails, or insecure notes\n• Write it down on paper or use a hardware wallet\n• Create multiple backups and store them in secure, separate locations\n• If the secret key is lost, access to the account is permanently lost"
    },
    "multisigSection": {
      "title": "Multisig (Mehrfachsignatur)",
      "text": "Con multisig, puedes definir múltiples firmantes para tu cuenta. Las transacciones requieren firmas de múltiples claves (multisig).\n\nVentajas:\n• Seguridad mejorada (security)\n• Cuentas compartidas (shared accounts)\n• Recuperación de emergencia (emergency recovery)\n\nPRECAUCIÓN: ¡Prueba multisig primero en la red de prueba antes de implementarlo en la red principal! Una configuración incorrecta puede resultar en la pérdida de acceso a la cuenta."
    },
    "diagram": {
      "title": "Vencimiento de la firma"
    }
  },
  "activateHint": "La activación es necesaria para que la cuenta exista. En la Testnet, a través de Friendbot; en la Mainnet, a través de \"Crear Cuenta\" desde una billetera existente.",
  "activateNow": "Activa la cuenta inmediatamente",
  "activateOnly": "Solo activa",
  "balanceWarning": "Es probable que el saldo inicial sea demasiado bajo para agregar los {{count}} firmantes adicionales (reserva mínima: {{req}} XLM)",
  "createButton": "Crear / Configurar Multifirma",
  "mainnetActivateNote": "Nota: Se requieren reservas adicionales para Multisig. 1 XLM a menudo no es suficiente.",
  "reserve": {
    "base": "Reserva base por entrada: {{val}} XLM",
    "recommended": "Saldo inicial recomendado: {{val}} XLM (inkl. Puffer)",
    "required": "Reserva mínima requerida (neu): {{val}} XLM"
  },
  "signersCountHint": "Establece el número mínimo de firmas a continuación en \"Firmas requeridas\" (niedrig/mittel/hoch).",
  "signersCountLimit": "Nota: Red de Límites (Stellar): máx. 20 signatarios adicionales.",
  "startingBalance": "Saldo inicial (XLM)",
  "keyWarning": {
    "title": "⚠️ ¡Asegura la clave ahora!",
    "text1": "Has generado un nuevo par de claves.",
    "text2": "Asegura AMBAS llaves INMEDIATAMENTE antes de proceder:",
    "list1": "Clave pública: La dirección de tu cuenta, se puede compartir.",
    "list2": "Llave secreta (Geheimschlüssel): Tu contraseña – ¡NUNCA la compartas ni la guardes en línea!",
    "list3": "Si se pierde la clave secreta, el acceso se pierde irrevocablemente.",
    "confirm": "He asegurado ambas llaves."
  },
  "muxedId": "Muxed-ID",
  "muxedInfo": "Con el Muxed-ID, se crea una M-Adresse (M...). Apunta a la misma cuenta que la dirección regular (G...).",
  "muxedIdInvalid": "El Muxed-ID debe ser un número entero entre 0 y 18,446,744,073,709,551,615.",
  "muxedAddress": "Dirección multiplexada",
  "muxedActivationInfo": "Las direcciones mezcladas son direcciones alias. No necesitan ser activadas por separado."
}