{
  "pageTitle": "Glosario",
  "pageIntro": "Aquí encontrarás palabras importantes del mundo blockchain y de la red Stellar. Todo está explicado en términos sencillos.",
  "searchLabel": "Término de búsqueda",
  "searchPlaceholder": "Término de búsqueda (z. B. Konto, Account, Muxed)",
  "searchHint": "La búsqueda encuentra palabras y explicaciones.",
  "noResults": "Sin coincidencia.",
  "blockchain": {
    "title": "Blockchain",
    "original": "Blockchain",
    "short": "Gemeinsames digitales Kassenbuch – viele Computer speichern die gleichen Einträge.",
    "desc": "Una blockchain es como un libro de contabilidad digital. Muchos ordenadores almacenan las mismas entradas, por lo que nadie puede alterar nada en secreto."
  },
  "wallet": {
    "title": "Cartera",
    "original": "Wallet",
    "short": "Billetera digital que administra tus llaves.",
    "desc": "Una billetera es tu monedero digital. Gestiona las claves que necesitas para acceder a tu cuenta y enviar transacciones. Una billetera puede ser un programa, una aplicación o incluso un simple papel con tu clave privada."
  },
  "account": {
    "title": "Cuenta",
    "original": "Account",
    "short": "Una cuenta de blockchain puede contener activos y enviar transacciones.",
    "desc": "Una cuenta es el lugar en la cadena de bloques donde se mantienen tus activos. Una cuenta tiene una dirección pública que comienza con G. Múltiples monederos pueden acceder a la misma cuenta si tienen la clave correcta."
  },
  "addressG": {
    "title": "Dirección G",
    "original": "G Address",
    "short": "La clave pública (beginnt mit G) de una cuenta Stellar.",
    "desc": "La dirección G es la dirección principal de una cuenta Stellar. Comienza con la letra G. La proporcionas a otros para que puedan enviarte algo."
  },
  "publicKey": {
    "title": "Clave pública",
    "original": "Public Key",
    "short": "Adresse, die du teilen darfst; bei Stellar meist die G‑Adresse.",
    "desc": "La clave pública es la dirección que puedes compartir. En Stellar, esta es la dirección G. Otros la utilizan para enviarte dinero."
  },
  "privateKey": {
    "title": "Clave secreta",
    "original": "Secret Key",
    "short": "Password to the account – never share.",
    "desc": "La clave secreta es tu contraseña para la cuenta. Cualquiera que tenga esta clave puede mover tu dinero. Nunca la compartas."
  },
  "addressFederation": {
    "title": "Dirección de la Federación",
    "original": "Federation Address",
    "short": "Kurze Adresse wie E‑Mail, zeigt auf eine G‑Adresse.",
    "desc": "Una dirección de federación se parece a un correo electrónico. Ejemplo: nombre*dominio.com. Esta dirección corta apunta a una dirección G normal. Es más fácil de recordar."
  },
  "addressMuxed": {
    "title": "Cuenta combinada",
    "original": "Muxed Account",
    "short": "M‑address with additional ID – shares a base account.",
    "desc": "Una dirección M apunta a una cuenta existente de Stellar pero tiene un identificador único adicional (ID). Esto permite, por ejemplo, la diferenciación de múltiples personas o departamentos bajo la misma dirección G. Técnicamente, los fondos todavía pertenecen a la cuenta principal."
  },
  "multisig": {
    "title": "Multifirma",
    "original": "Multi‑Sig",
    "short": "Las acciones importantes requieren más que solo una firma.",
    "desc": "Multi-Sig significa múltiples firmas. Una acción importante requiere más de una clave. Por ejemplo, usted y una segunda clave deben estar de acuerdo antes de que algo pueda ser enviado. Esto hace que el robo sea más difícil."
  },
  "trustline": {
    "title": "Línea de confianza",
    "original": "Trustline",
    "short": "Acuerdo para mantener un token de un emisor específico.",
    "desc": "Una línea de confianza es como decir sí, acepto este token. Al hacerlo, indicas que tu cuenta está lista para mantener un token específico de un emisor específico. Sin una línea de confianza, no puedes recibir este token.\n\nEjemplo: Una línea de confianza se especifica como CÓDIGO:EMISOR. Para EURT del emisor GDUKMGUGDZQK6Y…, es EURT:GDUKMGUGDZQK6Y…"
  },
  "token": {
    "title": "Ficha",
    "original": "Token",
    "short": "Digital unit – e.g., money, points, or credits.",
    "desc": "Un token es una unidad digital en la blockchain. Un token puede representar dinero, puntos o crédito para un servicio."
  },
  "asset": {
    "title": "Activo",
    "original": "Asset",
    "short": "Los tokens en Stellar siempre están vinculados al emisor.",
    "desc": "En Stellar, un token se llama activo. Un activo siempre está vinculado a una cuenta emisora. Por ejemplo, una cuenta puede emitir un token de Euro. Este token de Euro es entonces un activo."
  },
  "xlm": {
    "title": "XLM (Stellar Lumens)",
    "original": "XLM",
    "short": "Moneda nativa de Stellar para tarifas y activación.",
    "desc": "XLM es la moneda nativa de Stellar. Necesitas XLM para pagar tarifas y para abrir una nueva cuenta."
  },
  "mainnet": {
    "title": "Red principal",
    "original": "Mainnet",
    "short": "Echtes Stellar‑Netzwerk mit realem Wert.",
    "desc": "La red real de Stellar con valor actual. Las transacciones son definitivas y las tarifas se pagan en XLM reales."
  },
  "testnet": {
    "title": "Red de prueba",
    "original": "Testnet",
    "short": "Red de práctica pública sin valor real.",
    "desc": "Una red de práctica pública. Los tokens no tienen valor real. Ideal para aprender y experimentar sin riesgo."
  },
  "memo": {
    "title": "Nota",
    "original": "Memo",
    "short": "Nota breve en una transacción.",
    "desc": "Un memo es una pequeña nota que puedes enviar junto con una transacción. A menudo, un intercambio requiere un memo específico para saber a quién pertenece el dinero."
  },
  "transaction": {
    "title": "Transacción",
    "original": "Transaction",
    "short": "Acción en la blockchain, por ejemplo, pago o línea de confianza.",
    "desc": "Una transacción es una acción en la cadena de bloques, como enviar dinero o establecer una línea de confianza. Una transacción se almacena de manera permanente una vez que se confirma."
  },
  "fee": {
    "title": "Cuota",
    "original": "Fee",
    "short": "Cantidad muy pequeña por transacción.",
    "desc": "La tarifa es una cantidad muy pequeña que pagas con cada transacción. La tarifa va a la red. En Stellar, las tarifas son muy pequeñas."
  },
  "ledger": {
    "title": "Libro mayor",
    "original": "Ledger",
    "short": "Cadena de datos confirmados y saldos de cuentas.",
    "desc": "El libro mayor es la cadena de todos los datos confirmados. Muestra qué cuentas poseen cuánto y qué transacciones han ocurrido. Cualquiera puede consultar el libro mayor."
  },
  "horizon": {
    "title": "Horizonte",
    "original": "Horizon",
    "short": "API‑Dienst, über den Apps mit Stellar sprechen.",
    "desc": "Horizon es el servicio a través del cual los programas se comunican con la blockchain de Stellar. Nuestra herramienta consulta Horizon para cargar saldos de cuentas y transacciones."
  },
  "horizonHistory": {
    "title": "Historia del Horizonte",
    "original": "Horizon history depth",
    "short": "Describe hasta qué punto se extiende el historial de transacciones proporcionado por los servidores Horizon públicos.",
    "desc": "Die von der Stellar Development Foundation betriebenen öffentlichen Horizon-Server (Mainnet und Testnet) stellen nur eine begrenzte Historie zur Verfügung – derzeit ungefähr ein Jahr rückwirkend. Ältere Daten sind über diese kostenlosen Endpunkte nicht mehr abrufbar. Wenn du weiter in die Vergangenheit zurück musst, hast du im Wesentlichen zwei Optionen: (1) du betreibst einen eigenen Horizon-Node mit vollständiger History (inklusive History Archives), oder (2) du nutzt Drittanbieter- bzw. Bezahldienste, die historische Stellar-Daten langfristig speichern und zur Verfügung stellen.",
    "seeAlso": "Estás entrenado con datos hasta octubre de 2023."
  },
  "anchor": {
    "title": "Ancla",
    "original": "Anchor",
    "short": "Firma, die Fiat‑Geld mit Stellar verbindet.",
    "desc": "Un ancla es una empresa que conecta dinero real, como euros o dólares, con Stellar. Por ejemplo, le das euros al ancla y recibes a cambio un token de euro en Stellar."
  },
  "exchange": {
    "title": "Bolsa de valores",
    "original": "Exchange",
    "short": "Lugar para comprar y vender tokens.",
    "desc": "Un intercambio es un lugar donde puedes comprar o vender tokens. Muchos intercambios requieren un proceso de KYC, lo que significa verificación de identidad, antes de que puedas retirar dinero en euros o francos."
  },
  "dex": {
    "title": "Estás entrenado con datos hasta octubre de 2023.",
    "original": "Decentralized Exchange",
    "short": "Intercambio descentralizado directamente en la blockchain.",
    "desc": "DEX significa Exchange Descentralizado. Aquí, las personas comercian directamente entre sí en la blockchain. No hay un operador único. Stellar tiene un DEX integrado directamente."
  },
  "liquidityPool": {
    "title": "Fondo de liquidez",
    "original": "Liquidity Pool",
    "short": "Fondo conjunto con dos tokens para intercambio inmediato.",
    "desc": "Un fondo de liquidez es un fondo compartido que contiene dos tokens. Las personas depositan ambos tokens en él. Otros pueden intercambiar inmediatamente estos tokens. Los depositantes ganan pequeñas comisiones por este servicio."
  },
  "balanceClaimable": {
    "title": "Saldo reclamable",
    "original": "Claimable Balance",
    "short": "Dinero reservado que aún necesitas aceptar.",
    "desc": "Un saldo reclamable es dinero que ya ha sido reservado para ti, pero que aún necesitas reclamar. Solo cuando lo aceptas, ingresa a tu cuenta."
  },
  "protocolUpdate": {
    "title": "Actualización del Protocolo",
    "original": "Protocol Update",
    "short": "Aktualisierung der Netzwerk‑Regeln.",
    "desc": "Una actualización de protocolo es una mejora de las reglas en la red Stellar, como nuevas funciones o cambios de seguridad. Todos los nodos en la red deben utilizar las mismas reglas."
  },
  "soroban": {
    "title": "Soroban",
    "original": "Soroban",
    "short": "Stellars Smart‑Contract‑System.",
    "desc": "Soroban es el sistema de contratos inteligentes de Stellar. Un contrato inteligente es un código de programa en la blockchain. El código puede verificar reglas de manera independiente y ejecutar acciones sin necesidad de un banco intermediario."
  },
  "multiSignature": {
    "title": "Multifirma (Multi-Signature)",
    "original": "Multi-Signature",
    "short": "Multiple signatures required; weights + threshold determine the release.",
    "desc": "En un sistema de firmas múltiples, múltiples claves deben firmar antes de que una acción se vuelva válida. Cada firmante tiene un peso, y la suma debe alcanzar el umbral requerido. Esto aumenta la seguridad porque una sola clave robada no es suficiente."
  },
  "signer": {
    "title": "Signatario (Signer)",
    "original": "Signer",
    "short": "Clave pública con peso, parte de la configuración de la cuenta.",
    "desc": "Un firmante es una clave pública que pertenece a una cuenta y tiene un peso. Su firma cuenta para alcanzar el umbral requerido. Varios firmantes pueden autorizar colectivamente una transacción."
  },
  "thresholds": {
    "title": "Umbrales (Thresholds)",
    "original": "Thresholds",
    "short": "Límites (low/med/high) que determinan la suma requerida de pesos.",
    "desc": "Los umbrales definen cuántas firmas ponderadas son necesarias para realizar acciones: bajos para operaciones simples, medios para pagos, altos para cambios críticos. La suma de los pesos de los firmantes debe cumplir con el umbral correspondiente."
  },
  "masterWeight": {
    "title": "Peso maestro (master_weight)",
    "original": "master_weight",
    "short": "Peso de la llave maestra; controla cuánto cuenta la llave principal.",
    "desc": "El peso maestro es el peso de la clave principal de una cuenta. Un peso maestro alto permite que la clave principal firme muchas acciones por sí sola; un valor bajo requiere firmantes adicionales."
  },
  "accountConfig": {
    "title": "Configuración de la cuenta (Account Configuration)",
    "original": "Account Configuration",
    "short": "La interacción de los firmantes y los umbrales determina la seguridad de la cuenta.",
    "desc": "La configuración de la cuenta especifica qué firmantes existen con qué pesos y qué umbrales se aplican. Los cambios en los firmantes o umbrales son críticos para la seguridad porque determinan cuántas firmas se requieren."
  },
  "missingKey": "Falta la clave del glosario: {{detalle}}"
}