{
  "pageTitle": "Glosario",
  "pageIntro": "Aquí encontrarás palabras importantes del mundo blockchain y de la red Stellar. Todo está explicado en términos sencillos.",
  "searchLabel": "Término de búsqueda",
  "searchPlaceholder": "Término de búsqueda (z. B. Konto, Account, Muxed)",
  "searchHint": "La búsqueda encuentra palabras y explicaciones.",
  "noResults": "Sin coincidencia.",
  "groups": {
    "accountsKeys": "Cuentas y claves",
    "multisigSecurity": "Multisig y seguridad de cuenta",
    "walletsCustody": "Wallets y custodia",
    "tokensAssets": "Tokens y activos",
    "transactionsFees": "Transacciones y comisiones",
    "marketsTrading": "Mercados y trading",
    "networkProtocol": "Red y protocolo",
    "smartContracts": "Contratos inteligentes",
    "blockchainBasics": "Fundamentos de blockchain",
    "security": "Seguridad y fraudes"
  },
  "blockchain": {
    "title": "Blockchain",
    "original": "Blockchain",
    "short": "Gemeinsames digitales Kassenbuch – viele Computer speichern die gleichen Einträge.",
    "desc": "Una blockchain es como un libro de contabilidad digital. Muchos ordenadores almacenan las mismas entradas, por lo que nadie puede alterar nada en secreto."
  },
  "wallet": {
    "title": "Cartera",
    "original": "Wallet",
    "short": "Billetera digital que administra tus llaves.",
    "desc": "Una billetera es tu monedero digital. Gestiona las claves que necesitas para acceder a tu cuenta y enviar transacciones. Una billetera puede ser un programa, una aplicación o incluso un simple papel con tu clave privada."
  },
  "account": {
    "title": "Cuenta",
    "original": "Account",
    "short": "Una cuenta de blockchain puede contener activos y enviar transacciones.",
    "desc": "Una cuenta es el lugar en la cadena de bloques donde se mantienen tus activos. Una cuenta tiene una dirección pública que comienza con G. Múltiples monederos pueden acceder a la misma cuenta si tienen la clave correcta."
  },
  "addressG": {
    "title": "Dirección G",
    "original": "G Address",
    "short": "La clave pública (beginnt mit G) de una cuenta Stellar.",
    "desc": "La dirección G es la dirección principal de una cuenta Stellar. Comienza con la letra G. La proporcionas a otros para que puedan enviarte algo."
  },
  "publicKey": {
    "title": "Clave pública",
    "original": "Public Key",
    "short": "Adresse, die du teilen darfst; bei Stellar meist die G‑Adresse.",
    "desc": "La clave pública es la dirección que puedes compartir. En Stellar, esta es la dirección G. Otros la utilizan para enviarte dinero."
  },
  "privateKey": {
    "title": "Clave secreta",
    "original": "Secret Key",
    "short": "Password to the account – never share.",
    "desc": "La clave secreta es tu contraseña para la cuenta. Cualquiera que tenga esta clave puede mover tu dinero. Nunca la compartas."
  },
  "addressFederation": {
    "title": "Dirección de la Federación",
    "original": "Federation Address",
    "short": "Kurze Adresse wie E‑Mail, zeigt auf eine G‑Adresse.",
    "desc": "Una dirección de federación se parece a un correo electrónico. Ejemplo: nombre*dominio.com. Esta dirección corta apunta a una dirección G normal. Es más fácil de recordar."
  },
  "addressMuxed": {
    "title": "Cuenta combinada",
    "original": "Muxed Account",
    "short": "M‑address with additional ID – shares a base account.",
    "desc": "Una dirección M apunta a una cuenta existente de Stellar pero tiene un identificador único adicional (ID). Esto permite, por ejemplo, la diferenciación de múltiples personas o departamentos bajo la misma dirección G. Técnicamente, los fondos todavía pertenecen a la cuenta principal."
  },
  "multisig": {
    "title": "Multifirma",
    "original": "Multi‑Sig",
    "short": "Las acciones importantes requieren más que solo una firma.",
    "desc": "Multi-Sig significa múltiples firmas. Una acción importante requiere más de una clave. Por ejemplo, usted y una segunda clave deben estar de acuerdo antes de que algo pueda ser enviado. Esto hace que el robo sea más difícil.",
    "help": {
      "title": "Explicación general de una cuenta corporativa de firma múltiple (Multi-Signature)",
      "intro": "Una empresa puede usar una cuenta conjunta de blockchain que involucra a varias personas autorizadas. Normalmente, participan al menos tres signatarios (Signer), como la gerencia, el oficial financiero y el oficial de cumplimiento/respaldo. El objetivo es que las personas individuales puedan ejecutar pagos de manera independiente sin que ninguna persona tenga control exclusivo o tome el control de la cuenta.",
      "problem": "Si un firmante (Signer) tiene suficiente peso para ejecutar pagos y al mismo tiempo suficiente peso para realizar cambios en la cuenta, esa persona podría eliminar a otros firmantes (Signer) o ajustar el umbral/ponderación (Thresholds) y, por lo tanto, tomar el control de la cuenta. Por el contrario, el propietario original tampoco debería poder excluir a otros firmantes (Signer) sin controles y equilibrios. Una estructura de firma múltiple asegura que las decisiones importantes siempre sean respaldadas colectivamente por varias personas.",
      "setupTitle": "Ejemplo de una estructura multi-firma segura con tres firmantes",
      "setupWeights": "En un ejemplo con tres roles equivalentes, todos reciben la misma fuerza de firma:\n- Signer (Signer) A (management): peso 2\n- Signer (Signer) B (Finanzen): peso 2\n- Signer (Signer) C (Compliance/Backup): peso 2",
      "setupThresholds": "Se establecen umbrales/pesajes apropiados:\n- Bajo (low_threshold): 1\n- Medio (med_threshold): 2 (for payments and other medium actions)\n- Alto (high_threshold): 4 (para cambios estructurales como agregar/eliminar firmantes (Signer) o cambiar el umbral/pesaje (Thresholds))\nEsta configuración permite que cada persona autorizada ejecute pagos, pero ninguna persona sola puede cambiar la estructura de la cuenta.",
      "behavior": "Con esta configuración, los pagos pueden ser realizados individualmente por cualquiera de las tres personas autorizadas, ya que el peso de cada individuo cumple con el umbral/peso medio (Threshold). Sin embargo, para cambios estructurales como eliminar un firmante (Signers), ajustar los umbrales/pesos, o fusionar o cerrar la cuenta, se requiere el umbral/peso alto (high_threshold). Este valor solo puede alcanzarse si al menos dos de los tres firmantes (Signer) firman juntos. De esta manera, la cuenta se mantiene flexible para el uso diario mientras está bien protegida contra el uso indebido.",
      "removal": "Wenn eine Person das Unternehmen verlässt oder nicht mehr vertrauenswürdig ist, können zwei der verbleibenden Unterzeichner (Signer) gemeinsam die Signaturrechte dieser Person entfernen. Kein einzelner Unterzeichner (Signer) – weder ein Mitarbeiter noch die Geschäftsführung – kann andere eigenständig aus dem Konto ausschließen. Der Entzug von Berechtigungen erfolgt also immer kontrolliert und nachvollziehbar durch mindestens zwei Verantwortliche.",
      "summary": "Este tipo de estructura de firma múltiple permite a personas individuales procesar pagos de manera eficiente, mientras se mantiene el control de la cuenta en manos de múltiples partes. Reduce el riesgo de apropiaciones de cuentas, protege contra decisiones unilaterales y es particularmente adecuado para cuentas corporativas donde tanto la seguridad como la flexibilidad operativa son importantes.",
      "closeLabel": "Cerrar",
      "linkLabel": "¿Qué significa Multi-Signature?",
      "glossaryLinkLabel": "Ver en el glosario"
    }
  },
  "multisigCorporate": {
    "title": "Multisig en empresas",
    "original": "Multi-Signature (corporate example)",
    "short": "Ejemplo de estructura multisig para cuentas empresariales con roles, pesos y umbrales."
  },
  "trustline": {
    "title": "Línea de confianza",
    "original": "Trustline",
    "short": "Acuerdo para mantener un token de un emisor específico.",
    "desc": "Una línea de confianza es como decir sí, acepto este token. Al hacerlo, indicas que tu cuenta está lista para mantener un token específico de un emisor específico. Sin una línea de confianza, no puedes recibir este token.\n\nEjemplo: Una línea de confianza se especifica como CÓDIGO:EMISOR. Para EURT del emisor GDUKMGUGDZQK6Y…, es EURT:GDUKMGUGDZQK6Y…"
  },
  "token": {
    "title": "Ficha",
    "original": "Token",
    "short": "Digital unit – e.g., money, points, or credits.",
    "desc": "Un token es una unidad digital en la blockchain. Un token puede representar dinero, puntos o crédito para un servicio."
  },
  "asset": {
    "title": "Activo",
    "original": "Asset",
    "short": "Los tokens en Stellar siempre están vinculados al emisor.",
    "desc": "En Stellar, un token se llama activo. Un activo siempre está vinculado a una cuenta emisora. Por ejemplo, una cuenta puede emitir un token de Euro. Este token de Euro es entonces un activo."
  },
  "xlm": {
    "title": "XLM",
    "original": "XLM",
    "short": "Moneda nativa de Stellar para tarifas y activación.",
    "desc": "XLM es la moneda nativa de Stellar. Necesitas XLM para pagar tarifas y para abrir una nueva cuenta."
  },
  "mainnet": {
    "title": "Red principal",
    "original": "Mainnet",
    "short": "Echtes Stellar‑Netzwerk mit realem Wert.",
    "desc": "La red real de Stellar con valor actual. Las transacciones son definitivas y las tarifas se pagan en XLM reales."
  },
  "testnet": {
    "title": "Red de prueba",
    "original": "Testnet",
    "short": "Red de práctica pública sin valor real.",
    "desc": "Una red de práctica pública. Los tokens no tienen valor real. Ideal para aprender y experimentar sin riesgo."
  },
  "memo": {
    "title": "Nota",
    "original": "Memo",
    "short": "Nota breve en una transacción.",
    "desc": "Un memo es una pequeña nota que puedes enviar junto con una transacción. A menudo, un intercambio requiere un memo específico para saber a quién pertenece el dinero."
  },
  "transaction": {
    "title": "Transacción",
    "original": "Transaction",
    "short": "Acción en la blockchain, por ejemplo, pago o línea de confianza.",
    "desc": "Una transacción es una acción en la cadena de bloques, como enviar dinero o establecer una línea de confianza. Una transacción se almacena de manera permanente una vez que se confirma."
  },
  "fee": {
    "title": "Cuota",
    "original": "Fee",
    "short": "Cantidad muy pequeña por transacción.",
    "desc": "La tarifa es una cantidad muy pequeña que pagas con cada transacción. La tarifa va a la red. En Stellar, las tarifas son muy pequeñas."
  },
  "ledger": {
    "title": "Libro mayor",
    "original": "Ledger",
    "short": "Cadena de datos confirmados y saldos de cuentas.",
    "desc": "El libro mayor es la cadena de todos los datos confirmados. Muestra qué cuentas poseen cuánto y qué transacciones han ocurrido. Cualquiera puede consultar el libro mayor."
  },
  "horizon": {
    "title": "Horizonte",
    "original": "Horizon",
    "short": "API‑Dienst, über den Apps mit Stellar sprechen.",
    "desc": "Horizon es el servicio a través del cual los programas se comunican con la blockchain de Stellar. Nuestra herramienta consulta Horizon para cargar saldos de cuentas y transacciones."
  },
  "horizonHistory": {
    "title": "Historia del Horizonte",
    "original": "Horizon history depth",
    "short": "Describe hasta qué punto se extiende el historial de transacciones proporcionado por los servidores Horizon públicos.",
    "desc": "Die von der Stellar Development Foundation betriebenen öffentlichen Horizon-Server (Mainnet und Testnet) stellen nur eine begrenzte Historie zur Verfügung – derzeit ungefähr ein Jahr rückwirkend. Ältere Daten sind über diese kostenlosen Endpunkte nicht mehr abrufbar. Wenn du weiter in die Vergangenheit zurück musst, hast du im Wesentlichen zwei Optionen: (1) du betreibst einen eigenen Horizon-Node mit vollständiger History (inklusive History Archives), oder (2) du nutzt Drittanbieter- bzw. Bezahldienste, die historische Stellar-Daten langfristig speichern und zur Verfügung stellen.",
    "seeAlso": "Estás entrenado con datos hasta octubre de 2023."
  },
  "anchor": {
    "title": "Ancla",
    "original": "Anchor",
    "short": "Firma, die Fiat‑Geld mit Stellar verbindet.",
    "desc": "Un ancla es una empresa que conecta dinero real, como euros o dólares, con Stellar. Por ejemplo, le das euros al ancla y recibes a cambio un token de euro en Stellar."
  },
  "exchange": {
    "title": "Bolsa de valores",
    "original": "Exchange",
    "short": "Lugar para comprar y vender tokens.",
    "desc": "Un intercambio es un lugar donde puedes comprar o vender tokens. Muchos intercambios requieren un proceso de KYC, lo que significa verificación de identidad, antes de que puedas retirar dinero en euros o francos."
  },
  "dex": {
    "title": "Estás entrenado con datos hasta octubre de 2023.",
    "original": "Decentralized Exchange",
    "short": "Intercambio descentralizado directamente en la blockchain.",
    "desc": "DEX significa Exchange Descentralizado. Aquí, las personas comercian directamente entre sí en la blockchain. No hay un operador único. Stellar tiene un DEX integrado directamente."
  },
  "liquidityPool": {
    "title": "Fondo de liquidez",
    "original": "Liquidity Pool",
    "short": "Fondo conjunto con dos tokens para intercambio inmediato.",
    "desc": "Un fondo de liquidez es un fondo compartido que contiene dos tokens. Las personas depositan ambos tokens en él. Otros pueden intercambiar inmediatamente estos tokens. Los depositantes ganan pequeñas comisiones por este servicio."
  },
  "balanceClaimable": {
    "title": "Saldo reclamable",
    "original": "Claimable Balance",
    "short": "Dinero reservado que aún necesitas aceptar.",
    "desc": "Un saldo reclamable es dinero que ya ha sido reservado para ti, pero que aún necesitas reclamar. Solo cuando lo aceptas, ingresa a tu cuenta."
  },
  "protocolUpdate": {
    "title": "Actualización del Protocolo",
    "original": "Protocol Update",
    "short": "Aktualisierung der Netzwerk‑Regeln.",
    "desc": "Una actualización de protocolo es una mejora de las reglas en la red Stellar, como nuevas funciones o cambios de seguridad. Todos los nodos en la red deben utilizar las mismas reglas."
  },
  "soroban": {
    "title": "Soroban",
    "original": "Soroban",
    "short": "Stellars Smart‑Contract‑System.",
    "desc": "Soroban es el sistema de contratos inteligentes de Stellar. Un contrato inteligente es un código de programa en la blockchain. El código puede verificar reglas de manera independiente y ejecutar acciones sin necesidad de un banco intermediario."
  },
  "multiSignature": {
    "title": "Multifirma",
    "original": "Multi-Signature",
    "short": "Multiple signatures required; weights + threshold determine the release.",
    "desc": "En un sistema de firmas múltiples, múltiples claves deben firmar antes de que una acción se vuelva válida. Cada firmante tiene un peso, y la suma debe alcanzar el umbral requerido. Esto aumenta la seguridad porque una sola clave robada no es suficiente."
  },
  "signer": {
    "title": "Signatario",
    "original": "Signer",
    "short": "Clave pública con peso, parte de la configuración de la cuenta.",
    "desc": "Un firmante es una clave pública que pertenece a una cuenta y tiene un peso. Su firma cuenta para alcanzar el umbral requerido. Varios firmantes pueden autorizar colectivamente una transacción."
  },
  "thresholds": {
    "title": "Umbrales",
    "original": "Thresholds",
    "short": "Límites (low/med/high) que determinan la suma requerida de pesos.",
    "desc": "Los umbrales definen cuántas firmas ponderadas son necesarias para realizar acciones: bajos para operaciones simples, medios para pagos, altos para cambios críticos. La suma de los pesos de los firmantes debe cumplir con el umbral correspondiente."
  },
  "masterWeight": {
    "title": "Peso maestro",
    "original": "master_weight",
    "short": "Peso de la llave maestra; controla cuánto cuenta la llave principal.",
    "desc": "El peso maestro es el peso de la clave principal de una cuenta. Un peso maestro alto permite que la clave principal firme muchas acciones por sí sola; un valor bajo requiere firmantes adicionales."
  },
  "accountConfig": {
    "title": "Configuración de la cuenta",
    "original": "Account Configuration",
    "short": "La interacción de los firmantes y los umbrales determina la seguridad de la cuenta.",
    "desc": "La configuración de la cuenta especifica qué firmantes existen con qué pesos y qué umbrales se aplican. Los cambios en los firmantes o umbrales son críticos para la seguridad porque determinan cuántas firmas se requieren."
  },
  "missingKey": "Falta la clave del glosario: {{detalle}}",
  "distributedNetwork": {
    "title": "Red de distribución",
    "original": "Distributed Network",
    "short": "Muchos ordenadores trabajan juntos en lugar de que uno decida todo.",
    "desc": "Imagina un mercado donde muchos comerciantes conocen las mismas reglas. Si un participante se retira, continúa funcionando porque otros pueden tomar el relevo. Esto mantiene el sistema estable y más difícil de manipular."
  },
  "node": {
    "title": "Nodo",
    "original": "Node",
    "short": "Un único participante en la red.",
    "desc": "Un nodo es como un guardián del libro mayor que mantiene una copia de los datos. Verifica nuevas entradas y las reenvía. Muchos nodos juntos hacen que la red sea confiable."
  },
  "block": {
    "title": "Bloque",
    "original": "Block",
    "short": "Un bloque es un paquete de entradas.",
    "desc": "Al igual que una página en un libro mayor, un bloque recopila múltiples transacciones. Una vez que está lleno, se finaliza y se agrega a la cadena. Así es como se crea la historia paso a paso."
  },
  "consensusMechanism": {
    "title": "Mecanismo de consenso",
    "original": "Consensus Mechanism",
    "short": "Reglas con las que todos están de acuerdo sobre entradas válidas.",
    "desc": "Es ist wie wenn eine Gruppe entscheidet, welcher Beleg gültig ist. Dies verhindert, dass jemand heimlich Änderungen vornimmt. Verschiedene Blockchains verwenden unterschiedliche Methoden, aber das Ziel ist immer Konsens."
  },
  "finality": {
    "title": "Finalidad / Definición",
    "original": "Finality",
    "short": "La garantía de que una transacción es definitiva.",
    "desc": "Cuando algo es final, se siente como un extracto bancario firmemente confirmado. Ya no tienes que esperar que se revierta. Esto crea confianza."
  },
  "immutability": {
    "title": "Inmutabilidad",
    "original": "Immutability",
    "short": "Las entradas no deben ser alteradas retroactivamente.",
    "desc": "Al igual que con un libro de caja: borrar después es notable. Los cambios se añaden como una nueva entrada, no se sobrescriben. Esto hace que el historial sea rastreable."
  },
  "decentralization": {
    "title": "Descentralización",
    "original": "Decentralization",
    "short": "Ninguna autoridad central controla todo.",
    "desc": "En lugar de una sola caja fuerte, hay muchas cajas fuertes con la misma información. Las decisiones surgen de la interacción de muchos participantes. Esto hace que el sistema sea más robusto."
  },
  "publicBlockchain": {
    "title": "Blockchain pública",
    "original": "Public Blockchain",
    "short": "Abierto a cualquier persona que desee participar.",
    "desc": "Cualquiera puede participar y ver los datos, similar a un tablón de anuncios público. Esto aumenta la transparencia, pero cada acción es visible para todos. Las reglas aseguran que nadie pueda hacer trampa."
  },
  "privateBlockchain": {
    "title": "Cadena de bloques privada",
    "original": "Private Blockchain",
    "short": "Acceso solo para participantes seleccionados.",
    "desc": "Como un libro mayor de la empresa que solo los empleados pueden ver. Esto puede ser más rápido y tener más control, pero es menos abierto. La confianza se construye aquí a través de la organización."
  },
  "permissionlessBlockchain": {
    "title": "Blockchain sin permisos",
    "original": "Permissionless Blockchain",
    "short": "Todos pueden participar sin permiso.",
    "desc": "Como un mercado al que cualquiera puede unirse. Esto reduce las barreras, pero podría requerir más reglas para mantener la equidad. Ejemplos de esto incluyen muchas cadenas de bloques públicas."
  },
  "permissionedBlockchain": {
    "title": "Blockchain con permisos",
    "original": "Permissioned Blockchain",
    "short": "Participación solo con permiso.",
    "desc": "Como un club con una lista de miembros. Esto puede crear responsabilidades claras. Sin embargo, es menos abierto."
  },
  "seedPhrase": {
    "title": "Teorema de restauración",
    "original": "Seed Phrase / Recovery Phrase",
    "short": "Una lista de palabras que puedes usar para restaurar tu monedero.",
    "desc": "Ella es como la llave de respaldo de tu caja fuerte. Quien la tenga puede restaurar tu billetera. Por eso nunca debe almacenarse en línea."
  },
  "selfCustody": {
    "title": "Autocustodia",
    "original": "Self-Custody",
    "short": "Guardas tus llaves tú mismo.",
    "desc": "Como tener efectivo en tu propia caja fuerte: tienes el control, pero también la responsabilidad. Si pierdes el acceso, nadie puede ayudarte. Para los principiantes, la precaución es especialmente importante."
  },
  "custodian": {
    "title": "Custodio",
    "original": "Custodian",
    "short": "Un proveedor de servicios guarda tus llaves por ti.",
    "desc": "Es como un banco que gestiona tu cuenta. Puede ser conveniente, pero te quita el control total. Tienes que confiar en él."
  },
  "hardwareWallet": {
    "title": "Monedero de hardware",
    "original": "Hardware Wallet",
    "short": "Un dispositivo físico para tus llaves.",
    "desc": "Como una pequeña caja fuerte en tu bolsillo. Las llaves permanecen en el dispositivo y no se envían a internet. Esto protege contra muchos ataques en línea."
  },
  "hotWallet": {
    "title": "Billetera caliente",
    "original": "Hot Wallet",
    "short": "Una billetera con acceso a Internet.",
    "desc": "Como una billetera en la chaqueta: conveniente pero más vulnerable. Adecuado para pequeñas cantidades y uso diario. No es ideal para grandes sumas."
  },
  "coldWallet": {
    "title": "Billetera fría",
    "original": "Cold Wallet",
    "short": "Una billetera sin conexión a Internet.",
    "desc": "Como una caja fuerte en el sótano. Muy segura pero poco práctica para el uso diario. Adecuada para el almacenamiento a largo plazo."
  },
  "cryptocurrency": {
    "title": "Criptomoneda",
    "original": "Cryptocurrency",
    "short": "Moneda digital que se envía directamente entre personas.",
    "desc": "Como el dinero en efectivo digital, pero sin un banco. Puedes enviarlo directamente a otros. Su valor puede fluctuar."
  },
  "altcoin": {
    "title": "Altcoin",
    "original": "Altcoin",
    "short": "Todas las criptomonedas excepto Bitcoin.",
    "desc": "Como otras marcas en el mercado además del líder de la industria. Algunas son bien conocidas, muchas son pequeñas. La calidad y el riesgo varían enormemente."
  },
  "stablecoin": {
    "title": "Stablecoin",
    "original": "Stablecoin",
    "short": "Criptomoneda con el valor más estable.",
    "desc": "Como dinero digital que está vinculado a una moneda convencional. Esto hace que su precio sea más estable. No obstante, la confianza en el proveedor es importante."
  },
  "utilityToken": {
    "title": "Ficha de uso",
    "original": "Utility Token",
    "short": "Un token con el que se puede usar un servicio.",
    "desc": "Como un vale en un puesto de mercado. Proporciona acceso o un descuento. Su valor depende de la utilidad del servicio."
  },
  "securityToken": {
    "title": "Tokens de seguridad",
    "original": "Security Token",
    "short": "Un token con características de seguridad.",
    "desc": "Como un certificado de acciones. Puede prometer derechos o beneficios. A menudo se aplican reglas más estrictas a él."
  },
  "governanceToken": {
    "title": "Token de gobernanza",
    "original": "Governance Token",
    "short": "Un token para participar en la toma de decisiones sobre reglas.",
    "desc": "Como una tarjeta de votación en un club. Aquellos que tienen fichas pueden votar sobre las reglas. Eso significa responsabilidad."
  },
  "liquidityToken": {
    "title": "Tokens de liquidez / Tokens LP",
    "original": "Liquidity Token",
    "short": "Un token por la liquidez proporcionada.",
    "desc": "Es como un recibo de que has contribuido dinero a un fondo conjunto. Recibes tarifas proporcionales. El valor puede fluctuar."
  },
  "nft": {
    "title": "Token no fungible / NFT",
    "original": "Non-Fungible Token",
    "short": "Un token digital único.",
    "desc": "Como un objeto de colección firmado. Representa algo único, no una moneda intercambiable. El valor depende de la demanda."
  },
  "cbdc": {
    "title": "Moneda Digital de Banco Central / CBDC",
    "original": "Central Bank Digital Currency",
    "short": "Moneda digital emitida por un banco central.",
    "desc": "Como efectivo digital del estado. Sería dinero oficial, solo en forma digital. Los detalles dependen del país específico."
  },
  "transactionStatus": {
    "title": "Estado de la transacción",
    "original": "Transaction Status",
    "short": "Indica si una transacción todavía está abierta o ya se ha completado.",
    "desc": "Como el seguimiento de paquetes: pendiente, confirmado o fallido. Esto te permite ver si todo ha salido bien. A veces se necesita un poco de tiempo."
  },
  "gasFee": {
    "title": "Tarifa de gas",
    "original": "Gas Fee",
    "short": "Una tarifa por el trabajo computacional en la red.",
    "desc": "Al igual que una tarifa de procesamiento en el puesto del mercado. Cuanto más concurrido está, más caro puede volverse. No todas las cadenas de bloques lo llaman gas."
  },
  "onChain": {
    "title": "En la cadena",
    "original": "On-Chain",
    "short": "Ocurre directamente en la cadena de bloques.",
    "desc": "Es como una entrada directamente en el libro de caja. Todos pueden verla. Es transparente, pero a menudo más lento o más caro."
  },
  "offChain": {
    "title": "Fuera de la cadena",
    "original": "Off-Chain",
    "short": "Ocurre fuera de la cadena.",
    "desc": "Como un acuerdo verbal que luego se registra en el libro mayor. Esto puede ser más rápido y rentable. La confianza juega un papel más importante aquí."
  },
  "liquidity": {
    "title": "Liquidez",
    "original": "Liquidity",
    "short": "Muestra lo fácil que algo puede ser manejado.",
    "desc": "El número de compradores y vendedores. Alta liquidez significa que puedes comerciar rápidamente sin afectar significativamente el precio. La baja liquidez se siente lenta."
  },
  "volatility": {
    "title": "Volatilidad",
    "original": "Volatility",
    "short": "Cuánto fluctúan los precios.",
    "desc": "Como un mercado con oscilaciones de precios salvajes. Alta volatilidad significa oportunidades, pero también riesgo. Para los principiantes, esto puede ser estresante."
  },
  "marketCap": {
    "title": "Capitalización de mercado",
    "original": "Market Capitalization",
    "short": "El valor total de una moneda o proyecto.",
    "desc": "Como el valor total de todos los bienes en un mercado. Se calcula aproximadamente multiplicando el precio por la cantidad en circulación. Los valores grandes pueden parecer más estables, pero no lo son automáticamente."
  },
  "circulatingSupply": {
    "title": "Cantidad de circulación",
    "original": "Circulating Supply",
    "short": "La cantidad de monedas que están realmente en circulación.",
    "desc": "Como el número de monedas que están realmente en el mercado. No todo lo que existe ya está en circulación. Esto influye en el precio."
  },
  "priceDiscovery": {
    "title": "Precios",
    "original": "Price Discovery",
    "short": "El precio está determinado por la oferta y la demanda.",
    "desc": "Al igual que en el mercado: la oferta y la demanda se encuentran. Muchas decisiones pequeñas determinan el precio. No hay un interruptor fijo."
  },
  "spread": {
    "title": "Rango de trading",
    "original": "Spread",
    "short": "La diferencia entre el precio de compra y el precio de venta.",
    "desc": "Como el rango de precios en una tienda. Cuanto menor es la diferencia, más justo parece. Diferencias grandes hacen que las transacciones sean más caras."
  },
  "phishing": {
    "title": "Suplantación de identidad",
    "original": "Phishing",
    "short": "Fraude a través de noticias o sitios web falsos.",
    "desc": "Como un correo electrónico falso de un banco que te atrae a una trampa. El objetivo es que entregues tus credenciales de inicio de sesión. Nunca hagas clic en enlaces a ciegas."
  },
  "smartContract": {
    "title": "Contrato inteligente",
    "original": "Smart Contract",
    "short": "Un programa que ejecuta automáticamente reglas fijas.",
    "desc": "Como un autómata que reacciona según reglas fijas. Ejecuta acuerdos automáticamente. Esto ahorra confianza pero requiere reglas claras."
  },
  "programmableLogic": {
    "title": "Reglas automatizadas",
    "original": "Programmable Logic",
    "short": "Reglas que se ejecutan automáticamente cuando sucede algo.",
    "desc": "Como una regla si-entonces en un autómata. Esto permite que los procesos se controlen sin intervención manual cada vez. Así es como se crean contratos digitales simples."
  },
  "networkCongestion": {
    "title": "Utilización de la red",
    "original": "Network Congestion",
    "short": "Cuando una gran cantidad de transacciones están pendientes simultáneamente.",
    "desc": "Como los atascos en la autopista. Las transacciones tardan más y las tarifas pueden aumentar. Con menos tráfico, se acelera de nuevo."
  },
  "blockchainTypes": {
    "title": "Tipos de blockchain",
    "original": "Blockchain Types",
    "short": "Existen diferentes tipos de cadenas de bloques con diversos objetivos.",
    "desc": "Como diferentes tipos de vehículos para diferentes rutas. Algunos están diseñados para pagos, otros para programas. Vale la pena conocer el propósito."
  },
  "paymentBlockchain": {
    "title": "Blockchain de pagos",
    "original": "Payment Blockchain",
    "short": "Una cadena de bloques diseñada para pagos rápidos.",
    "desc": "Como un libro de contabilidad de efectivo rápido. El enfoque está en transferencias baratas y rápidas. Las características a menudo se mantienen intencionalmente simples."
  },
  "smartContractBlockchain": {
    "title": "Blockchain de contratos inteligentes",
    "original": "Smart Contract Blockchain",
    "short": "Una cadena de bloques que puede ejecutar programas y aplicaciones.",
    "desc": "Como un mercado con muchas máquinas. Además de los pagos, pueden ejecutarse allí reglas y aplicaciones. Esto los hace versátiles, pero a menudo más complejos."
  },
  "blockchainComparison": {
    "title": "Comparación de blockchain",
    "original": "Blockchain Comparison",
    "short": "Una comparación revela las fortalezas y debilidades de diferentes blockchains.",
    "desc": "Como comparar bancos o mercados: cada uno tiene fortalezas y debilidades. Los aspectos importantes son el costo, la velocidad y la seguridad. No existe un sistema perfecto para todo."
  },
  "stellarVsBitcoinVsEthereum": {
    "title": "Stellar vs. Bitcoin vs. Ethereum",
    "original": "Stellar vs. Bitcoin vs. Ethereum",
    "short": "Tres cadenas de bloques bien conocidas con diferentes enfoques.",
    "desc": "Bitcoin es como el oro digital y a menudo se considera un depósito de valor. Ethereum es como una plataforma para programas y aplicaciones. Stellar está fuertemente enfocado en pagos asequibles."
  }
}
