{
  "title": "Crear cuenta + multifirma",
  "menu": "Crear cuenta + Multisig",
  "menuHint": "Crea una nueva cuenta y, opcionalmente, configura la firma múltiple.",
  "hint": "Crea una nueva cuenta, actívala y, opcionalmente, configura la firma múltiple.",
  "generateKeys": "Generar clave",
  "enableMultisig": "Habilitar multisig",
  "signersTitle": "Firmar",
  "signersInfo": "Agrega firmantes adicionales y establece umbrales apropiados.",
  "signersCount": "Número de signatarios",
  "bestPractices": {
    "title": "Mejores Prácticas",
    "text": "Mantén las claves secretas seguras y no las distribuyas innecesariamente."
  },
  "instructions": {
    "public": "Comparte esta clave pública con otros para pagos.",
    "secret": "Mantén esta Clave Secreta segura; nunca la compartas."
  },
  "generateFirst": "Primero, genera un par de claves.",
  "confirmLowBalance": "El saldo inicial de {bal} XLM está por debajo de la reserva recomendada de {req} XLM (Firmantes: {count}). ¿Proceder?",
  "activated": "La cuenta ha sido activada. Hash: {hash}",
  "activatedTestnet": "La cuenta fue activada en la testnet a través de Friendbot.",
  "alreadyActive": "La cuenta ya está activada.",
  "createdNoSigners": "Cuenta creada, multisig no configurado.",
  "createdAndConfigured": "Cuenta creada y firma múltiple configurada. Hash: {hash}",
  "info": {
    "more": "Más información",
    "keysOnPage": {
      "title": "Clave en esta página",
      "text": "En esta página se generan claves. Manténgalas seguras y no las comparta."
    },
    "title": "Información importante",
    "secureKeys": {
      "title": "Clave privada segura",
      "text": "Der Public Key (öffentlicher Schlüssel) kann sicher geteilt werden – er ist wie eine Kontonummer.\\n\\nDer Secret Key (Geheimschlüssel) ist der Zugang zu Ihrem Konto. Behandeln Sie ihn wie ein Passwort:\\n• Speichern Sie ihn NIEMALS in Cloud-Diensten, E-Mails oder unsicheren Notizen\\n• Notieren Sie ihn auf Papier oder verwenden Sie einen Hardware-Wallet\\n• Erstellen Sie mehrere Backups und lagern Sie diese an sicheren, getrennten Orten\\n• Bei Verlust des Secret Keys ist der Zugang zum Konto unwiderruflich verloren"
    },
    "multisigSection": {
      "title": "Multisig (Mehrfachsignatur)",
      "text": "Con Multisig, puedes definir múltiples firmantes para tu cuenta. Las transacciones luego requieren firmas de múltiples, por ejemplo, 2 de 3.\n\nVentajas:\n• Mayor seguridad (ein kompromittierter Key reicht nicht)\n• Cuentas conjuntas (z. B. Firmen, Partnerschaften)\n• Recuperación de emergencia (mehrere Backups bei verschiedenen Personen)\n\nADVERTENCIA: ¡Prueba Multisig primero en la testnet antes de implementarlo en la mainnet! Una configuración incorrecta puede resultar en la pérdida de acceso a la cuenta."
    },
    "diagram": {
      "title": "Expiración de la firma"
    }
  },
  "activateHint": "La activación es necesaria para que la cuenta exista. En la testnet, se puede hacer a través de Friendbot, y en la mainnet mediante \"Crear Cuenta\" desde una billetera existente.",
  "activateNow": "Activar la cuenta inmediatamente.",
  "activateOnly": "Solo activa",
  "balanceWarning": "Es probable que el saldo inicial sea demasiado bajo para agregar a los {{count}} firmantes adicionales (reserva mínima: {{req}} XLM).",
  "createButton": "Crear / Configurar multifirma",
  "hints": {
    "byteRange": "(0–255)"
  },
  "mainnetActivateNote": "Nota: Se requieren reservas adicionales para multisig. 1 XLM a menudo no es suficiente.",
  "reserve": {
    "base": "Reserva base por entrada: {{val}} XLM",
    "recommended": "Saldo inicial recomendado: {{val}} XLM (inkl. Puffer)",
    "required": "Reserva mínima requerida (neu): {{val}} XLM"
  },
  "signersCountHint": "Establece el número mínimo de firmas a continuación en \"Firmas requeridas\" (niedrig/mittel/hoch).",
  "signersCountLimit": "Nota: Límite de Red (Stellar): máximo 20 firmantes adicionales.",
  "startingBalance": "Crédito inicial (XLM)",
  "threshold": "Firmas requeridas (niedrig/mittel/hoch)",
  "thresholdLow": "bajo",
  "thresholdMed": "medio",
  "thresholdHigh": "alto",
  "thresholdCurrent": "Actualmente seleccionado: bajo={{low}}, medio={{med}}, alto={{high}} de un total de {{total}} firmas",
  "thresholdHelp": "Umbral: Número de firmas requeridas (principal + firmantes) para que una transacción sea válida.",
  "thresholdInfo": "Recomendación: {{req}} de {{total}} firmas (inkl. Master)",
  "thresholdLevelsHint": "Normalmente, se aplica lo siguiente: bajo = cambios simples (e.g., memo, price), medio = pagos/comercio, alto = cambios críticos de seguridad (e.g., signer/thresholds).",
  "thresholdStatic": "Requerido: {{val}} de {{total}} firmas (niedrig/mittel/hoch)",
  "thresholdSum": "Peso total: {{sum}}",
  "thresholdTooHigh": "Nota: Un umbral no debe exceder la suma de los pesos. Por favor, ajuste los valores en consecuencia.",
  "keyWarning": {
    "title": "⚠️ ¡Asegura tu clave ahora!",
    "text1": "Has generado un nuevo par de claves.",
    "text2": "Asegura AMBAS llaves INMEDIATAMENTE antes de continuar:",
    "list1": "Clave pública: La dirección de tu cuenta, que se puede compartir.",
    "list2": "Clave secreta: Tu contraseña – ¡NUNCA la compartas ni la guardes en línea!",
    "list3": "Si se pierde la clave secreta, el acceso se pierde irremediablemente.",
    "confirm": "He asegurado ambas llaves."
  },
  "tooltips": {
    "high": "Alto: cambios críticos para la seguridad (e.g., signers/thresholds).",
    "low": "Bajo: cambios simples (e.g., memo, price).",
    "masterWeight": "Peso del titular de la cuenta (Master) (0-255): La clave principal de la cuenta tiene derechos de voto. Cuanto mayor sea su peso, más votos cuenta su firma. Estos votos se cuentan junto con los votos de otros signatarios para verificar si se ha alcanzado la mayoría requerida.",
    "med": "Medios: Pagos y acciones comerciales.",
    "signerWeight": "Weight of the signers (0–255): Additional signers also have voting rights. The weight determines how many votes their signature contributes. When a transaction is submitted, all cast votes are added together. If the specified minimum number of votes (Threshold) is reached, the transaction is considered authorized.",
    "signerWeightHint": "Nota: Los pesos del maestro y del firmante suman el total; los umbrales (niedrig/mittel/hoch) no deben exceder este total."
  },
  "units": {
    "signatures": "Firma (en)"
  },
  "muxedId": "Muxed-ID",
  "muxedInfo": "Con la identificación Muxed, se crea una M-address (M...). Esta apunta a la misma cuenta que la dirección regular (G...).",
  "muxedIdInvalid": "El ID combinado debe ser un número entero entre 0 y 18,446,744,073,709,551,615.",
  "muxedAddress": "Dirección multiplexada",
  "muxedActivationInfo": "Las direcciones muxed son direcciones alias. No necesitan ser activadas por separado."
}