{
  "title": "Explicación general de una cuenta corporativa de firma múltiple (Multi-Signature)",
  "intro": "Una empresa puede usar una cuenta conjunta de blockchain que involucra a varias personas autorizadas. Normalmente, participan al menos tres signatarios (Signer), como la gerencia, el oficial financiero y el oficial de cumplimiento/respaldo. El objetivo es que las personas individuales puedan ejecutar pagos de manera independiente sin que ninguna persona tenga control exclusivo o tome el control de la cuenta.",
  "problem": "Si un firmante (Signer) tiene suficiente peso para ejecutar pagos y al mismo tiempo suficiente peso para realizar cambios en la cuenta, esa persona podría eliminar a otros firmantes (Signer) o ajustar el umbral/ponderación (Thresholds) y, por lo tanto, tomar el control de la cuenta. Por el contrario, el propietario original tampoco debería poder excluir a otros firmantes (Signer) sin controles y equilibrios. Una estructura de firma múltiple asegura que las decisiones importantes siempre sean respaldadas colectivamente por varias personas.",
  "setupTitle": "Ejemplo de una estructura multi-firma segura con tres firmantes",
  "setupWeights": "En un ejemplo con tres roles equivalentes, todos reciben la misma fuerza de firma:\n- Signer (Signer) A (management): peso 2\n- Signer (Signer) B (Finanzen): peso 2\n- Signer (Signer) C (Compliance/Backup): peso 2",
  "setupThresholds": "Se establecen umbrales/pesajes apropiados:\n- Bajo (low_threshold): 1\n- Medio (med_threshold): 2 (for payments and other medium actions)\n- Alto (high_threshold): 4 (para cambios estructurales como agregar/eliminar firmantes (Signer) o cambiar el umbral/pesaje (Thresholds))\nEsta configuración permite que cada persona autorizada ejecute pagos, pero ninguna persona sola puede cambiar la estructura de la cuenta.",
  "behavior": "Con esta configuración, los pagos pueden ser realizados individualmente por cualquiera de las tres personas autorizadas, ya que el peso de cada individuo cumple con el umbral/peso medio (Threshold). Sin embargo, para cambios estructurales como eliminar un firmante (Signers), ajustar los umbrales/pesos, o fusionar o cerrar la cuenta, se requiere el umbral/peso alto (high_threshold). Este valor solo puede alcanzarse si al menos dos de los tres firmantes (Signer) firman juntos. De esta manera, la cuenta se mantiene flexible para el uso diario mientras está bien protegida contra el uso indebido.",
  "removal": "Wenn eine Person das Unternehmen verlässt oder nicht mehr vertrauenswürdig ist, können zwei der verbleibenden Unterzeichner (Signer) gemeinsam die Signaturrechte dieser Person entfernen. Kein einzelner Unterzeichner (Signer) – weder ein Mitarbeiter noch die Geschäftsführung – kann andere eigenständig aus dem Konto ausschließen. Der Entzug von Berechtigungen erfolgt also immer kontrolliert und nachvollziehbar durch mindestens zwei Verantwortliche.",
  "summary": "Este tipo de estructura de firma múltiple permite a personas individuales procesar pagos de manera eficiente, mientras se mantiene el control de la cuenta en manos de múltiples partes. Reduce el riesgo de apropiaciones de cuentas, protege contra decisiones unilaterales y es particularmente adecuado para cuentas corporativas donde tanto la seguridad como la flexibilidad operativa son importantes.",
  "closeLabel": "Cerrar",
  "linkLabel": "¿Qué significa Multi-Signature?"
}