{
  "title": "Explicación general de una cuenta corporativa de firma múltiple (Multi-Signature).",
  "intro": "Una empresa puede utilizar una cuenta de blockchain compartida que involucre a varias personas autorizadas. Por lo general, intervienen al menos tres signatarios (Signer), por ejemplo, gestión, oficial financiero y cumplimiento/reserva. El objetivo es que las personas individuales puedan ejecutar pagos de manera independiente, sin que ninguna persona sola pueda controlar o tomar el mando de la cuenta.",
  "problem": "Si un firmante (Signer) tiene suficiente peso para ejecutar pagos y, simultáneamente, posee suficiente peso para realizar cambios en la cuenta, esta persona podría eliminar a otros firmantes (Signer) o ajustar el umbral/peso (Thresholds) y, por lo tanto, tomar control de la cuenta. Por el contrario, el propietario original no debería poder excluir fácilmente a otros firmantes (Signer) sin controles y equilibrios. Una estructura de firma múltiple garantiza que las decisiones importantes siempre se tomen conjuntamente por varias personas.",
  "setupTitle": "Ejemplo de una estructura de firma múltiple segura con tres firmantes",
  "setupWeights": "En un ejemplo con tres roles igualmente importantes, todos reciben la misma fuerza de firma:\n- Firmante (Signer) A (Management): Peso 2\n- Firmante (Signer) B (Finanzen): Peso 2\n- Firmante (Signer) C (Compliance/Backup): Peso 2",
  "setupThresholds": "Se establecen umbrales/pesos apropiados:\n- Bajo (low_threshold): 1\n- Medio (med_threshold): 2 (for payments and other medium actions)\n- Alto (high_threshold): 4 (para cambios estructurales como añadir/eliminar firmantes (Signer) o cambiar el umbral/peso (Thresholds))\nEsto permite a cada individuo autorizado ejecutar pagos, pero ninguna persona sola puede alterar la estructura de la cuenta por sí misma.",
  "behavior": "Con esta configuración, los pagos pueden ser ejecutados por cualquiera de los tres individuos autorizados de forma independiente, ya que el peso individual siempre cumple con el umbral medio/Threshold. Para cambios estructurales como eliminar un firmante/Signers, ajustar los umbrales/pesos, o fusionar o cerrar la cuenta, se requiere el umbral alto/high_threshold. Este valor solo puede alcanzarse si al menos dos de los tres firmantes/Signer firman juntos. De esta manera, la cuenta permanece flexible para el uso diario mientras está bien protegida contra el uso indebido.",
  "removal": "Si una persona deja la empresa o ya no es confiable, dos de los firmantes restantes (Signer) pueden conjuntamente remover los derechos de firma de esa persona. Ningún firmante individual (Signer) – ni un empleado ni la dirección – puede excluir por sí solo a otros de la cuenta. La revocación de permisos siempre se realiza de manera controlada y rastreable por al menos dos responsables.",
  "summary": "Este tipo de estructura de firmas múltiples permite a las personas individuales procesar pagos de manera eficiente, mientras mantienen el control de la cuenta con múltiples partes. Reduce el riesgo de apropiaciones de cuentas, protege contra decisiones unilaterales y es particularmente adecuada para cuentas corporativas donde tanto la seguridad como la flexibilidad operativa son importantes.",
  "closeLabel": "Cerrar",
  "linkLabel": "¿Qué significa multi-firma?"
}