{
  "info": "Solo introduce tu clave secreta si deseas firmar transacciones. Sin una clave secreta, solo puedes leer.",
  "clearSession": "Eliminar S-Keys de la sesión",
  "clearSessionHint": "Elimina todas las S-Keys almacenadas en esta sesión para esta cuenta.",
  "sessionCount": "{{count}} S-Keys guardadas",
  "mismatch": "La clave secreta ingresada no coincide con la clave pública cargada.",
  "cleared": "Clave secreta eliminada de la sesión",
  "empty": "El campo de clave secreta está vacío.",
  "invalid": "Clave secreta no válida.",
  "label": "Introduce la clave secreta de origen (S-Key)",
  "placeholder": "por ejemplo.",
  "valid": "✅ La clave secreta es válida.",
  "remember": {
    "label": "Recuerda la clave secreta para esta sesión.",
    "hint": "Cuando esté habilitada, la clave se almacenará hasta que se cierre la pestaña y se reutilizará para pagos adicionales."
  },
  "showMultisigInfo": "Información",
  "hideMultisigInfo": "Ocultar información",
  "multipleSignersThresholdInfo": "Umbral para esta acción: {{threshold}}. Normalmente se requieren al menos {{requiredSigners}} firmantes (depending on their weights).",
  "localFlow": {
    "title": "Alle Signaturen lokal eingeben & senden",
    "body": "En este diálogo, introduces todas las claves secretas necesarias localmente en este dispositivo. Luego, la transacción se firma completamente y se envía directamente a la red.",
    "stepAllKeys": "Ingrese todas las claves secretas requeridas en este dispositivo.",
    "stepSend": "La transacción se firma completamente y se envía directamente."
  },
  "multisigOptions": {
    "title": "Opciones de firma para esta cuenta multisig",
    "distributed": {
      "title": "Estándar: Flujo Multifirma Distribuido",
      "body": "De forma predeterminada, esta sesión firma solo con tu propia clave privada. Las firmas adicionales se complementan a través de archivos XDR exportados o un ID de trabajo de otros firmantes."
    },
    "localAll": {
      "title": "Introduzca todas las firmas localmente",
      "body": "Elija esta opción solo si controla todas las claves secretas asociadas a esta cuenta (z. B. nach einer Kontorettung mit mehreren Unterzeichnern). El Administrador de Cuentas de Stellar reunirá entonces todas las firmas localmente y enviará la transacción directamente a Horizon.",
      "checkboxLabel": "Ingrese todas las firmas localmente en este diálogo y envíelas directamente.",
      "warning": "Nota: Cuando ingresas todas las firmas localmente, todas las claves privadas están presentes en esta sesión. Usa esta opción solo en dispositivos confiables."
    }
  },
  "multisigInfo": {
    "summary": {
      "single": "Esta cuenta utiliza una única firma.",
      "multi": "Esta cuenta utiliza múltiples firmas (Multisig)."
    },
    "requiredThreshold": "Umbral requerido ({{level}}): {{value}}",
    "thresholdLabel": "Umbral",
    "masterWeightLabel": "Peso de la cuenta maestra",
    "masterHint": "La cuenta maestra es la cuenta cargada actualmente de la cual se origina esta operación.",
    "currentWeightLabel": "Peso ingresado",
    "weightLabel": "Ponderación",
    "signers": "Lista de signatarios",
    "master": "Llave maestra",
    "signerDisabled": "Firmante desactivado (peso = 0)",
    "masterExplanation": "La cuenta maestra corresponde a la cuenta actualmente cargada. Inicialmente, tenía todos los derechos antes de que se añadieran firmantes adicionales."
  },
  "jobSign": {
    "masterOnly": "Solo la llave maestra de esta cuenta puede firmar para este paso.",
    "anyActive": "La clave maestra tiene un peso de 0. Por favor, ingresa la clave secreta de uno de los firmantes listados con un peso superior a 0."
  },
  "operations": {
    "payment": "Pago",
    "setOptions": "Configuration (Signers & Thresholds)",
    "changeTrust": "Cambiar la línea de confianza",
    "unknown": "Acción"
  }
}
