{
  "info": "Solo ingresa tu clave secreta si deseas firmar transacciones. Sin una clave secreta, solo podrás leer.",
  "clearSession": "Borrar secreto de sesión",
  "clearSessionHint": "Elimina la clave secreta almacenada en caché de la sesión.",
  "mismatch": "La clave secreta ingresada no coincide con la clave pública cargada.",
  "cleared": "Clave secreta eliminada de la sesión",
  "empty": "El campo de clave secreta está vacío.",
  "invalid": "Clave secreta no válida.",
  "label": "Introduzca la clave secreta de origen (S-Key)",
  "placeholder": "z. B. (for example)",
  "valid": "✅ La clave secreta es válida.",
  "remember": {
    "label": "Recuerda la clave secreta para esta sesión.",
    "hint": "Cuando esté habilitado, la clave se almacenará hasta que se cierre la pestaña y se reutilizará para pagos futuros."
  },
  "showMultisigInfo": "Estoy entrenado con datos hasta octubre de 2023.",
  "hideMultisigInfo": "Ocultar información.",
  "multipleSignersThresholdInfo": "Umbral para esta acción: {{threshold}}. Normalmente, se requieren al menos {{requiredSigners}} firmantes (depending on their weights).",
  "localFlow": {
    "title": "Alle Signaturen lokal eingeben & senden",
    "body": "En este diálogo, ingresas todas las claves secretas requeridas localmente en este dispositivo. Después de eso, la transacción se firma completamente y se envía directamente a la red.",
    "stepAllKeys": "Introduce todas las claves secretas requeridas en este dispositivo.",
    "stepSend": "La transacción se firma completamente y se envía directamente."
  },
  "multisigOptions": {
    "title": "Opciones de firma para esta cuenta multisig",
    "distributed": {
      "title": "Estándar: Flujo de Multisig Distribuido",
      "body": "Por defecto, esta sesión solo firma con tu propia clave secreta. Firmas adicionales se añaden mediante archivos XDR exportados o un ID de trabajo de otros firmantes."
    },
    "localAll": {
      "title": "Ingrese todas las firmas localmente.",
      "body": "Elige esta opción solo si controlas todas las claves secretas asociadas con esta cuenta (z. B. nach einer Kontorettung mit mehreren Unterzeichnern). El Administrador de Cuentas Stellar recopilará entonces todas las firmas localmente y enviará la transacción directamente a Horizon.",
      "checkboxLabel": "Introduce todas las firmas localmente dentro de este diálogo y envíalas directamente.",
      "warning": "Nota: Si ingresas todas las firmas localmente, todas las claves secretas estarán presentes en esta sesión. Usa esta opción solo en dispositivos de confianza."
    }
  },
  "multisigInfo": {
    "summary": {
      "single": "Esta cuenta utiliza una única firma.",
      "multi": "Esta cuenta utiliza múltiples firmas (Multisig)."
    },
    "requiredThreshold": "Umbral Requerido ({{level}}): {{value}}",
    "thresholdLabel": "Umbral",
    "masterWeightLabel": "Peso de la cuenta maestra",
    "masterHint": "La cuenta maestra es la cuenta actualmente cargada desde la cual se origina esta operación.",
    "currentWeightLabel": "Peso ingresado",
    "weightLabel": "Ponderación",
    "signers": "Lista de firmantes",
    "master": "Llave maestra",
    "signerDisabled": "Firmante desactivado (peso = 0)",
    "masterExplanation": "La cuenta maestra corresponde a la cuenta actualmente cargada. Inicialmente, tenía todos los derechos antes de que se añadieran firmantes adicionales."
  },
  "jobSign": {
    "masterOnly": "Solo la clave maestra de esta cuenta puede firmar para este paso.",
    "anyActive": "El peso maestro es 0. Por favor, ingresa la clave secreta de uno de los firmantes listados con un peso mayor que 0."
  },
  "operations": {
    "payment": "Pago",
    "setOptions": "Configuration (Signers & Thresholds)",
    "changeTrust": "Cambiar línea de confianza",
    "unknown": "Acción"
  }
}