{
  "info": "Solo ingresa tu Clave Secreta si deseas firmar transacciones. Sin una Clave Secreta, solo puedes leer.",
  "clearSession": "Eliminar el secreto de sesión",
  "clearSessionHint": "Elimina la clave secreta almacenada en caché de la sesión.",
  "mismatch": "La clave secreta introducida no coincide con la clave pública cargada.",
  "cleared": "Clave secreta eliminada de la sesión",
  "empty": "El campo de clave secreta está vacío.",
  "invalid": "Clave secreta no válida.",
  "label": "Introduzca la clave secreta de origen (S-Key)",
  "placeholder": "por ejemplo.",
  "valid": "✅ La clave secreta es válida.",
  "remember": {
    "label": "Recuerda la clave secreta para esta sesión.",
    "hint": "Cuando está habilitada, la clave se almacenará hasta que se cierre la pestaña y se reutilizará para pagos posteriores."
  },
  "addSigner": "Agregar firmante adicional",
  "showMultisigInfo": "Información",
  "hideMultisigInfo": "Ocultar información",
  "multipleSignersInfo": "Esta acción requiere múltiples firmas. Por favor, proporcione suficientes claves secretas para alcanzar el umbral.",
  "multisigOptions": {
    "title": "Opciones de firma para esta cuenta multifirma",
    "distributed": {
      "title": "Estándar: Flujo Multisig Distribuido",
      "body": "De forma predeterminada, esta sesión firma solo con tu propia clave privada. Las firmas adicionales se agregan a través de archivos XDR exportados o un ID de trabajo de otros firmantes."
    },
    "localAll": {
      "title": "Ingrese todas las firmas localmente.",
      "body": "Elige esta opción solo si controlas todas las claves secretas asociadas con esta cuenta (z. B. nach einer Kontorettung mit mehreren Signern). El Stellar Account Manager reunirá entonces todas las firmas localmente y enviará la transacción directamente a Horizon.",
      "checkboxLabel": "Ingrese todas las firmas en este diálogo localmente y envíelas directamente.",
      "warning": "Nota: Si introduces todas las firmas localmente, todas las claves secretas estarán presentes en esta sesión. Usa esta opción solo en dispositivos de confianza."
    }
  },
  "multisigInfo": {
    "summary": {
      "single": "Esta cuenta utiliza una sola firma.",
      "multi": "Esta cuenta utiliza múltiples firmas (Multisig)."
    },
    "requiredThreshold": "Umbral requerido ({{level}}): {{value}}",
    "thresholdLabel": "Umbral",
    "weightLabel": "Peso actual",
    "signers": "Lista de signatarios",
    "masterWeightLabel": "Peso de la cuenta maestra",
    "masterHint": "La cuenta principal es la cuenta cargada actualmente desde la cual se origina esta operación.",
    "currentWeightLabel": "Peso ingresado",
    "masterExplanation": "La cuenta maestra corresponde a la cuenta actualmente cargada. Inicialmente, tenía todos los derechos antes de que se añadieran firmantes adicionales.",
    "master": "Llave maestra",
    "signerDisabled": "Firmante desactivado (peso = 0)"
  },
  "operations": {
    "payment": "Pago",
    "setOptions": "Configuration (Signers & Thresholds)",
    "changeTrust": "Cambiar línea de confianza",
    "unknown": "Acción"
  },
  "multipleSignersThresholdInfo": "Umbral para esta acción: {{threshold}}. Normalmente, se requieren un mínimo de {{requiredSigners}} firmantes (depending on their weights).",
  "localFlow": {
    "title": "Enter & send all signatures locally",
    "body": "En este diálogo, introduces todas las claves secretas necesarias localmente en este dispositivo. Después de eso, la transacción se firma completamente y se envía directamente a la red.",
    "stepAllKeys": "Ingrese todas las claves secretas requeridas en este dispositivo.",
    "stepSend": "La transacción se firma completamente y se envía directamente."
  }
}