{
  "nav": {
    "title": "Modo Historia",
    "chapter_select": "Elegir capítulo",
    "chapter_select_title": "Selección de capítulos",
    "chapter_select_sub": "Elige un capítulo para jugar",
    "to_home": "Inicio",
    "to_chapters": "Capítulos",
    "step_back": "Atrás",
    "confirm_leave": "Tu progreso en este capítulo se guardará.",
    "confirm_leave_cancel": "Cancelar",
    "confirm_leave_ok": "Salir",
    "chapter_locked": "Bloqueado",
    "chapter_completed": "Completado",
    "chapter_current": "Continuar",
    "chapter_start": "Empezar",
    "home_short": "Inicio",
    "chapters_short": "Capítulos",
    "back_short": "Atrás",
    "back_to_home": "Volver al inicio"
  },
  "chapter1": {
    "introNarrator": "La blockchain de Stellar – una red digital que mueve valor alrededor del mundo. Y cayendo justo en ella cae una pequeña estrella...",
    "introDialog1": "¡Hola! Soy Lumio y acabo de aterrizar en la blockchain de Stellar! 🌟",
    "introDialog2": "Pero aún no tengo una cuenta aquí... ¿puedes ayudarme a crear una?",
    "keypairTitle": "Paso 1 – ¿Qué es un Par de Claves?",
    "keypairNarrator": "Cada cuenta en Stellar consta de dos claves: la Clave Pública (tu dirección) y la Clave Secreta (tu contraseña). Solo quien conoce la Clave Secreta puede enviar dinero.",
    "choicePublicKeyLabel": "Comparto la Clave Pública con otros para que puedan enviarme XLM.",
    "choicePublicKeyHint": "¡Exacto! La Clave Pública es como un número de cuenta bancaria – puedes compartirla públicamente. ✓",
    "choiceSecretShareLabel": "Le doy mi Clave Secreta a alguien de confianza.",
    "choiceSecretShareHint": "¡Cuidado! NADIE debe conocer la Clave Secreta – ni siquiera Stellar o Lumio. Da acceso completo a tu cuenta.",
    "choiceSameLabel": "Ambas claves son en realidad lo mismo.",
    "choiceSameHint": "Eso no es correcto. La Clave Pública y la Secreta forman un par, pero tienen roles completamente diferentes.",
    "createTitle": "Paso 2 – Tu primer Par de Claves",
    "createDialog": "¡Genial! Ahora vamos a crear nuestra cuenta de prueba compartida. ¡Presiona el botón – yo vigilaré!",
    "createActionLabel": "Generar Par de Claves",
    "createActionDesc": "Crea una Clave Pública y una Clave Secreta aleatorias para la Testnet de Stellar. ¡Solo para fines de práctica!",
    "warningDialog1": "¡Vaya, ya tenemos un par de claves! Anota la Clave Secreta en algún lugar, ¡pero nunca la muestres a nadie!",
    "warningDialog2": "En la red real recomendaría escribirla en papel y guardarla en un lugar seguro.",
    "activateTitle": "Paso 3 – Activar la Cuenta",
    "activateNarrator": "Una nueva cuenta de Stellar debe activarse primero – necesita al menos 1 XLM como reserva. En la Testnet, el 'Friendbot' nos da XLM de prueba gratis.",
    "friendbotLabel": "Solicitar Friendbot",
    "friendbotDesc": "Envía una solicitud al Friendbot de Stellar, que activa nuestra cuenta de prueba con 10.000 XLM de prueba.",
    "friendbotError": "No se encontró ningún par de claves – por favor genere uno primero.",
    "outroDialog1": "¡Tenemos una cuenta real en la Testnet de Stellar! Ya puedo ver los XLM en la blockchain...",
    "outroDialog2": "¡Aprendiste rápido! En el próximo capítulo enviaremos XLM juntos.",
    "summaryTitle": "La Llegada",
    "summaryLearning1": "Cada cuenta de Stellar consta de una Clave Pública (dirección) y una Clave Secreta (contraseña)",
    "summaryLearning2": "La Clave Secreta nunca debe compartirse",
    "summaryLearning3": "Las cuentas nuevas necesitan al menos 1 XLM de saldo mínimo (reserva base)",
    "summaryLearning4": "El Friendbot activa las cuentas de Testnet de forma gratuita",
    "keypair_warning": "¡Anota tu Clave Secreta ahora! No puede recuperarse. Quien la conozca tendrá acceso completo a tu cuenta.",
    "keypair_confirm": "He anotado mi Clave Secreta y entiendo que no puede recuperarse.",
    "keypair_public_label": "Tu Clave Pública (Dirección)",
    "keypair_secret_label": "Tu Clave Secreta – ¡MANTENLA EN SECRETO!",
    "keypair_copy": "Copiar",
    "keypair_copied": "¡Copiado!",
    "keypair_continue": "He anotado todo – continuar",
    "explorer_title": "Tu cuenta en Stellar Explorer",
    "explorer_desc": "En Stellar Explorer puedes ver públicamente tu cuenta y todas las transacciones – como un extracto bancario, pero visible para todos.",
    "explorer_hint": "Copia la dirección y ábrela manualmente en tu navegador.",
    "explorer_url_label": "URL del Explorer",
    "explorer_copy_url": "Copiar URL",
    "explorer_open": "Ver en el explorador",
    "explorer_confirm_title": "Enlace externo",
    "explorer_confirm_text": "Serás redirigido a {{explorer}}. Se abrirá una nueva pestaña.",
    "explorer_confirm_cancel": "Cancelar",
    "explorer_confirm_ok": "Abrir",
    "summaryLearning4a": "En la Testnet, Friendbot activa cuentas gratis con XLM de prueba",
    "summaryLearning4b": "En la red real (Mainnet), otra cuenta debe enviar al menos 1 XLM para activar tu cuenta – ¡Friendbot no existe allí!",
    "title": "Crear cuenta",
    "explorer_after_fund": "Después de activar la cuenta podrás verla en el Explorer",
    "q1_question": "¿Qué haces con tu [[Public Key|publicKey]]?"
  },
  "chapter2": {
    "title": "La primera transacción de Lumio",
    "section_tx": "Paso 1 – ¿Qué es una transacción?",
    "section_memo": "Paso 2 – El campo Memo",
    "section_action": "Paso 3 – Enviar pago",
    "narrator_intro": "Lumio ahora tiene una cuenta con XLM de prueba. Pero tener dinero no es suficiente – también hay que poder enviarlo. ¿Cómo funciona eso en Stellar?",
    "lumio_1a": "¡Quiero enviar 10 XLM a mi amigo Cosmo! ¿Pero cómo funciona eso?",
    "lumio_1b": "He oído que existe algo llamado transacción... ¿qué es exactamente?",
    "narrator_tx": "Una transacción en Stellar es una instrucción a la red: envía X XLM de la cuenta A a la cuenta B. La red verifica el saldo, deduce una pequeña tarifa y escribe todo en el ledger.",
    "choice1_a": "Paga los nodos de la red y previene transacciones spam.",
    "choice1_b": "Va directamente a la Stellar Development Foundation como ganancia.",
    "choice1_c": "Es opcional – se puede omitir.",
    "choice1_a_hint": "¡Exacto! La tarifa base es muy pequeña (0.00001 XLM) pero importante para la seguridad de la red.",
    "choice1_b_hint": "Incorrecto – las tarifas se queman, no se recolectan.",
    "choice1_c_hint": "Incorrecto – sin tarifa la transacción será rechazada.",
    "lumio_2": "¿Y qué es este campo Memo que veo en algunas carteras?",
    "narrator_memo": "El campo Memo es un comentario opcional en la transacción – máximo 28 caracteres. Los exchanges lo usan para identificar al remitente. ¡Sin el Memo correcto tu dinero puede perderse!",
    "choice2_a": "Siempre – sin Memo la transacción será rechazada.",
    "choice2_b": "Cuando envío a un exchange que requiere un Memo.",
    "choice2_c": "Nunca – el campo Memo está obsoleto y ya no se usa.",
    "choice2_a_hint": "No siempre – entre carteras normales el Memo es opcional.",
    "choice2_b_hint": "¡Correcto! En los exchanges el Memo identifica tu cuenta.",
    "choice2_c_hint": "Incorrecto – Memo está activo y es esencial para depósitos en exchanges.",
    "lumio_3": "¡Ok, creo que lo entiendo! ¡Probemos una transacción real!",
    "action_label": "Enviar 10 XLM a Cosmo",
    "action_desc": "Envía 10 XLM de prueba a la cuenta Testnet de Cosmo con Memo 'Hallo Cosmo'. Después verás el hash de la transacción en la blockchain.",
    "error_no_keypair": "No se encontró ningún par de claves – por favor completa el Capítulo 1 primero.",
    "lumio_4a": "¡Lo veo! ¡La transacción está en la blockchain! El hash de la transacción es como un número de recibo – cualquiera puede buscar la transacción con él.",
    "lumio_4b": "En el Stellar Explorer puedes ver públicamente cualquier transacción usando el hash.",
    "narrator_hash": "El hash de la transacción es un ID único para cada transacción. Prueba de manera irrefutable que la transacción tuvo lugar.",
    "learning_1": "Una transacción envía XLM de una cuenta a otra",
    "learning_2": "La tarifa base (0.00001 XLM) paga la red y previene spam",
    "learning_3": "El campo Memo es esencial para depósitos en exchanges",
    "learning_4": "Cada transacción tiene un hash único como prueba",
    "q1_question": "¿Para qué sirve la [[Base Fee|base_fee]] en una transacción de Stellar?",
    "q2_question": "¿Cuándo necesitas el campo [[Memo|memo]]?",
    "preset_cosmo": "Cosmo (Testnet)"
  },
  "ui": {
    "tap_to_continue": "Toca para continuar",
    "testnet_badge": "Testnet – sin tokens reales",
    "retry_hint": "¡Inténtalo de nuevo!",
    "learn_more": "Saber más",
    "glossary_title": "Glosario",
    "glossary_not_found": "Término no encontrado.",
    "glossary_hint": "Puedes saber más sobre esto en el glosario.",
    "continue": "Continuar",
    "tx_success": "¡Transacción exitosa!",
    "tx_hash_label": "Hash de transacción",
    "open_in_explorer": "Ver en Explorer ↗",
    "hash_copied": "¡Copiado!",
    "copy_hash": "Copiar hash",
    "explorer_confirm_title": "Enlace externo",
    "explorer_confirm_text": "Se abrirá una nueva pestaña.",
    "explorer_confirm_cancel": "Cancelar",
    "explorer_confirm_ok": "Abrir"
  },
  "placeholder": {
    "chapter_label": "Capítulo",
    "wip_title": "En construcción",
    "wip_text": "Este capítulo aún está en construcción. Lumio trabaja duro en ello – ¡vuelve pronto!",
    "back_to_start": "Volver al Capítulo 1",
    "to_chapter_select": "Ir a selección de capítulos",
    "wip_hint": "El capítulo {{next}} también está en construcción – pero ya puedes echar un vistazo.",
    "next_chapter": "Continuar al capítulo {{n}} →"
  },
  "chapter3": {
    "title": "El comerciante"
  },
  "chapter4": {
    "title": "El villano"
  },
  "chapter5": {
    "title": "La misión de Lumio"
  },
  "hud": {
    "chapter_short": "Cap."
  },
  "action": {
    "already_done": "Ya completado",
    "continue_with_existing": "Continuar",
    "redo": "¿Ejecutar de nuevo?",
    "redo_keypair_warning": "Atención: Un nuevo keypair sobreescribirá el antiguo. Tu cuenta Testnet actual se perderá.",
    "redo_cancel": "Cancelar",
    "redo_confirm": "Crear nuevo de todas formas"
  },
  "payment": {
    "title": "Enviar pago",
    "from_label": "De (tu cuenta)",
    "to_label": "Para (destinatario)",
    "to_placeholder": "G... (introducir Public Key)",
    "amount_label": "Importe (XLM)",
    "memo_label": "Memo (opcional)",
    "memo_hint": "Consejo: Los exchanges a menudo requieren un Memo para identificación",
    "error_secret_key": "¡Eso es un Secret Key! Un Secret Key nunca es una dirección de destinatario. Nunca introduzcas tu Secret Key en ningún lugar.",
    "error_invalid_key": "No es un Public Key de Stellar válido. Los Public Keys comienzan con 'G' y tienen 56 caracteres.",
    "error_own_key": "Ese es tu propio Public Key. No puedes enviarte un pago a ti mismo.",
    "cancel": "Cancelar",
    "send": "Enviar"
  }
}