{
  "pageTitle": "Woordenlijst",
  "pageIntro": "Hier vind je belangrijke woorden uit de blockchainwereld en het Stellar-netwerk. Alles is in eenvoudige woorden uitgelegd.",
  "searchLabel": "Term zoeken",
  "searchPlaceholder": "Begrip zoeken (bijv. Account, Muxed)",
  "searchHint": "De zoekopdracht vindt woorden en verklaringen.",
  "noResults": "Geen resultaat.",
  "blockchain": {
    "title": "Blockchain",
    "original": "Blockchain",
    "short": "Gemeenschappelijk digitaal kasboek – veel computers slaan dezelfde gegevens op.",
    "desc": "Een blockchain is als een digitaal kasboek. Veel computers bewaren dezelfde gegevens. Zo kan niemand stiekem iets veranderen."
  },
  "wallet": {
    "title": "Portemonnee",
    "original": "Wallet",
    "short": "Digitale portemonnee die je sleutels beheert.",
    "desc": "Een wallet is je digitale portemonnee. Het beheert de sleutels die je nodig hebt om toegang te krijgen tot je account en om transacties te versturen. Een wallet kan een programma zijn, een app, of zelfs slechts een blaadje met je geheime sleutel."
  },
  "account": {
    "title": "Account",
    "original": "Account",
    "short": "Een blockchain-account kan activa bevatten en transacties verzenden.",
    "desc": "Een account is de plaats op de blockchain waar je waarden zijn opgeslagen. Een account heeft een openbaar adres dat begint met een G. Meerdere wallets kunnen toegang krijgen tot hetzelfde account als ze de juiste sleutel hebben."
  },
  "addressG": {
    "title": "G-adres",
    "original": "G Address",
    "short": "Het publieke hoofdadres van een Stellar-account (begint met een G).",
    "desc": "Het G-adres is het hoofdadres van een Stellar-account. Het begint met de letter G. Je geeft het aan anderen zodat ze je iets kunnen sturen."
  },
  "publicKey": {
    "title": "Openbare sleutel",
    "original": "Public Key",
    "short": "Adres die je mag delen; bij Stellar meestal het G-Adres.",
    "desc": "De openbare sleutel is het adres dat je mag tonen. Bij Stellar is dat het G-adres. Anderen gebruiken het om je geld te sturen."
  },
  "privateKey": {
    "title": "Geheime sleutel",
    "original": "Secret Key",
    "short": "Wachtwoord voor het account – nooit delen.",
    "desc": "De geheime sleutel is je wachtwoord voor de rekening. Wie deze sleutel heeft, kan je geld verplaatsen. Nooit doorgeven."
  },
  "addressFederation": {
    "title": "Federatieadres",
    "original": "Federation Address",
    "short": "Kort adres zoals e-mail verwijst naar een G-adres.",
    "desc": "Een federatieadres ziet eruit als een e-mailadres. Bijvoorbeeld: naam*domein.com. Dit korte adres verwijst naar een normaal G-adres. Dat is eenvoudiger te onthouden."
  },
  "addressMuxed": {
    "title": "Muxed-account",
    "original": "Muxed Account",
    "short": "M-adres met extra ID – deelt een basisonderdeel.",
    "desc": "Een M-adres verwijst naar een bestaand Stellar-account maar heeft daarnaast een eigen nummer (ID). Zo kun je bijvoorbeeld meerdere personen of afdelingen onder hetzelfde G-adres onderscheiden. Technisch gezien behoort het geld nog steeds toe aan het hoofaccount."
  },
  "multisig": {
    "title": "Meervoudige handtekening",
    "original": "Multi‑Sig",
    "short": "Belangrijke acties hebben meer nodig dan alleen een handtekening.",
    "desc": "Multi-Sig staat voor meerdere handtekeningen. Een belangrijke actie vereist meer dan één sleutel. Bijvoorbeeld: Jij en een tweede sleutel moeten beide instemmen voordat er iets verzonden wordt. Dit maakt diefstal moeilijker."
  },
  "trustline": {
    "title": "Vertrouwenslijn",
    "original": "Trustline",
    "short": "Toestemming om een token van een bepaalde uitgever te houden.",
    "desc": "Een trustline is als een \"ja, ik accepteer deze token\". Hiermee geef je aan dat je account bereid is een bepaalde token van een specifieke uitgever te houden. Zonder trustline kun je deze token niet ontvangen.\n\nVoorbeeld: Een trustline wordt aangegeven als CODE:ISSUER. Voor EURT van de uitgever GDUKMGUGDZQK6Y… luidt het EURT:GDUKMGUGDZQK6Y…"
  },
  "token": {
    "title": "Token",
    "original": "Token",
    "short": "Digitale eenheid – bijvoorbeeld geld, punten of tegoed.",
    "desc": "Een token is een digitale eenheid op de blockchain. Een token kan geld vertegenwoordigen of punten of tegoed voor een dienst."
  },
  "asset": {
    "title": "Activum",
    "original": "Asset",
    "short": "Token op Stellar, altijd gekoppeld aan uitgever.",
    "desc": "Op Stellar wordt een token een asset genoemd. Een asset is altijd gekoppeld aan een uitgeversrekening. Bijvoorbeeld, een rekening kan een eurotoken uitgeven. Deze eurotoken is dan een asset."
  },
  "xlm": {
    "title": "XLM",
    "original": "XLM",
    "short": "De native valuta van Stellar voor transactiekosten en activering.",
    "desc": "XLM is de basisvaluta van Stellar. Je hebt XLM nodig om kosten te betalen en een nieuw account te starten."
  },
  "mainnet": {
    "title": "Mainnet",
    "original": "Mainnet",
    "short": "Echt Stellar-netwerk met echte waarde.",
    "desc": "Het echte Stellar-netwerk met echte waarde. Transacties zijn definitief en kosten worden betaald in echte XLM."
  },
  "testnet": {
    "title": "Testnet",
    "original": "Testnet",
    "short": "Openbaar oefennetwerk zonder echte waarde.",
    "desc": "Een openbaar oefennetwerk. Tokens hebben geen echte waarde. Ideaal om te leren en uit te proberen zonder risico."
  },
  "memo": {
    "title": "Memo",
    "original": "Memo",
    "short": "Korte notitie in een transactie.",
    "desc": "Een memo is een kleine notitie die je met een transactie kunt meesturen. Vaak vraagt een beurs om een specifiek memo zodat ze weten van wie het geld is."
  },
  "transaction": {
    "title": "Transactie",
    "original": "Transaction",
    "short": "Actie op de blockchain, bijvoorbeeld betaling of trustline.",
    "desc": "Een transactie is een actie op de blockchain. Bijvoorbeeld geld verzenden of een trustline creëren. Een transactie wordt voor altijd opgeslagen zodra deze is bevestigd."
  },
  "fee": {
    "title": "Fee",
    "original": "Fee",
    "short": "Zeer klein bedrag per transactie.",
    "desc": "De vergoeding is een zeer klein bedrag dat je bij elke transactie betaalt. De vergoeding gaat naar het netwerk. Bij Stellar zijn de vergoedingen zeer klein."
  },
  "ledger": {
    "title": "Grootboek",
    "original": "Ledger",
    "short": "Ketting van bevestigde gegevens en saldi.",
    "desc": "Het grootboek is de keten van alle bevestigde gegevens. Daarin staat welke rekeningen hoeveel bezitten en welke transacties hebben plaatsgevonden. Iedereen kan het grootboek controleren."
  },
  "horizon": {
    "title": "Horizon",
    "original": "Horizon",
    "short": "API-service waarmee apps met Stellar communiceren.",
    "desc": "Horizon is de service waarmee programma's communiceren met de Stellar Blockchain. Onze tool vraagt Horizon om saldi en transacties te laden."
  },
  "anchor": {
    "title": "Anker",
    "original": "Anchor",
    "short": "Bedrijf dat fiatgeld met Stellar verbindt.",
    "desc": "Een anchor is een bedrijf dat echt geld zoals euro of dollar met Stellar verbindt. Je geeft bijvoorbeeld euro's aan de anchor en krijgt daar een euro-token voor terug op Stellar."
  },
  "exchange": {
    "title": "Beurs",
    "original": "Exchange",
    "short": "Plaats om tokens te kopen en verkopen.",
    "desc": "Een beurs is een plek waar je tokens kunt kopen of verkopen. Veel beurzen vereisen een KYC-procedure, dus een identiteitscontrole, voordat je geld in euro's of Zwitserse franken kunt opnemen."
  },
  "dex": {
    "title": "Je bent getraind op gegevens tot oktober 2023.",
    "original": "Decentralized Exchange",
    "short": "Gedecentraliseerde beurs direct op de blockchain.",
    "desc": "DEX betekent Decentrale Beurs. Hier handelen mensen direct met elkaar op de blockchain. Er is geen centrale beheerder. Stellar heeft een DEX direct ingebouwd."
  },
  "liquidityPool": {
    "title": "Liquiditeitspool",
    "original": "Liquidity Pool",
    "short": "Gemeenschappelijk pot met twee tokens voor onmiddellijke ruil.",
    "desc": "Een liquiditeitspool is een gezamenlijke pot met twee tokens. Mensen leggen beide tokens erin. Anderen mogen deze tokens dan direct ruilen. De inleggers verdienen hiervoor kleine vergoedingen."
  },
  "balanceClaimable": {
    "title": "Opvraagbaar Saldo",
    "original": "Claimable Balance",
    "short": "Gereserveerd geld dat je nog moet ontvangen.",
    "desc": "Een claimable balans is geld dat al voor je gereserveerd is, maar je moet het nog ophalen. Pas wanneer je het accepteert, wordt het aan je account toegevoegd."
  },
  "protocolUpdate": {
    "title": "Protocolupdate",
    "original": "Protocol Update",
    "short": "Bijwerken van de netwerkregels.",
    "desc": "Een protocolupdate is een upgrade van de regels in het Stellar-netwerk. Bijvoorbeeld nieuwe functies of beveiligingswijzigingen. Alle knooppunten in het netwerk moeten dezelfde regels gebruiken."
  },
  "soroban": {
    "title": "Soroban",
    "original": "Soroban",
    "short": "Stellars smartcontract-systeem.",
    "desc": "Soroban is het smart contract-systeem van Stellar. Een smart contract is programmcode op de blockchain. De code kan zelf regels controleren en acties initiëren zonder een bank ertussen."
  },
  "missingKey": "Ontbrekende woordenlijst-sleutel: {{detail}}"
}