{
  "pageTitle": "Woordenlijst",
  "pageIntro": "Hier vind je belangrijke termen uit de blockchainwereld en het Stellar-netwerk. Alles wordt in eenvoudige woorden uitgelegd.",
  "searchLabel": "Zoekterm",
  "searchPlaceholder": "Zoekterm (z. B. Konto, Account, Muxed)",
  "searchHint": "De zoekopdracht vindt woorden en verklaringen.",
  "noResults": "Geen overeenkomst.",
  "groups": {
    "accountsKeys": "Accounts & Sleutels",
    "multisigSecurity": "Multisig & Accountbeveiliging",
    "walletsCustody": "Wallets & Bewaring",
    "tokensAssets": "Token & Activa",
    "transactionsFees": "Transacties & Kosten",
    "marketsTrading": "Markten & Handel",
    "networkProtocol": "Netwerk & Protocol",
    "smartContracts": "Slimme contracten",
    "blockchainBasics": "Basisprincipes van blockchain",
    "security": "Beveiliging & Fraude",
    "moneyFinance": "Geld & Financiën",
    "cryptography": "Cryptografie",
    "defi": "DeFi",
    "onrampOfframp": "Onramp / Offramp"
  },
  "blockchain": {
    "title": "Blockchain",
    "original": "Blockchain",
    "short": "Gedeeld digitaal grootboek – veel computers slaan dezelfde invoeringen op.",
    "desc": "Een blockchain is als een digitaal grootboek. Veel computers slaan dezelfde gegevens op, waardoor niemand stiekem wijzigingen kan aanbrengen."
  },
  "wallet": {
    "title": "Portemonnee",
    "original": "Wallet",
    "short": "Digitale portemonnee die je sleutels beheert.",
    "desc": "Een portemonnee is je digitale beurs. Het beheert de sleutels die je nodig hebt om toegang te krijgen tot je account en transacties te verzenden. Een portemonnee kan een programma zijn, een app, of zelfs gewoon een stuk papier met je privésleutel."
  },
  "account": {
    "title": "Account",
    "original": "Account",
    "short": "Een blockchain-account kan activa vasthouden en transacties verzenden.",
    "desc": "Een account is de locatie op de blockchain waar je activa worden bewaard. Een account heeft een openbaar adres dat begint met een G. Meerdere wallets kunnen toegang krijgen tot hetzelfde account als ze de juiste sleutel hebben."
  },
  "addressG": {
    "title": "G-adres",
    "original": "G Address",
    "short": "Het publieke primaire adres van een Stellar-account (beginnt mit G).",
    "desc": "Het G-adres is het hoofdadres van een Stellar-account. Het begint met de letter G. Je geeft het aan anderen zodat ze je iets kunnen sturen."
  },
  "publicKey": {
    "title": "Openbare sleutel",
    "original": "Public Key",
    "short": "Adresse, die du teilen darfst; bei Stellar meist die G‑Adresse.",
    "desc": "De openbare sleutel is het adres dat je mag delen. In Stellar is dit het G-adres. Anderen gebruiken het om je geld te sturen."
  },
  "privateKey": {
    "title": "Geheime sleutel",
    "original": "Secret Key",
    "short": "Wachtwoord voor het account – deel het nooit.",
    "desc": "De geheime sleutel is je wachtwoord voor de account. Wie deze sleutel heeft, kan je geld verplaatsen. Deel het nooit."
  },
  "addressFederation": {
    "title": "Federatieadres",
    "original": "Federation Address",
    "short": "Kurze Adresse wie E‑Mail, zeigt auf eine G‑Adresse.",
    "desc": "Een federatieadres ziet eruit als een e-mailadres. Voorbeeld: naam*domein.com. Dit korte adres verwijst naar een regulier G-adres. Het is gemakkelijker te onthouden."
  },
  "addressMuxed": {
    "title": "Gemengd account",
    "original": "Muxed Account",
    "short": "M‑address with additional ID – shares a base account.",
    "desc": "Een M-adres wijst naar een bestaande Stellar-rekening maar heeft een extra nummer (ID).\n\nMuxed Accounts = G-account + ID (M-Adresse)\nZe bieden associatie, maar geen scheiding van accounts.\nSaldo, kredietlijnen, ondertekenaars en vlaggen zijn altijd op het G-account.\n\nStellar Development Foundation\n\nBijvoorbeeld, meerdere individuen of afdelingen kunnen onder hetzelfde G-adres worden onderscheiden. Technisch gezien behoort het geld nog steeds tot de hoofdaccount."
  },
  "muxedAccountsUseCases": {
    "title": "Toepassingsgevallen voor gemengde accounts",
    "original": "Muxed accounts use cases",
    "short": "Voorbeelden, voordelen en beperkingen van M-adressen als hulpmiddel bij het in kaart brengen.",
    "desc": "Bedrijf - Voorbeeld\n\nInstallatie:\n- Een bedrijfs-G-account\n- Eén M-adres per klant/gebruiksdoel (ID)\n\nProces:\n- Klant betaalt naar hun M-adres\n- Alles gaat naar het bedrijfs-G-account\n- Boekhouding leest de ID -> unieke toewijzing\n\nGeschikt voor:\n- Winkels, betalingsproviders, beurzen\n- Interne referenties zonder memo-risico's\n\nVereniging - Voorbeeld\n\nInstallatie:\n- Een verenigings-G-account\n- M-adressen voor leden, afdelingen, doeleinden\n\nProces:\n- Bijdrage/donatie naar het juiste M-adres\n- Toewijzing via ID, geen memo-fouten\n\nGeschikt voor:\n- Lidmaatschapsgelden\n- Gelabelde inkomsten\n- Eenvoudige controle\n\nWaarin Muxed Accounts uitblinken:\n- Robuuste invoertoewijzing\n- Eén account, vele identiteiten\n- Geen memo-vereiste\n- Minder operationele fouten\n\nWat Muxed Accounts niet zijn:\n- Geen subaccounts\n- Geen individuele balans\n- Geen individuele trustlijnen\n- Geen individuele ondertekenaars/rechten\n\nMeestal ongeschikte gebruiksscenario's:\n- Salarisbetalingen/loonadministratie-accounts (benoetigen eigenes G-Konto)\n- Trust/Escrow voor derden (kein rechtlicher Vermoegenstrenner)\n- Op rollen gebaseerde beveiliging (keine getrennten Signer/Thresholds)\n- Begrotings- of limietscheiding (keine separaten Salden/Asset-Limits)\n- Naleving-gescheiden accounts (KYC/Reporting nicht sauber trennbar)\n\nVergelijking (Kurz):\nToewijzing van betalingen: Ja\nScheiding van activa: Nee\nToegang delegeren: Nee\nJuridisch gescheiden account: Nee\nInterne boekhouding: Ja\n\nBelangrijk om te onthouden:\nMuxed Accounts richten zich op betalingen - ze vervangen geen accounts.\nAls controle, eigendom of scheiding nodig is -> eigen G-account."
  },
  "multisig": {
    "title": "Multihandtekening",
    "original": "Multi‑Sig",
    "short": "Belangrijke acties vereisen meer dan alleen een handtekening.",
    "desc": "Multi-Sig staat voor meerdere handtekeningen. Een belangrijke actie vereist meer dan één sleutel. Voorbeeld: Jij en een tweede sleutel moeten beide instemmen voordat iets wordt verzonden. Dit maakt diefstal moeilijker.",
    "help": {
      "title": "Algemene uitleg van een multisignature (Multi-Signature) bedrijfsrekening",
      "intro": "Een bedrijf kan gebruikmaken van een gedeelde blockchain-account waarin meerdere bevoegde personen betrokken zijn. Typisch zijn er ten minste drie ondertekenaars (Signer) opgenomen, bijvoorbeeld het management, de financieel directeur en compliance/backup. Het doel is dat individuele personen zelfstandig betalingen kunnen uitvoeren zonder dat één persoon alleen de account kan controleren of overnemen.",
      "problem": "Als een ondertekenaar (Signer) voldoende gewicht heeft om betalingen uit te voeren en tegelijkertijd voldoende gewicht heeft voor wijzigingen in het account, kan die persoon andere ondertekenaars (Signer) verwijderen of de drempel/weging aanpassen (Thresholds) en zo de controle over het account overnemen. Omgekeerd zou de oorspronkelijke eigenaar ook niet gemakkelijk andere ondertekenaars (Signer) moeten kunnen uitsluiten zonder controles en balansen. Een multi-handtekeningstructuur zorgt ervoor dat belangrijke beslissingen altijd collectief door meerdere mensen worden genomen.",
      "setupTitle": "Voorbeeld van een veilige multi-handtekeningstructuur met drie ondertekenaars.",
      "setupWeights": "In een voorbeeld met drie gelijke rollen, ontvangen allen dezelfde ondertekeningssterkte:\n- Ondertekenaar (Signer) A (Management): Gewicht 2\n- Ondertekenaar (Signer) B (Finanzen): Gewicht 2\n- Ondertekenaar (Signer) C (Compliance/Backup): Gewicht 2",
      "setupThresholds": "Geschikte drempels/gewichten zijn als volgt ingesteld:\n- Laag (low_threshold): 1\n- Medium (med_threshold): 2 (for payments and other medium actions)\n- Hoog (high_threshold): 4 (voor structurele wijzigingen zoals het toevoegen/verwijderen van ondertekenaars (Signer) of het wijzigen van de drempel/gewicht (Thresholds))\n\nDit zorgt ervoor dat elke bevoegde persoon betalingen kan uitvoeren, maar dat geen enkele persoon alleen de accountstructuur kan wijzigen.",
      "behavior": "Met deze configuratie kunnen betalingen door elk van de drie bevoegde personen alleen worden uitgevoerd, omdat het gewicht van elk individu aan de middelhoge drempel voldoet. Voor structurele wijzigingen, zoals het verwijderen van een ondertekenaar, het aanpassen van de drempels/gewichten of het samenvoegen of sluiten van de rekening, is de hoge drempel vereist. Deze waarde kan alleen worden bereikt wanneer ten minste twee van de drie ondertekenaars samen ondertekenen. Deze opstelling houdt de rekening flexibel voor dagelijks gebruik en biedt tegelijkertijd sterke bescherming tegen misbruik.",
      "removal": "Wenn eine Person das Unternehmen verlässt oder nicht mehr vertrauenswürdig ist, können zwei der verbleibenden Unterzeichner (Signer) gemeinsam die Signaturrechte dieser Person entfernen. Kein einzelner Unterzeichner (Signer) – weder ein Mitarbeiter noch die Geschäftsführung – kann andere eigenständig aus dem Konto ausschließen. Der Entzug von Berechtigungen erfolgt also immer kontrolliert und nachvollziehbar durch mindestens zwei Verantwortliche.",
      "summary": "Dit type multisig-structuur stelt individuele partijen in staat om efficiënt betalingen te verwerken terwijl de controle over de rekening behouden blijft onder meerdere deelnemers. Het vermindert het risico op accountovernames, beschermt tegen unilaterale beslissingen, en is bijzonder geschikt voor zakelijke rekeningen waar zowel veiligheid als operationele flexibiliteit belangrijk zijn.",
      "closeLabel": "Dichtbij",
      "linkLabel": "Wat betekent Multi-Signature?",
      "glossaryLinkLabel": "Bekijk in woordenlijst"
    }
  },
  "multisigCorporate": {
    "title": "Multisignatuur - Voorbeeld",
    "original": "Multi-Signature - Example",
    "short": "Voorbeeld van een multi-handtekeningstructuur voor bedrijfsrekeningen met rollen, gewichten en drempels.",
    "desc": "Voorbeeld: Een bedrijf stelt een Stellar-account in met drie ondertekenaars: CEO (gewicht 2), CFO (gewicht 2) en een bestuurslid (gewicht 1). De drempels worden zo geconfigureerd dat bewerkingen met lage beveiliging gewicht 1 vereisen, gemiddelde bewerkingen (bijv. betalingen) gewicht 3 en hoge bewerkingen (bijv. wijzigen van ondertekenaars) gewicht 4. Dit betekent dat de CEO het account alleen kan bekijken, maar moet samenwerken met de CFO of beide andere ondertekenaars voor betalingen en configuratiewijzigingen."
  },
  "trustline": {
    "title": "Trustline",
    "original": "Trustline",
    "short": "Overeenkomst om een token van een specifieke uitgever te houden.",
    "desc": "Een trustline is als een \"Ja, ik accepteer deze token.\" Door deze in te stellen, geef je aan dat je account klaar is om een specifieke token van een specifieke uitgever te ontvangen. Zonder een trustline kun je deze token niet ontvangen.\n\nVoorbeeld: Een trustline wordt gespecificeerd als CODE:ISSUER. Voor EURT van de uitgever GDUKMGUGDZQK6Y… zou het zijn EURT:GDUKMGUGDZQK6Y…"
  },
  "token": {
    "title": "Token",
    "original": "Token",
    "short": "Digitale eenheid – bijvoorbeeld geld, punten of tegoeden.",
    "desc": "Een token is een digitale eenheid op de blockchain. Een token kan geld, punten of kredieten voor een dienst vertegenwoordigen."
  },
  "asset": {
    "title": "Asset",
    "original": "Asset",
    "short": "Elk digitaal activum op een blockchain – van cryptovaluta's tot tokens en stablecoins.",
    "desc": "Een asset is in de breedste zin alles wat waarde vertegenwoordigt en overdraagbaar is. Op Stellar kan iedereen een asset uitgeven – bijv. een luchtvaartmaatschappij haar miles als token, een bank haar dollar als stablecoin. Elk Stellar-asset wordt gedefinieerd door twee dingen: de assetcode (bijv. 'USDC') en de uitgever (het G-adres van de maker). XLM is het enige asset zonder uitgever, omdat het het native asset van het netwerk is."
  },
  "xlm": {
    "title": "Je suis een taalmodel getraind op gegevens tot en met oktober 2023.",
    "original": "XLM",
    "short": "Inheemse valuta van Stellar voor kosten en activatie.",
    "desc": "XLM is de native valuta van Stellar. Je hebt XLM nodig om kosten te betalen en om een nieuw account te starten."
  },
  "mainnet": {
    "title": "Mainnet",
    "original": "Mainnet",
    "short": "Echtes Stellar‑Netzwerk mit realem Wert.",
    "desc": "Het echte Stellar-netwerk met daadwerkelijke waarde. Transacties zijn definitief en kosten worden betaald in echte XLM."
  },
  "testnet": {
    "title": "Testnet",
    "original": "Testnet",
    "short": "Openbaar trainingsnetwerk zonder echte waarde.",
    "desc": "Een openbaar praktijknetwerk. Tokens hebben geen werkelijke waarde. Ideaal om te leren en experimenteren zonder risico."
  },
  "memo": {
    "title": "Memo",
    "original": "Memo",
    "short": "Korte notitie in een transactie.",
    "desc": "Een memo is een kleine notitie die je kunt meesturen met een transactie. Vaak vereist een beurs een specifiek memo om te weten aan wie het geld toebehoort."
  },
  "transaction": {
    "title": "Transactie",
    "original": "Transaction",
    "short": "Actie op de blockchain, bijvoorbeeld betaling of vertrouwenlijn.",
    "desc": "Een transactie is een actie op de blockchain, zoals het verzenden van geld of het opzetten van een vertrouwenslijn. Zodra deze is bevestigd, wordt een transactie permanent vastgelegd."
  },
  "fee": {
    "title": "Kosten",
    "original": "Fee",
    "short": "Zeer klein bedrag per transactie.",
    "desc": "De vergoeding is een zeer klein bedrag dat je bij elke transactie betaalt. De vergoeding gaat naar het netwerk. Op Stellar zijn de vergoedingen erg laag."
  },
  "operations": {
    "title": "Operatie",
    "original": "Operation",
    "short": "De kleinste eenheid van een Stellar-transactie – een transactie kan tot 100 operaties bevatten.",
    "desc": "Op Stellar is een transactie een container met één of meer operaties. Een operatie is één actie – bijvoorbeeld een betaling versturen, een trustline maken of een aanbod plaatsen. Tot 100 operaties kunnen in één transactie worden gebundeld, wat heel efficiënt is. De transactiekosten worden berekend op basis van het aantal operaties (standaard: 100 stroops per operatie)."
  },
  "pathPayment": {
    "title": "Padbetaling",
    "original": "Path Payment",
    "short": "Een betaling waarbij Stellar automatisch één of meerdere valutaconversies uitvoert om het doel-asset te leveren.",
    "desc": "Met padbetalingen kun je bijvoorbeeld XLM sturen en ontvangt de ontvanger automatisch USDC – Stellar vindt het beste omwisselpad via de gedecentraliseerde markt. Het netwerk zoekt beschikbare handelsparen en liquiditeitspools om het goedkoopste pad te vinden. Dit is vooral handig voor grensoverschrijdende betalingen: de zender betaalt in zijn valuta, de ontvanger krijgt de zijne. Alles in één transactie."
  },
  "clawback": {
    "title": "Terugvordering",
    "original": "Clawback",
    "short": "Optionele Stellar-functie waarmee een asset-uitgever uitgegeven tokens kan terughalen van een account.",
    "desc": "Clawback is een speciale functie op Stellar die aan regelgeving kan voldoen. Als een uitgever clawback activeert bij het aanmaken van een asset, kan hij tokens van elk account terughalen – bijvoorbeeld bij fraude, witwassen of wettelijke eisen. Voor gereguleerde financiële producten zoals security tokens is dit vaak wettelijk verplicht. Gewone gebruikers hoeven zich geen zorgen te maken zolang ze met betrouwbare uitgevers werken."
  },
  "sponsor": {
    "title": "Sponsoring",
    "original": "Sponsoring",
    "short": "Stellar-functie waarbij één account de basisreserve voor een ander account betaalt.",
    "desc": "Op Stellar heeft elk account en elke entry (trustline, data-entry, enz.) een minimumsaldo in XLM nodig (base reserve). Met sponsoring kan één account die reserve voor een ander betalen. Handig voor apps die nieuwe gebruikers willen onboarden zonder dat ze eerst XLM hoeven te kopen. Voorbeeld: een app sponsort accountcreatie en trustlines voor nieuwe gebruikers – zo kunnen ze direct starten zonder XLM."
  },
  "ledger": {
    "title": "Grootboek",
    "original": "Ledger",
    "short": "Keten van bevestigde gegevens en saldi.",
    "desc": "Het grootboek is de keten van alle bevestigde gegevens. Het toont welke accounts hoeveel bevatten en welke transacties hebben plaatsgevonden. Iedereen kan het grootboek controleren."
  },
  "horizon": {
    "title": "Horizon",
    "original": "Horizon",
    "short": "API‑Dienst, über den Apps mit Stellar sprechen.",
    "desc": "Horizon is de dienst waarmee programma's communiceren met de Stellar-blockchain. Onze tool raadpleegt Horizon om rekeningoverzichten en transacties te laden."
  },
  "horizonHistory": {
    "title": "Horizon Geschiedenis",
    "original": "Horizon history depth",
    "short": "Beschrijft hoever terug de transactiegeschiedenis van openbare Horizon-servers reikt.",
    "desc": "De publieke Horizon-servers (Mainnet und Testnet) die worden beheerd door de Stellar Development Foundation bieden slechts een beperkte geschiedenis – momenteel ongeveer één jaar terugwerkend. Oudere gegevens kunnen niet meer worden opgevraagd via deze gratis eindpunten. Als je verder terug in de tijd moet gaan, heb je eigenlijk twee opties: (1) je kunt je eigen Horizon-node met volledige geschiedenis (inklusive History Archives) draaien, of (2) je kunt gebruikmaken van externe of betaalde diensten die langetermijngeschiedenis van Stellar-gegevens opslaan en verschaffen.",
    "seeAlso": "U hebt geen specifieke tekst om te vertalen verstrekt. Voer alstublieft de tekst in die u vertaald wilt hebben."
  },
  "scp": {
    "title": "Stellar Consensus Protocol",
    "original": "SCP – Stellar Consensus Protocol",
    "short": "Het unieke consensusmechanisme van Stellar dat transacties snel bevestigt zonder mining.",
    "desc": "SCP is het hart van Stellar: het algoritme dat bepaalt hoe deelnemers het eens worden over de ledger‑status. Anders dan Bitcoin (Proof of Work) of Ethereum (Proof of Stake) gebruikt Stellar een federatieve stemming: elke validator vertrouwt een zelfgekozen set validators (quorum set). Daardoor bereikt Stellar consensus in 3–5 seconden zonder energieverspilling door mining. SCP is ontworpen door David Mazières (Stanford) en is bewezen veilig."
  },
  "validator": {
    "title": "Validator",
    "original": "Validator",
    "short": "Een netwerkknooppunt dat transacties controleert en meedoet aan consensus.",
    "desc": "Validators zijn betrouwbare deelnemers die het Stellar‑netwerk draaiende houden. Ze ontvangen transacties, controleren ze en stemmen met andere validators over wat in het volgende ledger komt. Iedereen kan een Stellar‑validator draaien: bedrijven, universiteiten of personen. De Stellar Development Foundation beheert enkele validators, maar is niet de enige autoriteit. Een gedecentraliseerd netwerk van validators maakt Stellar weerbaar tegen storingen en censuur."
  },
  "quorumSet": {
    "title": "Quorum Set",
    "original": "Quorum Set",
    "short": "De set van validators die een node vertrouwt voor consensus.",
    "desc": "In SCP kiest elke validator zelf welke validators hij vertrouwt: dat is zijn quorum set. Consensus ontstaat wanneer quorum sets elkaar overlappen en overeenstemming bereiken. Dit model heet Federated Byzantine Agreement (FBA). Het is flexibeler dan klassieke consensus: er is geen vaste lijst van vertrouwde nodes, maar een organisch groeiend vertrouwensnetwerk. De kwaliteit en decentralisatie van een quorum set beïnvloeden direct de veiligheid van het netwerk."
  },
  "sac": {
    "title": "Stellar Asset Contract",
    "original": "SAC – Stellar Asset Contract",
    "short": "Een Soroban smart contract dat een klassiek Stellar‑asset bruikbaar maakt in smart contracts.",
    "desc": "Met Soroban ontstond een probleem: bestaande Stellar‑assets (zoals USDC of XLM) moesten ook bruikbaar zijn in smart contracts. De Stellar Asset Contract lost dit op: het is een gestandaardiseerde smart‑contract interface voor elk Stellar‑asset. Daardoor kunnen Soroban‑dApps direct native Stellar‑assets gebruiken zonder ze om te zetten naar nieuwe tokens. SAC’s bestaan automatisch voor alle Stellar‑assets en hoeven niet handmatig te worden gemaakt."
  },
  "anchor": {
    "title": "Anker",
    "original": "Anchor",
    "short": "Firma, die Fiat‑Geld mit Stellar verbindet.",
    "desc": "Een anchor is een bedrijf dat echt geld, zoals euro's of dollars, met Stellar verbindt. Bijvoorbeeld, je geeft de anchor euro's en ontvangt daarvoor een euro-token op Stellar."
  },
  "exchange": {
    "title": "Aandelenbeurs",
    "original": "Exchange",
    "short": "Plaats om tokens te kopen en verkopen.",
    "desc": "Een beurs is een plek waar je tokens kunt kopen of verkopen. Veel beurzen vereisen een KYC-proces, wat identiteitsverificatie betekent, voordat je geld in euro's of franken kunt opnemen."
  },
  "dex": {
    "title": "DEX (Decentralized Exchange)",
    "original": "Decentralized Exchange",
    "short": "Gedecentraliseerde uitwisseling direct op de blockchain.",
    "desc": "DEX staat voor Gedecentraliseerde Beurs. Hier handelen mensen direct met elkaar op de blockchain. Er is geen enkele operator. Stellar heeft een DEX die direct erin is ingebouwd."
  },
  "liquidityPool": {
    "title": "Liquiditeitspool",
    "original": "Liquidity Pool",
    "short": "Gemeenschappelijk pool met twee tokens voor directe uitwisseling.",
    "desc": "Een liquiditeitspool is een gedeelde pot met twee tokens. Mensen storten beide tokens erin. Anderen mogen deze tokens vervolgens direct ruilen. De storters verdienen in ruil daarvoor kleine vergoedingen."
  },
  "onramp": {
    "title": "Onramp",
    "original": "Onramp",
    "short": "Een dienst waarmee je crypto kunt kopen met fiatgeld (bijv. euro of Zwitserse frank).",
    "desc": "Een onramp is het instappunt in crypto—de weg van traditioneel geld naar crypto. Veelgebruikte methoden zijn creditcard of bankoverschrijving. Aanbieders zoals Kado of Onramper laten je direct in een app kopen zonder een aparte beurs. Stellar Account Manager integreert onramps zodat je XLM en andere assets met fiat kunt kopen. Onramps vereisen meestal KYC."
  },
  "offramp": {
    "title": "Offramp",
    "original": "Offramp",
    "short": "Een dienst waarmee je crypto terug naar fiat kunt verkopen.",
    "desc": "De offramp is het tegenovergestelde van de onramp—de weg terug naar traditioneel geld. Je verkoopt je crypto‑assets en krijgt euro’s, francs of een andere fiatvaluta op je bankrekening. Op Stellar verzorgen anchors vaak de offramp: zij nemen bijvoorbeeld USDC‑tokens aan en sturen het overeenkomstige fiatbedrag. Offramps vereisen meestal KYC."
  },
  "kyc": {
    "title": "Know Your Customer",
    "original": "KYC / AML – Know Your Customer / Anti-Money Laundering",
    "short": "Wettelijk verplichte identiteitscontrole die financiële diensten vragen voordat je ze gebruikt.",
    "desc": "KYC (Know Your Customer) is een regelgevingsproces waarbij gebruikers hun identiteit bewijzen met documenten en soms een selfie. Het doel is het voorkomen van witwassen (AML), terrorismefinanciering en fraude. Decentrale protocollen zoals de Stellar DEX vereisen geen KYC—je handelt direct vanuit je wallet. Onramp- en offrampdiensten moeten wél KYC uitvoeren omdat ze fiat en crypto verbinden."
  },
  "defi": {
    "title": "Gedecentraliseerde financiën",
    "original": "DeFi – Decentralized Finance",
    "short": "Financiële diensten zoals lenen, handelen en sparen—zonder banken, direct via blockchain‑protocollen.",
    "desc": "DeFi is een verzamelterm voor financiële toepassingen die zonder centrale instellingen zoals banken of beurzen werken. Alles draait automatisch via smart contracts. Gebruikers houden controle over hun eigen geld. Typische DeFi‑toepassingen zijn gedecentraliseerde beurzen (DEX), leenprotocollen en liquiditeitspools. Stellar biedt basis‑DeFi via zijn ingebouwde DEX en AMM‑pools, uitgebreid met Soroban‑smart contracts."
  },
  "yield": {
    "title": "Rendement / Yield",
    "original": "Yield",
    "short": "De opbrengst die je krijgt door kapitaal in DeFi‑protocollen te plaatsen.",
    "desc": "In DeFi betekent yield de opbrengst uit activiteiten zoals liquiditeit leveren, staken of uitlenen. Het rendement wordt vaak als APY (Annual Percentage Yield) getoond. Hoge yields betekenen meestal hogere risico’s. Let op: extreem hoge yields (bijv. 1000% APY) zijn vaak een waarschuwingssignaal."
  },
  "staking": {
    "title": "Staking",
    "original": "Staking",
    "short": "Het vastzetten van crypto in een netwerk om beloningen te krijgen en het netwerk te ondersteunen.",
    "desc": "Bij staking worden coins vastgezet in een proof‑of‑stake netwerk om transacties te valideren en het netwerk te beveiligen. Stakers krijgen nieuwe coins als beloning. Stellar gebruikt geen klassiek staking‑model—XLM‑houders kunnen wel liquiditeit leveren en handelskosten verdienen. Belangrijk: onderscheid echt netwerk‑staking van “staking” bij centrale beurzen, wat vaak spaarproducten zijn."
  },
  "yieldFarming": {
    "title": "Yield Farming",
    "original": "Yield Farming",
    "short": "Actief kapitaal verplaatsen tussen DeFi‑protocollen om maximale opbrengst te halen.",
    "desc": "Yield farmers verplaatsen assets tussen pools en protocollen om de beste opbrengst te oogsten. Het kan aantrekkelijk zijn, maar is complex en riskant: impermanent loss, smart‑contract bugs en plotselinge dalingen in rendement kunnen winst wegvagen. Yield farming is geavanceerd en niet aangeraden voor beginners."
  },
  "dao": {
    "title": "Gedecentraliseerde autonome organisatie",
    "original": "DAO – Decentralized Autonomous Organization",
    "short": "Een organisatie die via smart contracts en token‑stemmen wordt bestuurd zonder centrale leiding.",
    "desc": "Een DAO is een digitale organisatie die wordt bestuurd door code en stemmen van token‑houders. Er is geen CEO of bestuur—besluiten worden genomen via governance‑stemmen. Elke token‑houder kan voorstellen indienen en stemmen. DAOs worden gebruikt voor protocolontwikkeling, treasury‑beheer en regelwijzigingen. Het concept is innovatief, maar kent risico’s zoals lage opkomst of gecoördineerde aanvallen."
  },
  "dapp": {
    "title": "Gedecentraliseerde applicatie",
    "original": "dApp – Decentralized Application",
    "short": "Een app die op een blockchain draait en geen centrale controle heeft.",
    "desc": "Een dApp ziet eruit als een normale app, maar draait op een blockchain in plaats van centrale servers. De code staat in smart contracts—openbaar en niet door één partij te controleren. Voorbeelden: gedecentraliseerde beurzen, lending‑protocollen of NFT‑marktplaatsen. Met Soroban ondersteunt Stellar dApps op zijn netwerk. dApps vereisen meestal een wallet‑koppeling in plaats van een klassiek login."
  },
  "oracle": {
    "title": "Oracle",
    "original": "Oracle",
    "short": "Een dienst die real‑world data (bijv. prijzen, weer) beschikbaar maakt voor smart contracts.",
    "desc": "Blockchains zijn standaard afgesneden van de buitenwereld—een smart contract kan niet zelf de Bitcoin‑prijs of de EUR/USD‑koers ophalen. Oracles lossen dit op door betrouwbare externe data naar de blockchain te brengen. Bekende oracle‑diensten zijn Chainlink en Pyth Network. Zonder oracles zouden veel DeFi‑toepassingen zoals lending‑protocollen of synthetische assets niet mogelijk zijn."
  },
  "cex": {
    "title": "Gecentraliseerde beurs",
    "original": "CEX – Centralized Exchange",
    "short": "Een crypto-beurs die door een bedrijf wordt beheerd en als tussenpersoon tussen kopers en verkopers fungeert.",
    "desc": "Bij een CEX zoals Coinbase, Binance of Kraken heb je geen directe controle over je coins – de beurs bewaart ze voor je. Dat is handig, maar brengt risico’s mee: wordt de beurs gehackt of gaat ze failliet, dan kunnen fondsen verloren gaan (voorbeeld: de FTX-crash in 2022). CEX’en vereisen meestal identiteitsverificatie (KYC). Een DEX laat je daarentegen direct vanuit je eigen wallet handelen zonder tussenpersoon."
  },
  "orderBook": {
    "title": "Orderboek",
    "original": "Order Book",
    "short": "Een lijst met alle open koop- en verkooporders voor een handelspaar op een beurs.",
    "desc": "Het orderboek toont in real time welke prijzen kopers willen betalen (bids) en verkopers willen ontvangen (asks). Het verschil tussen het hoogste bod en de laagste laatprijs heet de spread. Stellar heeft een ingebouwd gedecentraliseerd orderboek (SDEX – Stellar Decentralized Exchange) waarop iedereen assets kan verhandelen. Daarnaast bestaan er liquiditeitspools als alternatief voor het klassieke orderboekmodel."
  },
  "limitOrder": {
    "title": "Limietorder",
    "original": "Limit Order",
    "short": "Een order die alleen wordt uitgevoerd tegen een bepaalde prijs of beter.",
    "desc": "Met een limietorder bepaal je de maximale prijs die je wilt betalen of de minimale prijs waarvoor je wilt verkopen. De order komt in het orderboek en wacht tot iemand tegen die prijs wil handelen. Voordeel: je bepaalt de prijs. Nadeel: de order kan niet meteen of helemaal niet worden uitgevoerd. Op Stellar komt dit overeen met een “offer” in het gedecentraliseerde orderboek."
  },
  "marketOrder": {
    "title": "Market order",
    "original": "Market Order",
    "short": "Een order die direct wordt uitgevoerd tegen de beste beschikbare marktprijs.",
    "desc": "Een market order wordt meteen uitgevoerd tegen de beste beschikbare prijs in het orderboek. Dit garandeert uitvoering maar niet de prijs. Bij lage liquiditeit kan de uiteindelijke prijs flink afwijken van wat je verwacht (slippage). Market orders zijn goed voor snelheid; limietorders zijn beter als de prijs belangrijk is."
  },
  "offer": {
    "title": "Aanbod",
    "original": "Offer",
    "short": "Een open koop- of verkoopaanbod in het gedecentraliseerde Stellar-orderboek.",
    "desc": "Op Stellar kan iedereen een aanbod in het gedecentraliseerde orderboek plaatsen: bijvoorbeeld “Ik verkoop 100 XLM voor 0,10 USDC per stuk”. Het aanbod blijft open totdat het volledig is gevuld, handmatig verwijderd of vervangen door een nieuwe versie. Offers vormen de basis van de SDEX (Stellar Decentralized Exchange) en worden ook gebruikt voor path payments. Elk open aanbod verhoogt het minimumsaldo van het account met een base reserve."
  },
  "slippage": {
    "title": "Slippage",
    "original": "Slippage",
    "short": "Het verschil tussen de verwachte prijs en de daadwerkelijke uitvoeringsprijs van een trade.",
    "desc": "Slippage ontstaat wanneer de marktprijs beweegt tussen het plaatsen en uitvoeren van een order, of wanneer een trade zo groot is dat hij het orderboek “opvreet”. Voorbeeld: je wilt kopen op 1,00 USDC maar door lage liquiditeit wordt de trade uitgevoerd op 1,05 USDC – dat is 5% slippage. Bij liquiditeitspools is slippage vooral belangrijk bij grote trades. Veel DEX’en laten je een maximale slippage-tolerantie instellen."
  },
  "impermanentLoss": {
    "title": "Tijdelijk verlies",
    "original": "Impermanent Loss",
    "short": "Een tijdelijk waardeverlies voor liquiditeitsaanbieders als de prijzen van de assets in de pool uit elkaar lopen.",
    "desc": "Wie liquiditeit in een pool stopt, kan tijdelijk verlies lijden: als de prijsverhouding van de twee assets verandert, is de waarde bij opname lager dan wanneer je de assets gewoon had gehouden. Het heet “impermanent” omdat het verlies verdwijnt als de prijzen terugkeren naar de oorspronkelijke verhouding. Handelskosten kunnen dit verlies compenseren. Dit is belangrijk voor iedereen die liquiditeit levert op de Stellar DEX."
  },
  "amm": {
    "title": "Geautomatiseerde market maker",
    "original": "AMM – Automated Market Maker",
    "short": "Een systeem op basis van smart contracts dat handelen zonder orderboek mogelijk maakt via prijsformules.",
    "desc": "Een AMM vervangt het klassieke orderboek door een algoritme. In plaats van te wachten op een koper of verkoper, handel je direct met een liquiditeitspool. De prijs wordt automatisch berekend via een formule (meestal x × y = k). Hoe meer van een asset wordt gekocht, hoe duurder het wordt. Stellar heeft AMM-gebaseerde liquiditeitspools geïntroduceerd die naast het klassieke SDEX-orderboek bestaan."
  },
  "bullBearMarket": {
    "title": "Bull- & bear market",
    "original": "Bull & Bear Market",
    "short": "Bull market = stijgende prijzen en optimisme. Bear market = dalende prijzen en pessimisme.",
    "desc": "In een bull market stijgen de prijzen langdurig en zijn beleggers optimistisch. In een bear market dalen de prijzen (vaak meer dan 20% vanaf de top) en is het sentiment negatief. De symbolen: de stier duwt met de hoorns omhoog (stijging), de beer slaat met de poot naar beneden (daling). Cryptomarkten wisselen regelmatig tussen deze fases—vaak sterker en sneller dan traditionele markten."
  },
  "hodl": {
    "title": "HODL",
    "original": "HODL",
    "short": "Crypto-slang voor het lang aanhouden van crypto, ongeacht prijsschommelingen.",
    "desc": "HODL ontstond in 2013 door een typefout van “hold” op een Bitcoin-forum en werd een crypto-mantra. De strategie: kopen en lang vasthouden in plaats van kortetermijnhandel. Veel langetermijnbeleggers zweren erbij, omdat kortetermijnhandel vaak slechter presteert dan simpel vasthouden. Soms wordt HODL grappig uitgelegd als “Hold On for Dear Life”—vooral in volatiele markten."
  },
  "dca": {
    "title": "Gemiddelde kostprijs",
    "original": "DCA – Dollar Cost Averaging",
    "short": "Een strategie waarbij je regelmatig een vast bedrag investeert, ongeacht de prijs.",
    "desc": "In plaats van één keer een groot bedrag te investeren, investeer je regelmatig een vast bedrag (bijv. 50 € per maand) in XLM of Bitcoin. Bij lage prijzen koop je meer, bij hoge minder—zo wordt de gemiddelde prijs afgevlakt. DCA verkleint het risico om op het verkeerde moment in te stappen en is ideaal voor beginners en volatiele markten zoals crypto."
  },
  "portfolio": {
    "title": "Portfolio",
    "original": "Portfolio",
    "short": "Het totale overzicht van iemands crypto-assets en investeringen.",
    "desc": "Een portfolio is het overzicht van alles wat je bezit: welke coins en tokens je hebt, in welke hoeveelheid en wat ze nu waard zijn. Een goede portfolio-strategie bevat diversificatie: zet niet alles in één asset. In Stellar Account Manager kun je je portfolio direct bekijken—alle assets op je Stellar-accounts in één oogopslag."
  },
  "tvl": {
    "title": "Total Value Locked",
    "original": "TVL – Total Value Locked",
    "short": "De totale waarde van alle assets die vastzitten in een DeFi-protocol of liquiditeitspool.",
    "desc": "TVL is een belangrijke maatstaf in DeFi. Het toont hoeveel kapitaal is vastgezet in een protocol, een dApp of een liquiditeitspool. Een hoge TVL wijst op vertrouwen en actief gebruik. Op Stellar meet TVL de waarde van alle assets in liquiditeitspools. Platforms zoals DeFiLlama volgen TVL voor veel blockchains en protocollen."
  },
  "balanceClaimable": {
    "title": "Opvorderbaar saldo",
    "original": "Claimable Balance",
    "short": "Gereserveerd geld dat je nog moet ontvangen.",
    "desc": "Een opeisbaar saldo is geld dat al voor jou gereserveerd is, maar dat je nog moet opeisen. Het wordt pas aan je rekening bijgeschreven nadat je het accepteert."
  },
  "protocolUpdate": {
    "title": "Protocolbijwerking",
    "original": "Protocol Update",
    "short": "Aktualisierung der Netzwerk‑Regeln.",
    "desc": "Een protocolupdate is een upgrade van de regels in het Stellar-netwerk, zoals nieuwe functies of beveiligingswijzigingen. Alle knooppunten in het netwerk moeten dezelfde regels gebruiken."
  },
  "soroban": {
    "title": "Soroban",
    "original": "Soroban",
    "short": "Stellars Smart‑Contract‑System.",
    "desc": "Soroban is het smart contract systeem van Stellar. Een smart contract is programmacode op de blockchain. De code kan onafhankelijk regels verifiëren en acties activeren zonder de noodzaak van een tussenkomst van een bank."
  },
  "multiSignature": {
    "title": "Multisignatuur",
    "original": "Multi-Signature",
    "short": "Meerdere handtekeningen vereist; gewichten + drempel bepalen de vrijgave.",
    "desc": "In een multi-handtekening setup moeten meerdere sleutels tekenen voordat een actie geldig wordt. Elke ondertekenaar heeft een gewicht, en de som moet aan de vereiste drempelwaarde voldoen. Dit verhoogt de beveiliging omdat één gestolen sleutel niet voldoende is."
  },
  "signer": {
    "title": "Ondertekenaar",
    "original": "Signer",
    "short": "Openbare sleutel met gewicht, onderdeel van de accountconfiguratie.",
    "desc": "Een ondertekenaar is een publieke sleutel die bij een account hoort en een gewicht heeft. De handtekening telt mee voor de vereiste drempel. Meerdere ondertekenaars kunnen gezamenlijk een transactie autoriseren.\n\nOndertekenaars types:\n- ed25519 (standard key)\n- hashX (Hash-Vorlage)\n- preAuthTx (vorab autorisierte Transaktion)\n\nSKM ondersteunt alleen ed25519. Voor aanvullende opties, bezoek https://lab.stellar.org."
  },
  "thresholds": {
    "title": "Drempels",
    "original": "Thresholds",
    "short": "Limieten (low/med/high) die het vereiste totale gewicht bepalen.",
    "desc": "Drempels bepalen hoeveel gewogen handtekeningen nodig zijn voor acties: laag voor eenvoudige handelingen, middel voor betalingen en hoog voor kritische veranderingen. De som van de ondertekenaarsgewichten moet voldoen aan de respectieve drempelwaarde."
  },
  "masterWeight": {
    "title": "Meestergewicht",
    "original": "master_weight",
    "short": "Gewicht van de hoofdsleutel; bepaalt hoeveel belang de hoofdsleutel heeft.",
    "desc": "Het meestergewicht is het gewicht van de hoofdssleutel van een account. Een hoog meestergewicht stelt de hoofdssleutel in staat om veel acties zelfstandig te ondertekenen; een lage waarde vereist aanvullende ondertekenaars."
  },
  "accountConfig": {
    "title": "Accountconfiguratie",
    "original": "Account Configuration",
    "short": "De interactie tussen ondertekenaars en drempels bepaalt de veiligheid van de rekening.",
    "desc": "De accountconfiguratie bepaalt welke ondertekenaars bestaan met welke gewichten en welke drempels van toepassing zijn. Wijzigingen aan ondertekenaars of drempels zijn van cruciaal belang voor de beveiliging, omdat zij bepalen hoeveel handtekeningen vereist zijn."
  },
  "distributedNetwork": {
    "title": "Gedistribueerd netwerk",
    "original": "Distributed Network",
    "short": "Veel computers werken samen in plaats von één die alle beslissingen neemt.",
    "desc": "Stel je een markt voor waar veel handelaren dezelfde regels kennen. Als één deelnemer wegvalt, blijft het systeem draaien omdat anderen het kunnen overnemen. Dit houdt het systeem stabiel en moeilijker te manipuleren."
  },
  "node": {
    "title": "Knooppunt",
    "original": "Node",
    "short": "Een enkele deelnemer in het netwerk.",
    "desc": "Een knooppunt is als een boekhouder die een kopie van de gegevens bijhoudt. Het verifieert nieuwe invoer en geeft deze door. Veel knooppunten samen maken het netwerk betrouwbaar."
  },
  "block": {
    "title": "Blok",
    "original": "Block",
    "short": "Een blok is een bundel van invoeringen.",
    "desc": "Net als een pagina in een kasboek verzamelt een blok meerdere transacties. Zodra het vol is, wordt het afgesloten en aan de ketting toegevoegd. Dit creëert stap voor stap de geschiedenis."
  },
  "consensusMechanism": {
    "title": "Consensusmechanisme",
    "original": "Consensus Mechanism",
    "short": "Regels waarmee iedereen akkoord gaat over geldige invoer.",
    "desc": "Het is vergelijkbaar met wanneer een groep beslist welke bon geldig is. Dit voorkomt dat iemand in het geheim wijzigingen aanbrengt. Verschillende blockchains gebruiken verschillende werkwijzen, maar het doel is altijd consensus."
  },
  "finality": {
    "title": "Finaliteit / Definitiviteit",
    "original": "Finality",
    "short": "De zekerheid dat een transactie definitief is.",
    "desc": "Wanneer iets definitief is, voelt het als een bevestigde bankafschrift. Je hoeft niet langer te verwachten dat het wordt teruggedraaid. Dit creëert vertrouwen."
  },
  "immutability": {
    "title": "Onveranderlijkheid",
    "original": "Immutability",
    "short": "Invoer mag niet met terugwerkende kracht worden gewijzigd.",
    "desc": "Vergelijkbaar met een grootboek: Eventuele verwijderingen achteraf zijn merkbaar. Wijzigingen worden als een nieuwe invoer toegevoegd en niet overschreven. Dit maakt de geschiedenis traceerbaar."
  },
  "decentralization": {
    "title": "Decentralisatie",
    "original": "Decentralization",
    "short": "Geen centrale autoriteit beheerst alles.",
    "desc": "In plaats van een enkele kluis, zijn er veel kluizen met dezelfde informatie. Beslissingen ontstaan uit de interactie van veel deelnemers. Dit maakt het systeem robuuster."
  },
  "publicBlockchain": {
    "title": "Publieke blockchain",
    "original": "Public Blockchain",
    "short": "Open voor iedereen die wil deelnemen.",
    "desc": "Iedereen kan deelnemen en de gegevens bekijken, vergelijkbaar met een openbaar mededelingenbord. Dit verhoogt de transparantie, maar elke actie is voor iedereen zichtbaar. Regels zorgen ervoor dat niemand kan valsspelen."
  },
  "privateBlockchain": {
    "title": "Private blockchain",
    "original": "Private Blockchain",
    "short": "Toegang alleen voor geselecteerde deelnemers.",
    "desc": "Net als een kasboek van een bedrijf dat alleen door werknemers mag worden ingezien. Het kan sneller en meer gecontroleerd zijn, maar het is minder transparant. Vertrouwen wordt hier opgebouwd door de organisatie."
  },
  "permissionlessBlockchain": {
    "title": "Toestemmingsloze blockchain",
    "original": "Permissionless Blockchain",
    "short": "Iedereen mag zonder toestemming deelnemen.",
    "desc": "Zoals een markt waar iedereen aan kan deelnemen. Dit verlaagt de drempels, maar kan meer regels vereisen om eerlijk te blijven. Voorbeelden hiervan zijn veel openbare blockchains."
  },
  "permissionedBlockchain": {
    "title": "Permissioned blockchain",
    "original": "Permissioned Blockchain",
    "short": "Deelname alleen met toestemming.",
    "desc": "Zoals een club met een ledenlijst. Dit kan duidelijk verantwoordelijkheden creëren. Het is echter minder open."
  },
  "seedPhrase": {
    "title": "Restoratiestelling",
    "original": "Seed Phrase / Recovery Phrase",
    "short": "Een woordenlijst waarmee je je portemonnee kunt herstellen.",
    "desc": "Zij is als de reserve sleutel van je kluis. Degene die het heeft, kan je portemonnee herstellen. Het moet daarom nooit online worden opgeslagen."
  },
  "selfCustody": {
    "title": "Zelfbeheer",
    "original": "Self-Custody",
    "short": "Je bewaart je sleutels zelf.",
    "desc": "Zoals contant geld in je eigen kluis: je hebt de controle, maar ook de verantwoordelijkheid. Als je de toegang verliest, kan niemand helpen. Voor beginners is voorzichtigheid bijzonder belangrijk."
  },
  "custodian": {
    "title": "Bewaker",
    "original": "Custodian",
    "short": "Een dienstverlener bewaart je sleutels voor je.",
    "desc": "Zoals een bank die uw rekening beheert. Het kan handig zijn, maar het neemt de volledige controle van u weg. U moet erop vertrouwen."
  },
  "hardwareWallet": {
    "title": "Hardware wallet",
    "original": "Hardware Wallet",
    "short": "Een fysiek apparaat voor je sleutels.",
    "desc": "Als een kleine kluis in je zak. De sleutels blijven op het apparaat en gaan niet online. Dit beschermt tegen veel online aanvallen."
  },
  "hotWallet": {
    "title": "Hot wallet",
    "original": "Hot Wallet",
    "short": "Een portemonnee met internettoegang.",
    "desc": "Als een portemonnee in een jas: handig maar kwetsbaarder. Geschikt voor kleine bedragen en dagelijks gebruik. Niet ideaal voor grote sommen."
  },
  "coldWallet": {
    "title": "Cold wallet",
    "original": "Cold Wallet",
    "short": "Een portemonnee zonder internetverbinding.",
    "desc": "Als een kluis in de kelder. Zeer veilig, maar onpraktisch voor dagelijks gebruik. Geschikt voor langdurige opslag."
  },
  "cryptocurrency": {
    "title": "Cryptovaluta",
    "original": "Cryptocurrency",
    "short": "Digitale valuta die rechtstreeks tussen mensen wordt verstuurd.",
    "desc": "Als digitaal geld, maar zonder een bank. Je kunt het rechtstreeks naar anderen sturen. De waarde kan fluctueren."
  },
  "altcoin": {
    "title": "Altcoin",
    "original": "Altcoin",
    "short": "Alle cryptocurrencies behalve Bitcoin.",
    "desc": "Net als andere merken op de markt naast de dominante speler. Sommige zijn bekend, veel zijn klein. Kwaliteit en risico variëren sterk."
  },
  "stablecoin": {
    "title": "Stablecoin",
    "original": "Stablecoin",
    "short": "Cryptovaluta met een mogelijk stabiele waarde.",
    "desc": "Zoals digitaal geld dat gekoppeld is aan een standaardvaluta. Dit maakt de prijs stabieler. Echter, vertrouwen in de aanbieder blijft belangrijk."
  },
  "utilityToken": {
    "title": "Gebruikstoken",
    "original": "Utility Token",
    "short": "Een token dat kan worden gebruikt om toegang te krijgen tot een dienst.",
    "desc": "Zoals een tegoedbon op een marktkraam. Het biedt toegang of een korting. De waarde ervan hangt af van het nut van de dienst."
  },
  "securityToken": {
    "title": "Beveiligingstokens",
    "original": "Security Token",
    "short": "Een token met beveiligingseigenschappen.",
    "desc": "Net als een aandeelcertificaat. Het kan rechten of winsten beloven. Strengere regels zijn hier vaak van toepassing."
  },
  "governanceToken": {
    "title": "Governance-token",
    "original": "Governance Token",
    "short": "Een token om inspraak te hebben in regels.",
    "desc": "Zoals een stemkaart in een club. Degenen die tokens hebben, kunnen stemmen over regels. Dat betekent verantwoordelijkheid."
  },
  "liquidityToken": {
    "title": "Liquiditeitstokens / LP-tokens",
    "original": "Liquidity Token",
    "short": "Een token voor geleverde liquiditeit.",
    "desc": "Zoals een bonnetje dat laat zien dat je geld hebt bijgedragen aan een gezamenlijke pool. Je ontvangt proportionele vergoedingen. De waarde kan fluctueren."
  },
  "nft": {
    "title": "Niet-fungibele token / NFT",
    "original": "Non-Fungible Token",
    "short": "Een uniek digitaal token.",
    "desc": "Net als een ondertekend verzamelobject. Het vertegenwoordigt iets unieks, geen inwisselbare munt. De waarde hangt af van de vraag."
  },
  "cbdc": {
    "title": "Digitale valuta van de centrale bank / CBDC",
    "original": "Central Bank Digital Currency",
    "short": "Digitaal geld uitgegeven door een centrale bank.",
    "desc": "Als digitale staatliche Währung. Es wäre offizielles Geld, nur in digitaler Form. Die Einzelheiten hängen vom jeweiligen Land ab."
  },
  "transactionStatus": {
    "title": "Transactiestatus",
    "original": "Transaction Status",
    "short": "Geeft aan of een transactie nog open is of al is voltooid.",
    "desc": "Zoals pakkettracking: in behandeling, bevestigd of mislukt. Op deze manier kun je zien of alles gelukt is. Soms duurt het even."
  },
  "gasFee": {
    "title": "Gasprijs",
    "original": "Gas Fee",
    "short": "Een vergoeding voor rekentaken in het netwerk.",
    "desc": "Zoals een verwerkingskosten bij een marktkraam. Hoe drukker het is, hoe duurder het kan worden. Niet elke blockchain noemt het gas."
  },
  "onChain": {
    "title": "On-chain",
    "original": "On-Chain",
    "short": "Vindt rechtstreeks op de blockchain plaats.",
    "desc": "Net als een directe invoer in het grootboek. Iedereen kan het zien. Het is transparant, maar vaak langzamer of duurder."
  },
  "offChain": {
    "title": "Off-chain",
    "original": "Off-Chain",
    "short": "Vindt plaats buiten de blockchain.",
    "desc": "Zoals een mondelinge overeenkomst die later in het grootboek wordt vastgelegd. Dit kan sneller en kostenefficiënter zijn. Vertrouwen speelt hier een grotere rol."
  },
  "liquidity": {
    "title": "Liquiditeit",
    "original": "Liquidity",
    "short": "Toont hoe gemakkelijk iets kan worden afgehandeld.",
    "desc": "Het aantal kopers en verkopers dat er is. Hoge liquiditeit betekent dat je snel kunt handelen zonder de prijs significant te beïnvloeden. Lage liquiditeit voelt traag aan."
  },
  "volatility": {
    "title": "Volatiliteit",
    "original": "Volatility",
    "short": "Hoeveel prijzen schommelen.",
    "desc": "Net als een markt met wilde prijsschommelingen. Hoge volatiliteit betekent kansen, maar ook risico. Voor beginners kan dit stressvol zijn."
  },
  "marketCap": {
    "title": "Marktkapitalisatie",
    "original": "Market Capitalization",
    "short": "De totale waarde van een munt of project.",
    "desc": "Zoals de totale waarde van alle goederen in een markt. Het is ruwweg afgeleid van de prijs vermenigvuldigd met de circulerende hoeveelheid. Grote waarden lijken stabieler, maar dat zijn ze niet automatisch."
  },
  "circulatingSupply": {
    "title": "Circulatiehoeveelheid",
    "original": "Circulating Supply",
    "short": "De hoeveelheid munten die daadwerkelijk in omloop is.",
    "desc": "Zoals het aantal munten dat daadwerkelijk op de markt is. Niet alles wat bestaat is al in omloop. Dat beïnvloedt de prijs."
  },
  "priceDiscovery": {
    "title": "Prijsvorming",
    "original": "Price Discovery",
    "short": "Dit is hoe de prijs wordt bepaald door vraag en aanbod.",
    "desc": "Het is als een markt: vraag en aanbod komen samen. Veel kleine beslissingen bepalen de prijs. Er is geen vaste schakelaar."
  },
  "spread": {
    "title": "Handelsbereik",
    "original": "Spread",
    "short": "Het verschil tussen de aankoopprijs en de verkoopprijs.",
    "desc": "Zoals de bied-laatspread in een winkel. Hoe kleiner de kloof, hoe eerlijker het voelt. Grote spreads maken transacties duurder."
  },
  "phishing": {
    "title": "Phishing",
    "original": "Phishing",
    "short": "Fraude via nepnieuws of websites.",
    "desc": "Net als een nep bank-e-mail die je in een val lokt. Het doel is dat je je inloggegevens weggeeft. Klik nooit blindelings op links."
  },
  "scam": {
    "title": "Scam",
    "original": "Scam",
    "short": "Een fraude in crypto die erop gericht is gebruikers hun assets af te nemen.",
    "desc": "Scams komen helaas vaak voor in crypto, omdat transacties onomkeerbaar zijn en er geen centrale autoriteit is. Voorbeelden: nep‑giveaways (“Stuur 1 XLM, krijg 2 terug”), nep‑wallets, frauduleuze investeringsplatformen of nep‑support. Vuistregel: niemand geeft gratis crypto weg. Als het te mooi klinkt om waar te zijn, is het dat meestal niet. Deel nooit private keys of seed phrases—met niemand, nooit."
  },
  "rugPull": {
    "title": "Rug Pull",
    "original": "Rug Pull",
    "short": "Een fraude waarbij ontwikkelaars plots alle liquiditeit weghalen en verdwijnen met het geld.",
    "desc": "Een rug pull is een van de meest voorkomende DeFi‑scams. Patroon: een project maakt een token, bouwt hype op, trekt investeerders aan en haalt dan alle liquiditeit uit de pool. De prijs zakt naar nul en de ontwikkelaars verdwijnen. Waarschuwingssignalen: anoniem team, geen smart‑contract audit, onrealistisch hoge rendementen, zeer korte projectgeschiedenis. Investeer alleen in projecten met een transparant team en geaudite code."
  },
  "ponzi": {
    "title": "Ponzi Scheme",
    "original": "Ponzi Scheme",
    "short": "Een frauduleus systeem waarbij opbrengsten van oude investeerders worden betaald met geld van nieuwe.",
    "desc": "Een Ponzi‑schema belooft hoge rendementen maar betaalt die niet uit echte winst, maar uit geld van nieuwe investeerders. Het werkt zolang er nieuw geld binnenkomt en stort daarna in. In crypto zijn er veel Ponzi’s geweest, soms van miljarden. Waarschuwingssignalen: gegarandeerde hoge rendementen, druk om snel in te stappen, ondoorzichtige businessmodellen, focus op het werven van nieuwe leden."
  },
  "twoFactorAuth": {
    "title": "Two-Factor Authentication",
    "original": "2FA – Two-Factor Authentication",
    "short": "Een extra beveiligingslaag die naast je wachtwoord een tweede stap vereist.",
    "desc": "2FA beschermt accounts veel beter dan alleen een wachtwoord. Na het wachtwoord is een tweede factor nodig—bijvoorbeeld een code uit een authenticator‑app (Google Authenticator, Authy) of een SMS. Belangrijk: SMS‑2FA is minder veilig door SIM‑swapping. Zet 2FA aan op alle crypto‑exchange‑accounts. Let op: self‑custody wallets hebben geen 2FA—je private key is de enige bescherming."
  },
  "socialEngineering": {
    "title": "Social Engineering",
    "original": "Social Engineering",
    "short": "Mensen manipuleren met psychologische trucs om informatie of toegang te krijgen.",
    "desc": "Social engineering is vaak gevaarlijker dan technische aanvallen omdat het mensen uitbuit. Methoden: doen alsof je support bent en om de private key vragen; nep‑urgentie creëren (“Je account wordt geblokkeerd!”); vertrouwen winnen met valse identiteiten. In crypto geldt: geen legitieme support, geen Stellar‑medewerker en geen wallet‑app vraagt ooit om je private key of seed phrase. Nooit."
  },
  "smartContract": {
    "title": "Slim contract",
    "original": "Smart Contract",
    "short": "Een programma dat automatisch vaste regels uitvoert.",
    "desc": "Als een machine die volgens vaste regels reageert. Hij voert overeenkomsten automatisch uit. Dit bespaart vertrouwen maar vereist duidelijke regels."
  },
  "programmableLogic": {
    "title": "Geautomatiseerde regels",
    "original": "Programmable Logic",
    "short": "Regels die automatisch worden uitgevoerd wanneer er iets gebeurt.",
    "desc": "Net zoals een als-dan-regel in een automaat. Dit maakt het mogelijk om processen te beheersen zonder dat er elke keer handmatige tussenkomst nodig is. Zo worden eenvoudige digitale contracten gecreëerd."
  },
  "networkCongestion": {
    "title": "Netwerkgebruik",
    "original": "Network Congestion",
    "short": "Als er een groot aantal transacties tegelijkertijd in behandeling zijn.",
    "desc": "Net als een verkeersopstopping op de snelweg. Transacties duren langer en de kosten kunnen toenemen. Met minder verkeer gaat het weer sneller."
  },
  "blockchainTypes": {
    "title": "Typen van Blockchain",
    "original": "Blockchain Types",
    "short": "Er zijn verschillende soorten blockchains met verschillende doelen.",
    "desc": "Zoals verschillende voertuigtypen voor verschillende routes. Sommige zijn gebouwd voor betalingen, andere voor programma's. Het is de moeite waard om het doel te kennen."
  },
  "paymentBlockchain": {
    "title": "Betalingsblockchain",
    "original": "Payment Blockchain",
    "short": "Een blockchain ontworpen voor snelle betalingen.",
    "desc": "Als een snel kasboek voor geld. De focus ligt op goedkope en snelle overboekingen. Functies worden vaak opzettelijk eenvoudig gehouden."
  },
  "smartContractBlockchain": {
    "title": "Slim contract blockchain",
    "original": "Smart Contract Blockchain",
    "short": "Een blockchain die programma's en apps kan uitvoeren.",
    "desc": "Als een markt met veel verkoopautomaten. Naast betalingen kunnen daar regels en apps worden uitgevoerd. Dit maakt ze veelzijdig, maar vaak ook complexer."
  },
  "blockchainComparison": {
    "title": "Vergelijking van blockchains",
    "original": "Blockchain Comparison",
    "short": "Een vergelijking onthult de sterke en zwakke punten van verschillende blockchains.",
    "desc": "Net als de vergelijking van banken of markten: Elk heeft zijn sterke en zwakke punten. Belangrijke factoren zijn kosten, snelheid en veiligheid. Er is geen perfect systeem voor alles."
  },
  "stellarVsBitcoinVsEthereum": {
    "title": "Stellar versus Bitcoin versus Ethereum",
    "original": "Stellar vs. Bitcoin vs. Ethereum",
    "short": "Drie bekende blockchains met verschillende aandachtsgebieden.",
    "desc": "Bitcoin is als digitaal goud en wordt vaak gezien als een waardeopslag. Ethereum is als een platform voor programma's en apps. Stellar richt zich op betaalbare betalingen."
  },
  "mining": {
    "title": "Mining",
    "original": "Mining",
    "short": "Het proces waarbij computers zware rekentaken oplossen om nieuwe blokken te maken en transacties te bevestigen.",
    "desc": "Mining is de kern van Proof‑of‑Work blockchains zoals Bitcoin. Miners concurreren om als eerste een moeilijk rekenprobleem op te lossen. De winnaar voegt het volgende blok toe en krijgt nieuwe coins als beloning. Mining gebruikt enorme hoeveelheden stroom en gespecialiseerde hardware. Stellar heeft geen mining nodig—SCP is energiezuinig en bevestigt transacties in seconden."
  },
  "proofOfWork": {
    "title": "Proof of Work",
    "original": "Proof of Work",
    "short": "Een consensusmechanisme dat rekenkracht gebruikt om transacties te valideren en nieuwe blokken te maken.",
    "desc": "Proof of Work (PoW) is het oorspronkelijke consensusmechanisme van Bitcoin. Miners moeten veel rekenkracht inzetten om een geldig blok te maken—daardoor is aanvallen extreem duur. Nadeel: PoW verbruikt veel energie en is traag (Bitcoin ~7 transacties per seconde). Stellar en veel nieuwe blockchains kozen voor efficiëntere alternatieven."
  },
  "proofOfStake": {
    "title": "Proof of Stake",
    "original": "Proof of Stake",
    "short": "Een consensusmechanisme waarbij validators coins vastzetten als zekerheid in plaats van rekenkracht.",
    "desc": "Bij Proof of Stake (PoS) worden validators gekozen op basis van hun gestakete coins. Ethereum schakelde in 2022 over op PoS en verminderde het energieverbruik met meer dan 99%. PoS is efficiënter dan PoW, maar kent andere risico’s zoals machtsconcentratie bij grote holders. Stellar gebruikt geen PoW of PoS, maar zijn eigen Stellar Consensus Protocol (SCP)."
  },
  "fork": {
    "title": "Fork",
    "original": "Fork",
    "short": "Een protocolwijziging die compatibel (soft fork) of incompatibel (hard fork) kan zijn.",
    "desc": "Een soft fork is backward‑compatible—oude nodes kunnen blijven meedoen. Een hard fork is een grote wijziging die het netwerk kan splitsen: nodes die niet upgraden volgen de oude keten. Bekende hard forks: Bitcoin Cash (afgesplitst van Bitcoin in 2017) en Ethereum Classic (afgesplitst van Ethereum in 2016). Stellar voert protocolupdates uit via stemmen van validators—een ordelijk proces zonder ongecontroleerde splitsingen."
  },
  "layer1Layer2": {
    "title": "Layer 1 / Layer 2",
    "original": "Layer 1 / Layer 2",
    "short": "Layer 1 is de basis‑blockchain; Layer 2 zijn oplossingen erbovenop voor schaal en uitbreiding.",
    "desc": "Layer 1 (L1) is de hoofd‑blockchain zelf—bijv. Bitcoin, Ethereum of Stellar. Layer 2 (L2) zijn protocollen bovenop L1 om snelheid en kosten te verbeteren. Voorbeelden: Lightning Network (op Bitcoin) of Polygon (op Ethereum). Stellar is zelf een snelle en goedkope L1 dankzij SCP en heeft daarom minder L2‑oplossingen nodig dan Ethereum."
  },
  "bridge": {
    "title": "Bridge",
    "original": "Bridge",
    "short": "Een protocol dat assets tussen twee verschillende blockchains verplaatst.",
    "desc": "Omdat blockchains normaal geïsoleerd zijn, maken bridges het uitwisselen van assets tussen ketens mogelijk. Voorbeeld: een bridge tussen Ethereum en Stellar laat je USDC van Ethereum naar Stellar verplaatsen. Meestal worden assets op de bronketen vergrendeld en als wrapped tokens op de doelketen uitgegeven. Bridges zijn nuttig maar vaak doelwit van aanvallen. Op Stellar vervullen anchors vaak een vergelijkbare brugfunctie."
  },
  "interoperability": {
    "title": "Interoperabiliteit",
    "original": "Interoperability",
    "short": "De mogelijkheid van verschillende blockchains om te communiceren en assets uit te wisselen.",
    "desc": "Interoperabiliteit is een grote uitdaging in crypto. Vandaag bestaan er honderden blockchains die vaak niet met elkaar praten—als eilanden zonder bruggen. Oplossingen zijn bridges, cross‑chain‑protocollen of standaarden zoals IBC (Inter‑Blockchain Communication). Stellar heeft interoperabiliteit als kern­doel: het anchor‑systeem koppelt aan traditionele financiën en bridges verbinden Stellar met andere blockchains."
  },
  "whitepaper": {
    "title": "Whitepaper",
    "original": "Whitepaper",
    "short": "Een technisch document dat het concept, de technologie en doelen van een crypto‑project beschrijft.",
    "desc": "Het whitepaper is het oprichtingsdocument van een crypto‑project. Bitcoin werd gelanceerd via het whitepaper van Satoshi Nakamoto uit 2008. Een goed whitepaper legt het probleem, de oplossing, de technologie en de tokenomics uit. Voor je investeert, moet je het whitepaper lezen. Ontbreekt het of is het vaag, dan is dat vaak een waarschuwing. Het Stellar‑whitepaper beschrijft SCP en is openbaar."
  },
  "ico": {
    "title": "ICO / Token Sale",
    "original": "ICO – Initial Coin Offering",
    "short": "Een financieringsmethode waarbij nieuwe tokens openbaar worden verkocht—vergelijkbaar met een IPO.",
    "desc": "Een ICO is als een IPO voor crypto‑projecten. Het project verkoopt nieuwe tokens om kapitaal op te halen. ICO’s waren populair in 2017–2018, maar vaak ongereguleerd of frauduleus. Veel projecten leverden nooit een werkend product. Tegenwoordig is regelgeving strenger. Alternatieven zijn IEO (Initial Exchange Offering) of IDO (Initial DEX Offering). Beginners moeten zeer voorzichtig zijn met ICO‑investeringen."
  },
  "airdrop": {
    "title": "Airdrop",
    "original": "Airdrop",
    "short": "Gratis distributie van tokens naar wallet‑adressen, meestal voor marketing of community.",
    "desc": "Bij een airdrop ontvangen gebruikers gratis tokens—vaak als beloning voor vroege steun, community‑activiteit of simpelweg het bezitten van een bepaalde wallet. Airdrops zijn een populair marketingmiddel. Belangrijk: legitieme airdrops vragen nooit om private keys of voorafbetalingen. Veel airdrops zijn scams—geef nooit je private key om er één te claimen. Op Stellar kunnen airdrops netjes worden uitgevoerd via claimable balances."
  },
  "money": {
    "title": "Geld",
    "original": "Money",
    "short": "Geld is een algemeen geaccepteerd ruilmiddel voor goederen en diensten.",
    "desc": "Geld vervult drie functies: het is een ruilmiddel, een oppotmiddel en een rekeneenheid. Historisch gezien heeft geld vele vormen aangenomen – van schelpen tot goud tot de huidige bankbiljetten en digitaal geld. Modern geld wordt vooral gedekt door vertrouwen in de uitgevende overheid, niet door fysieke waarden."
  },
  "fiatCurrency": {
    "title": "Fiatvaluta",
    "original": "Fiat Currency",
    "short": "Door de overheid uitgegeven valuta zonder dekking door een fysieke grondstof zoals goud.",
    "desc": "Fiatvaluta's zoals de euro, dollar of frank hebben geen intrinsieke waarde – hun waarde is gebaseerd op vertrouwen in de uitgevende staat en zijn economie. Centrale banken kunnen fiatvaluta's in onbeperkte hoeveelheden drukken, wat tot inflatie kan leiden. Daarentegen is het aanbod van veel cryptovaluta's strikt beperkt."
  },
  "centralBank": {
    "title": "Centrale bank",
    "original": "Central Bank",
    "short": "Overheidsinstelling die het monetaire beleid van een land of valutazone controleert.",
    "desc": "Centrale banken zoals de Europese Centrale Bank (ECB) of de Amerikaanse Federal Reserve (Fed) controleren de geldhoeveelheid, stellen rentetarieven vast en waarborgen de stabiliteit van het financiële systeem. Ze kunnen geld drukken en hebben een monopolie op de uitgifte van contant geld. Cryptovaluta's zijn ontwikkeld als alternatief voor gecentraliseerde monetaire systemen – zonder centrale bank, zonder enkele controlerende autoriteit."
  },
  "inflation": {
    "title": "Inflatie",
    "original": "Inflation",
    "short": "Algemene stijging van het prijsniveau die de koopkracht van geld vermindert.",
    "desc": "Bij inflatie verliest geld na verloop van tijd aan waarde – je krijgt minder voor hetzelfde bedrag. Oorzaken zijn onder meer te veel geld in omloop, stijgende vraag of leveringsproblemen. Veel mensen zien Bitcoin en andere cryptovaluta's met beperkt aanbod als bescherming tegen inflatie, vergelijkbaar met goud. XLM daarentegen heeft een gematigd jaarlijks inflatiepercentage dat door het netwerk is vastgesteld."
  },
  "currency": {
    "title": "Valuta",
    "original": "Currency",
    "short": "Een erkend waarde-uitwisselingssysteem binnen een bepaald economisch gebied.",
    "desc": "Een valuta is het officiële betaalmiddel van een land of regio (bijv. EUR, USD, CHF). In de cryptowereld wordt de term vaak als synoniem gebruikt voor 'coin' of 'cryptovaluta'. Het verschil met een 'asset': een valuta dient primair als ruilmiddel, terwijl een asset een bredere term is voor elke waardeopslag – inclusief aandelen, vastgoed of tokens."
  },
  "cryptography": {
    "title": "Cryptografie",
    "original": "Cryptography",
    "short": "Wetenschap van veilige communicatie door wiskundige versleutelingsmethoden.",
    "desc": "Cryptografie is de basis van alle blockchaintechnologieën. Het zorgt ervoor dat gegevens alleen door bevoegde personen gelezen kunnen worden en dat transacties niet vervalst kunnen worden. Zonder cryptografie zouden Bitcoin, Stellar of welke andere cryptovaluta dan ook niet mogelijk zijn. De term komt van het Griekse 'kryptos' (verborgen) en 'graphein' (schrijven)."
  },
  "hash": {
    "title": "Hash",
    "original": "Hash",
    "short": "Een unieke digitale vingerafdruk die berekend wordt uit willekeurige gegevens.",
    "desc": "Een hashfunctie zet willekeurige gegevens (tekst, bestanden, transacties) om in een vaste tekenreeks – bijv. 'a3f8c2...'. Dezelfde invoergegevens produceren altijd dezelfde hash. Als ook maar één teken wordt gewijzigd, verandert de hash volledig. Dat maakt hashes ideaal voor het detecteren van manipulatie. In blockchains wordt elk blok uniek geïdentificeerd door zijn hash."
  },
  "encryption": {
    "title": "Versleuteling",
    "original": "Encryption",
    "short": "Het omzetten van leesbare gegevens naar een onleesbaar formaat dat alleen met de juiste sleutel ontsleuteld kan worden.",
    "desc": "Versleuteling beschermt gegevens tegen ongeautoriseerde toegang. Er zijn twee hoofdtypen: symmetrische versleuteling (één sleutel voor versleutelen en ontsleutelen) en asymmetrische versleuteling (publieke sleutel om te versleutelen, privésleutel om te ontsleutelen). Wallets en blockchaintransacties gebruiken asymmetrische versleuteling."
  },
  "digitalSignature": {
    "title": "Digitale handtekening",
    "original": "Digital Signature",
    "short": "Cryptografisch bewijs dat een bericht of transactie door de rechtmatige eigenaar is geautoriseerd.",
    "desc": "Een digitale handtekening werkt vergelijkbaar met een geschreven handtekening – alleen is hij onvervalsbaar. Op Stellar onderteken je elke transactie met je privésleutel. Het netwerk kan met je publieke sleutel controleren of de handtekening geldig is – zonder ooit je privésleutel te zien. Zonder geldige handtekening wordt een transactie door het netwerk afgewezen."
  },
  "publicKeyCryptography": {
    "title": "Publieke-sleutelcryptografie",
    "original": "Public-Key Cryptography",
    "short": "Versleutelingsmethode met twee gekoppelde sleutels: een publieke en een privé.",
    "desc": "Het principe: wat met de publieke sleutel versleuteld wordt, kan alleen met de privésleutel ontsleuteld worden – en omgekeerd. Je kunt je publieke sleutel (= je walletadres) vrij delen. Je privésleutel houd je geheim. Wie je privésleutel kent, heeft volledige toegang tot je account. Daarom geldt: deel nooit je privésleutel!"
  },
  "keyPair": {
    "title": "Sleutelpaar",
    "original": "Key Pair",
    "short": "De combinatie van publieke en privésleutel die samen een crypto-account vormen.",
    "desc": "Een sleutelpaar bestaat uit de publieke sleutel (je adres dat anderen mogen zien) en de privésleutel (je wachtwoord dat geheim blijft). Op Stellar wordt de publieke sleutel weergegeven als een G-adres, de privésleutel begint met S. Het sleutelpaar wordt wiskundig gegenereerd en is praktisch onmogelijk te vervalsen of te raden."
  },
  "signing": {
    "title": "Ondertekenen",
    "original": "Signing",
    "short": "Het autoriseren van een transactie met de privésleutel van de rekeninghouder.",
    "desc": "Voordat een transactie op het Stellar-netwerk wordt uitgevoerd, moet deze worden ondertekend. Met de privésleutel wordt een digitale handtekening aangemaakt die bewijst dat de rechtmatige rekeninghouder de transactie heeft goedgekeurd. Zonder geldige handtekening wordt de transactie door het netwerk afgewezen. Bij multisig-accounts zijn meerdere handtekeningen vereist."
  },
  "sequenceNumber": {
    "title": "Volgnummer",
    "original": "Sequence Number",
    "short": "Een oplopend nummer dat elke transactie van een account uniek identificeert en dubbele uitgaven voorkomt.",
    "desc": "Elk Stellar-account heeft een volgnummer dat bij elke transactie met 1 wordt verhoogd. Een transactie wordt alleen geaccepteerd als het volgnummer exact overeenkomt met de huidige accountsequentie +1. Dit voorkomt dat dezelfde transactie twee keer wordt uitgevoerd. Als je meerdere transacties tegelijk verstuurt, moeten ze in de juiste volgorde worden verwerkt."
  },
  "baseReserve": {
    "title": "Basisreserve",
    "original": "Base Reserve",
    "short": "Het minimumbedrag aan XLM dat op een Stellar-account moet blijven en niet kan worden uitgegeven.",
    "desc": "Op Stellar moet elk account een minimumsaldo in XLM aanhouden. Dit wordt berekend uit de basisreserve (momenteel 0,5 XLM) vermenigvuldigd met het aantal 'vermeldingen' op het account (bijv. trustlines, ondertekenaars, data-aanbiedingen). Een leeg account vereist minimaal 1 XLM (2 × 0,5 XLM). Elke trustline verhoogt het minimumsaldo met nog eens 0,5 XLM. Dit saldo is vergrendeld zolang de vermeldingen actief zijn."
  },
  "coin": {
    "title": "Coin",
    "original": "Coin",
    "short": "De native cryptovaluta van een blockchain, die direct op die blockchain bestaat.",
    "desc": "Een coin is de 'eigen' valuta van een blockchain. Bitcoin (BTC) is de coin van de Bitcoin-blockchain, Ether (ETH) de coin van Ethereum, XLM de coin van Stellar. Coins worden direct door het netwerkprotocol aangemaakt en dienen vooral om transactiekosten te betalen. In tegenstelling daarmee worden tokens door derden uitgegeven op een bestaande blockchain."
  },
  "coinVsToken": {
    "title": "Coin vs. Token",
    "original": "Coin vs. Token",
    "short": "Coins zijn native valuta's van een blockchain, tokens worden door derden uitgegeven op een bestaande blockchain.",
    "desc": "Het belangrijkste verschil: een coin bestaat op zijn eigen blockchain (BTC op Bitcoin, XLM op Stellar). Een token wordt door iemand aangemaakt op een al bestaande blockchain – bijv. een bedrijf dat op Stellar een eigen stablecoin uitgeeft. Tokens hebben geen eigen blockchain nodig. Op Stellar heten zelf aangemaakte tokens 'assets'. In het dagelijks gebruik worden de termen vaak door elkaar gehaald, wat tot verwarring leidt."
  },
  "nativeCoin": {
    "title": "Native coin",
    "original": "Native Coin",
    "short": "Het oorspronkelijke betaalmiddel van een blockchain, beheerd door het netwerk zelf.",
    "desc": "Elke blockchain heeft een native coin die wordt gebruikt voor transactiekosten en basale netwerkfuncties. Bij Stellar is XLM de native coin. Hij bestaat niet als token van een derde partij, maar is rechtstreeks in het protocol ingebouwd. De native coin dient vaak ook als middel tegen spam – op Stellar moet elke transactie een kleine XLM-vergoeding betalen."
  },
  "fungibility": {
    "title": "Fungibiliteit",
    "original": "Fungibility",
    "short": "De eigenschap van een activum waarbij elke eenheid identiek en uitwisselbaar is met elke andere.",
    "desc": "Een fungibel asset is als een bankbiljet: elk biljet van 10 euro is evenveel waard als elk ander. Bij cryptovaluta's zoals XLM, BTC of USDC is elke eenheid identiek – één XLM is altijd gelijk aan een andere XLM. Het tegenovergestelde zijn NFT's (Non-Fungible Tokens): elke NFT is uniek en niet uitwisselbaar. Fungibiliteit is een belangrijke eigenschap voor gebruik als valuta."
  },
  "wrappedToken": {
    "title": "Wrapped Token",
    "original": "Wrapped Token",
    "short": "Een token die de waarde van een ander asset op een andere blockchain vertegenwoordigt.",
    "desc": "Een wrapped token maakt het mogelijk om assets van de ene blockchain op een andere te gebruiken. Voorbeeld: Wrapped Bitcoin (WBTC) is een token op Ethereum die 1:1 gedekt is door echte Bitcoin. Het origineel wordt vastgezet in een smart contract en in ruil daarvoor wordt de wrapped token uitgegeven. Op Stellar kunnen bijv. Bitcoin of Ether als wrapped tokens worden uitgegeven door anchors, zodat ze op het Stellar-netwerk verhandeld kunnen worden."
  },
  "syntheticAsset": {
    "title": "Synthetisch asset",
    "original": "Synthetic Asset",
    "short": "Een token die de prijs van een echt activum nabootst zonder het direct te bezitten.",
    "desc": "Synthetische assets bootsen de waarde van andere activa na – bijv. aandelen, goud of valuta – zonder het origineel te bezitten. Ze worden beveiligd door smart contracts en onderpand. Een voorbeeld: een synthetisch Apple-aandelentoken volgt de koers van het echte aandeel, maar is een cryptotoken. Synthetische assets zijn een geavanceerd DeFi-concept."
  },
  "memeCoin": {
    "title": "Meme Coin",
    "original": "Meme Coin",
    "short": "Een cryptovaluta gebaseerd op een internetmeme of grap, meestal zonder technisch nut.",
    "desc": "Meme coins zoals Dogecoin (DOGE) of Shiba Inu (SHIB) ontstonden oorspronkelijk als grap, maar bereikten soms enorme marktwaarden door community-hype en aandacht op sociale media. Ze hebben doorgaans geen technische meerwaarde en zijn extreem speculatief. Hun waarde is bijna uitsluitend gebaseerd op sentiment en trends. Voor beginners zijn meme coins bijzonder risicovol."
  },
  "stellarAsset": {
    "title": "Stellar Asset",
    "original": "Stellar Asset",
    "short": "Elk op het Stellar-netwerk uitgegeven activum, gedefinieerd door assetcode en uitgeveradres.",
    "desc": "Op Stellar kan iedereen een eigen asset aanmaken – een bedrijf zijn loyaliteitstoken, een bank zijn stablecoin. Elk Stellar-asset wordt uniek geïdentificeerd door twee componenten: de assetcode (bijv. 'USD', 'MOBI', 'USDC') en het G-adres van de uitgever (issuer). Twee assets met dezelfde code maar verschillende uitgevers zijn verschillende assets. Om een Stellar-asset te ontvangen, moet je eerst een trustline naar de uitgever instellen."
  },
  "issuedAsset": {
    "title": "Uitgegeven asset",
    "original": "Issued Asset",
    "short": "Een asset uitgegeven door een anchor of bedrijf op Stellar dat een reële tegenwaarde vertegenwoordigt.",
    "desc": "Een uitgegeven asset is een Stellar-asset uitgegeven door een anchor dat een reële waarde vertegenwoordigt – bijv. Amerikaanse dollars, euro's of goud. De anchor bewaart de reële tegenwaarde en geeft overeenkomstige tokens uit op Stellar. Gebruikers kunnen deze tokens houden en verhandelen. Om het reële asset terug te krijgen, wissel je de tokens in bij de anchor (offramp). Bekende voorbeelden zijn USDC (Circle) of EURC."
  },
  "missingKey": "Ontbrekend woordenlijst sleutel: {{detail}}",
  "zkp": {
    "title": "Zero-Knowledge Bewijs",
    "original": "Zero-Knowledge Proof (ZKP)",
    "short": "Bewijst dat iets waar is zonder de onderliggende gegevens te onthullen.",
    "desc": "Stel je voor dat je wilt bewijzen dat je oud genoeg bent zonder je identiteitsbewijs te tonen. Een zero-knowledge bewijs (ZKP) doet precies dat: het bewijst dat een bewering waar is zonder de onderliggende informatie te onthullen.\n\nAlledaags voorbeeld:\nJe bewijst aan een website dat je ouder dan 18 bent zonder naam, geboortedatum of foto te delen. De site leert alleen: Ja, oud genoeg.\n\nRelevantie voor Stellar en blockchain:\n- Privacyvriendelijke betalingen\n- KYC-verificatie zonder identiteitsgegevens te delen\n- Schaalbaarheid via gecomprimeerde bewijzen (zk-SNARKs, zk-STARKs)\n\nHoe betrouwbare ZKP-bronnen herkennen:\n- .org- of .edu-domeinen verkiezen\n- GitHub-aanwezigheid van het project controleren\n- Academische citaten of whitepapers zoeken",
    "externalDomains": [
      "ethereum.org/en/zero-knowledge-proofs",
      "zkhack.dev",
      "zkproof.org"
    ],
    "domainsHeading": "Verder lezen (typ het adres zelf in):"
  },
  "walletWatcher": {
    "title": "Wallet Watcher / Drainer",
    "original": "Wallet Watcher / Drainer",
    "short": "Een automatisch script dat een gecompromitteerd account bewaakt en elke nieuwe storting onmiddellijk opneemt.",
    "desc": "Zodra oplichters toegang krijgen tot een geheime sleutel, installeren ze vaak een automatische watcher. Die bewaakt het account dag en nacht en verplaatst elke nieuwe storting onmiddellijk naar het account van de oplichter – vaak binnen enkele seconden. Het account is blijvend gecompromitteerd. De enige oplossing: maak onmiddellijk een nieuw wallet met volledig nieuwe sleutels en gebruik het oude account nooit meer."
  },
  "lumio": {
    "title": "Lumio",
    "original": "Lumio",
    "short": "Mascotte van de Stellar Konto Manager – een levende Lumen.",
    "desc": "Lumio is de mascotte van de Stellar Konto Manager en jouw metgezel in de Verhaalmodus. Zijn naam komt van 'Lumen' – de officiële naam voor de basiseenheid van Stellars valuta XLM. Je zou kunnen zeggen: Lumio is een Lumen die tot leven is gekomen om anderen te leren hoe de Stellar blockchain werkt. De naam heeft ook een tweede betekenis: 'lumen' is Latijn voor 'licht' – passend voor een stralende ster die kennis verspreidt."
  },
  "base_fee": {
    "title": "Basisvergoeding",
    "original": "Base Fee",
    "short": "Kleine netwerkvergoeding (0,00001 XLM) per transactie – voorkomt spam.",
    "desc": "De basisvergoeding is een zeer kleine vergoeding voor elke transactie op Stellar. Het bedraagt 0,00001 XLM. De vergoeding wordt verbrand en voorkomt zo spam-transacties. Zonder vergoeding wordt een transactie geweigerd."
  },
  "transaction_hash": {
    "title": "Transactiehash",
    "original": "Transaction Hash",
    "short": "Uniek ID van elke transactie – dient als bewijs.",
    "desc": "Elke transactie op Stellar krijgt een uniek ID, de transactiehash. Met deze hash kan iedereen de transactie opzoeken in de Explorer. Het dient als bewijs dat de transactie heeft plaatsgevonden."
  },
  "friendbot": {
    "title": "Friendbot",
    "original": "Friendbot",
    "short": "Testnet-dienst die nieuwe accounts gratis activeert met test-XLM.",
    "desc": "Friendbot is een dienst van de Stellar Development Foundation. Het activeert nieuwe Testnet-accounts gratis met 10.000 test-XLM. Op het echte Mainnet bestaat geen Friendbot – een ander account moet minstens 1 XLM sturen om een nieuw account te activeren."
  },
  "keypair": {
    "title": "Sleutelpaar",
    "original": "Keypair",
    "short": "Bijpassende combinatie van Public Key en Secret Key.",
    "desc": "Een keypair bestaat uit twee bijpassende sleutels: de Public Key (jouw adres) en de Secret Key (jouw wachtwoord). Beide sleutels horen bij elkaar en vormen een eenheid. De Public Key deel je openbaar – de Secret Key hou je altijd voor jezelf."
  }
}