{
  "pageTitle": "Woordenlijst",
  "pageIntro": "Hier vind je belangrijke termen uit de blockchainwereld en het Stellar-netwerk. Alles wordt in eenvoudige woorden uitgelegd.",
  "searchLabel": "Zoekterm",
  "searchPlaceholder": "Zoekterm (z. B. Konto, Account, Muxed)",
  "searchHint": "De zoekopdracht vindt woorden en verklaringen.",
  "noResults": "Geen overeenkomst.",
  "groups": {
    "accountsKeys": "Accounts & Sleutels",
    "multisigSecurity": "Multisig & Accountbeveiliging",
    "walletsCustody": "Wallets & Bewaring",
    "tokensAssets": "Token & Activa",
    "transactionsFees": "Transacties & Kosten",
    "marketsTrading": "Markten & Handel",
    "networkProtocol": "Netwerk & Protocol",
    "smartContracts": "Slimme contracten",
    "blockchainBasics": "Basisprincipes van blockchain",
    "security": "Beveiliging & Fraude"
  },
  "blockchain": {
    "title": "Blockchain",
    "original": "Blockchain",
    "short": "Gedeeld digitaal grootboek – veel computers slaan dezelfde invoeringen op.",
    "desc": "Een blockchain is als een digitaal grootboek. Veel computers slaan dezelfde gegevens op, waardoor niemand stiekem wijzigingen kan aanbrengen."
  },
  "wallet": {
    "title": "Portemonnee",
    "original": "Wallet",
    "short": "Digitale portemonnee die je sleutels beheert.",
    "desc": "Een portemonnee is je digitale beurs. Het beheert de sleutels die je nodig hebt om toegang te krijgen tot je account en transacties te verzenden. Een portemonnee kan een programma zijn, een app, of zelfs gewoon een stuk papier met je privésleutel."
  },
  "account": {
    "title": "Account",
    "original": "Account",
    "short": "Een blockchain-account kan activa vasthouden en transacties verzenden.",
    "desc": "Een account is de locatie op de blockchain waar je activa worden bewaard. Een account heeft een openbaar adres dat begint met een G. Meerdere wallets kunnen toegang krijgen tot hetzelfde account als ze de juiste sleutel hebben."
  },
  "addressG": {
    "title": "G-adres",
    "original": "G Address",
    "short": "Het publieke primaire adres van een Stellar-account (beginnt mit G).",
    "desc": "Het G-adres is het hoofdadres van een Stellar-account. Het begint met de letter G. Je geeft het aan anderen zodat ze je iets kunnen sturen."
  },
  "publicKey": {
    "title": "Openbare sleutel",
    "original": "Public Key",
    "short": "Adresse, die du teilen darfst; bei Stellar meist die G‑Adresse.",
    "desc": "De openbare sleutel is het adres dat je mag delen. In Stellar is dit het G-adres. Anderen gebruiken het om je geld te sturen."
  },
  "privateKey": {
    "title": "Geheime sleutel",
    "original": "Secret Key",
    "short": "Wachtwoord voor het account – deel het nooit.",
    "desc": "De geheime sleutel is je wachtwoord voor de account. Wie deze sleutel heeft, kan je geld verplaatsen. Deel het nooit."
  },
  "addressFederation": {
    "title": "Federatieadres",
    "original": "Federation Address",
    "short": "Kurze Adresse wie E‑Mail, zeigt auf eine G‑Adresse.",
    "desc": "Een federatieadres ziet eruit als een e-mailadres. Voorbeeld: naam*domein.com. Dit korte adres verwijst naar een regulier G-adres. Het is gemakkelijker te onthouden."
  },
  "addressMuxed": {
    "title": "Gemengd account",
    "original": "Muxed Account",
    "short": "M‑address with additional ID – shares a base account.",
    "desc": "Een M-adres wijst naar een bestaande Stellar-rekening maar heeft een extra nummer (ID).\n\nMuxed Accounts = G-account + ID (M-Adresse)\nZe bieden associatie, maar geen scheiding van accounts.\nSaldo, kredietlijnen, ondertekenaars en vlaggen zijn altijd op het G-account.\n\nStellar Development Foundation\n\nBijvoorbeeld, meerdere individuen of afdelingen kunnen onder hetzelfde G-adres worden onderscheiden. Technisch gezien behoort het geld nog steeds tot de hoofdaccount."
  },
  "muxedAccountsUseCases": {
    "title": "Toepassingsgevallen voor gemengde accounts",
    "original": "Muxed accounts use cases",
    "short": "Voorbeelden, voordelen en beperkingen van M-adressen als hulpmiddel bij het in kaart brengen.",
    "desc": "Bedrijf - Voorbeeld\n\nInstallatie:\n- Een bedrijfs-G-account\n- Eén M-adres per klant/gebruiksdoel (ID)\n\nProces:\n- Klant betaalt naar hun M-adres\n- Alles gaat naar het bedrijfs-G-account\n- Boekhouding leest de ID -> unieke toewijzing\n\nGeschikt voor:\n- Winkels, betalingsproviders, beurzen\n- Interne referenties zonder memo-risico's\n\nVereniging - Voorbeeld\n\nInstallatie:\n- Een verenigings-G-account\n- M-adressen voor leden, afdelingen, doeleinden\n\nProces:\n- Bijdrage/donatie naar het juiste M-adres\n- Toewijzing via ID, geen memo-fouten\n\nGeschikt voor:\n- Lidmaatschapsgelden\n- Gelabelde inkomsten\n- Eenvoudige controle\n\nWaarin Muxed Accounts uitblinken:\n- Robuuste invoertoewijzing\n- Eén account, vele identiteiten\n- Geen memo-vereiste\n- Minder operationele fouten\n\nWat Muxed Accounts niet zijn:\n- Geen subaccounts\n- Geen individuele balans\n- Geen individuele trustlijnen\n- Geen individuele ondertekenaars/rechten\n\nMeestal ongeschikte gebruiksscenario's:\n- Salarisbetalingen/loonadministratie-accounts (benoetigen eigenes G-Konto)\n- Trust/Escrow voor derden (kein rechtlicher Vermoegenstrenner)\n- Op rollen gebaseerde beveiliging (keine getrennten Signer/Thresholds)\n- Begrotings- of limietscheiding (keine separaten Salden/Asset-Limits)\n- Naleving-gescheiden accounts (KYC/Reporting nicht sauber trennbar)\n\nVergelijking (Kurz):\nToewijzing van betalingen: Ja\nScheiding van activa: Nee\nToegang delegeren: Nee\nJuridisch gescheiden account: Nee\nInterne boekhouding: Ja\n\nBelangrijk om te onthouden:\nMuxed Accounts richten zich op betalingen - ze vervangen geen accounts.\nAls controle, eigendom of scheiding nodig is -> eigen G-account."
  },
  "multisig": {
    "title": "Multihandtekening",
    "original": "Multi‑Sig",
    "short": "Belangrijke acties vereisen meer dan alleen een handtekening.",
    "desc": "Multi-Sig staat voor meerdere handtekeningen. Een belangrijke actie vereist meer dan één sleutel. Voorbeeld: Jij en een tweede sleutel moeten beide instemmen voordat iets wordt verzonden. Dit maakt diefstal moeilijker.",
    "help": {
      "title": "Algemene uitleg van een multisignature (Multi-Signature) bedrijfsrekening",
      "intro": "Een bedrijf kan gebruikmaken van een gedeelde blockchain-account waarin meerdere bevoegde personen betrokken zijn. Typisch zijn er ten minste drie ondertekenaars (Signer) opgenomen, bijvoorbeeld het management, de financieel directeur en compliance/backup. Het doel is dat individuele personen zelfstandig betalingen kunnen uitvoeren zonder dat één persoon alleen de account kan controleren of overnemen.",
      "problem": "Als een ondertekenaar (Signer) voldoende gewicht heeft om betalingen uit te voeren en tegelijkertijd voldoende gewicht heeft voor wijzigingen in het account, kan die persoon andere ondertekenaars (Signer) verwijderen of de drempel/weging aanpassen (Thresholds) en zo de controle over het account overnemen. Omgekeerd zou de oorspronkelijke eigenaar ook niet gemakkelijk andere ondertekenaars (Signer) moeten kunnen uitsluiten zonder controles en balansen. Een multi-handtekeningstructuur zorgt ervoor dat belangrijke beslissingen altijd collectief door meerdere mensen worden genomen.",
      "setupTitle": "Voorbeeld van een veilige multi-handtekeningstructuur met drie ondertekenaars.",
      "setupWeights": "In een voorbeeld met drie gelijke rollen, ontvangen allen dezelfde ondertekeningssterkte:\n- Ondertekenaar (Signer) A (Management): Gewicht 2\n- Ondertekenaar (Signer) B (Finanzen): Gewicht 2\n- Ondertekenaar (Signer) C (Compliance/Backup): Gewicht 2",
      "setupThresholds": "Geschikte drempels/gewichten zijn als volgt ingesteld:\n- Laag (low_threshold): 1\n- Medium (med_threshold): 2 (for payments and other medium actions)\n- Hoog (high_threshold): 4 (voor structurele wijzigingen zoals het toevoegen/verwijderen van ondertekenaars (Signer) of het wijzigen van de drempel/gewicht (Thresholds))\n\nDit zorgt ervoor dat elke bevoegde persoon betalingen kan uitvoeren, maar dat geen enkele persoon alleen de accountstructuur kan wijzigen.",
      "behavior": "Met deze configuratie kunnen betalingen door elk van de drie bevoegde personen alleen worden uitgevoerd, omdat het gewicht van elk individu aan de middelhoge drempel voldoet. Voor structurele wijzigingen, zoals het verwijderen van een ondertekenaar, het aanpassen van de drempels/gewichten of het samenvoegen of sluiten van de rekening, is de hoge drempel vereist. Deze waarde kan alleen worden bereikt wanneer ten minste twee van de drie ondertekenaars samen ondertekenen. Deze opstelling houdt de rekening flexibel voor dagelijks gebruik en biedt tegelijkertijd sterke bescherming tegen misbruik.",
      "removal": "Wenn eine Person das Unternehmen verlässt oder nicht mehr vertrauenswürdig ist, können zwei der verbleibenden Unterzeichner (Signer) gemeinsam die Signaturrechte dieser Person entfernen. Kein einzelner Unterzeichner (Signer) – weder ein Mitarbeiter noch die Geschäftsführung – kann andere eigenständig aus dem Konto ausschließen. Der Entzug von Berechtigungen erfolgt also immer kontrolliert und nachvollziehbar durch mindestens zwei Verantwortliche.",
      "summary": "Dit type multisig-structuur stelt individuele partijen in staat om efficiënt betalingen te verwerken terwijl de controle over de rekening behouden blijft onder meerdere deelnemers. Het vermindert het risico op accountovernames, beschermt tegen unilaterale beslissingen, en is bijzonder geschikt voor zakelijke rekeningen waar zowel veiligheid als operationele flexibiliteit belangrijk zijn.",
      "closeLabel": "Dichtbij",
      "linkLabel": "Wat betekent Multi-Signature?",
      "glossaryLinkLabel": "Bekijk in woordenlijst"
    }
  },
  "multisigCorporate": {
    "title": "Multisignatuur - Voorbeeld",
    "original": "Multi-Signature - Example",
    "short": "Voorbeeld van een multi-handtekeningstructuur voor bedrijfsrekeningen met rollen, gewichten en drempels."
  },
  "trustline": {
    "title": "Trustline",
    "original": "Trustline",
    "short": "Overeenkomst om een token van een specifieke uitgever te houden.",
    "desc": "Een trustline is als een \"Ja, ik accepteer deze token.\" Door deze in te stellen, geef je aan dat je account klaar is om een specifieke token van een specifieke uitgever te ontvangen. Zonder een trustline kun je deze token niet ontvangen.\n\nVoorbeeld: Een trustline wordt gespecificeerd als CODE:ISSUER. Voor EURT van de uitgever GDUKMGUGDZQK6Y… zou het zijn EURT:GDUKMGUGDZQK6Y…"
  },
  "token": {
    "title": "Token",
    "original": "Token",
    "short": "Digitale eenheid – bijvoorbeeld geld, punten of tegoeden.",
    "desc": "Een token is een digitale eenheid op de blockchain. Een token kan geld, punten of kredieten voor een dienst vertegenwoordigen."
  },
  "asset": {
    "title": "Activum",
    "original": "Asset",
    "short": "Tokens op Stellar zijn altijd gekoppeld aan een uitgever.",
    "desc": "Op Stellar wordt een token een activum genoemd. Een activum is altijd gekoppeld aan een uitgeversaccount. Een account kan bijvoorbeeld een Euro-token uitgeven, en deze Euro-token wordt dan beschouwd als een activum."
  },
  "xlm": {
    "title": "Je suis een taalmodel getraind op gegevens tot en met oktober 2023.",
    "original": "XLM",
    "short": "Inheemse valuta van Stellar voor kosten en activatie.",
    "desc": "XLM is de native valuta van Stellar. Je hebt XLM nodig om kosten te betalen en om een nieuw account te starten."
  },
  "mainnet": {
    "title": "Mainnet",
    "original": "Mainnet",
    "short": "Echtes Stellar‑Netzwerk mit realem Wert.",
    "desc": "Het echte Stellar-netwerk met daadwerkelijke waarde. Transacties zijn definitief en kosten worden betaald in echte XLM."
  },
  "testnet": {
    "title": "Testnet",
    "original": "Testnet",
    "short": "Openbaar trainingsnetwerk zonder echte waarde.",
    "desc": "Een openbaar praktijknetwerk. Tokens hebben geen werkelijke waarde. Ideaal om te leren en experimenteren zonder risico."
  },
  "memo": {
    "title": "Memo",
    "original": "Memo",
    "short": "Korte notitie in een transactie.",
    "desc": "Een memo is een kleine notitie die je kunt meesturen met een transactie. Vaak vereist een beurs een specifiek memo om te weten aan wie het geld toebehoort."
  },
  "transaction": {
    "title": "Transactie",
    "original": "Transaction",
    "short": "Actie op de blockchain, bijvoorbeeld betaling of vertrouwenlijn.",
    "desc": "Een transactie is een actie op de blockchain, zoals het verzenden van geld of het opzetten van een vertrouwenslijn. Zodra deze is bevestigd, wordt een transactie permanent vastgelegd."
  },
  "fee": {
    "title": "Kosten",
    "original": "Fee",
    "short": "Zeer klein bedrag per transactie.",
    "desc": "De vergoeding is een zeer klein bedrag dat je bij elke transactie betaalt. De vergoeding gaat naar het netwerk. Op Stellar zijn de vergoedingen erg laag."
  },
  "ledger": {
    "title": "Grootboek",
    "original": "Ledger",
    "short": "Keten van bevestigde gegevens en saldi.",
    "desc": "Het grootboek is de keten van alle bevestigde gegevens. Het toont welke accounts hoeveel bevatten en welke transacties hebben plaatsgevonden. Iedereen kan het grootboek controleren."
  },
  "horizon": {
    "title": "Horizon",
    "original": "Horizon",
    "short": "API‑Dienst, über den Apps mit Stellar sprechen.",
    "desc": "Horizon is de dienst waarmee programma's communiceren met de Stellar-blockchain. Onze tool raadpleegt Horizon om rekeningoverzichten en transacties te laden."
  },
  "horizonHistory": {
    "title": "Horizon Geschiedenis",
    "original": "Horizon history depth",
    "short": "Beschrijft hoever terug de transactiegeschiedenis van openbare Horizon-servers reikt.",
    "desc": "De publieke Horizon-servers (Mainnet und Testnet) die worden beheerd door de Stellar Development Foundation bieden slechts een beperkte geschiedenis – momenteel ongeveer één jaar terugwerkend. Oudere gegevens kunnen niet meer worden opgevraagd via deze gratis eindpunten. Als je verder terug in de tijd moet gaan, heb je eigenlijk twee opties: (1) je kunt je eigen Horizon-node met volledige geschiedenis (inklusive History Archives) draaien, of (2) je kunt gebruikmaken van externe of betaalde diensten die langetermijngeschiedenis van Stellar-gegevens opslaan en verschaffen.",
    "seeAlso": "U hebt geen specifieke tekst om te vertalen verstrekt. Voer alstublieft de tekst in die u vertaald wilt hebben."
  },
  "anchor": {
    "title": "Anker",
    "original": "Anchor",
    "short": "Firma, die Fiat‑Geld mit Stellar verbindet.",
    "desc": "Een anchor is een bedrijf dat echt geld, zoals euro's of dollars, met Stellar verbindt. Bijvoorbeeld, je geeft de anchor euro's en ontvangt daarvoor een euro-token op Stellar."
  },
  "exchange": {
    "title": "Aandelenbeurs",
    "original": "Exchange",
    "short": "Plaats om tokens te kopen en verkopen.",
    "desc": "Een beurs is een plek waar je tokens kunt kopen of verkopen. Veel beurzen vereisen een KYC-proces, wat identiteitsverificatie betekent, voordat je geld in euro's of franken kunt opnemen."
  },
  "dex": {
    "title": "DEX (Decentralized Exchange)",
    "original": "Decentralized Exchange",
    "short": "Gedecentraliseerde uitwisseling direct op de blockchain.",
    "desc": "DEX staat voor Gedecentraliseerde Beurs. Hier handelen mensen direct met elkaar op de blockchain. Er is geen enkele operator. Stellar heeft een DEX die direct erin is ingebouwd."
  },
  "liquidityPool": {
    "title": "Liquiditeitspool",
    "original": "Liquidity Pool",
    "short": "Gemeenschappelijk pool met twee tokens voor directe uitwisseling.",
    "desc": "Een liquiditeitspool is een gedeelde pot met twee tokens. Mensen storten beide tokens erin. Anderen mogen deze tokens vervolgens direct ruilen. De storters verdienen in ruil daarvoor kleine vergoedingen."
  },
  "balanceClaimable": {
    "title": "Opvorderbaar saldo",
    "original": "Claimable Balance",
    "short": "Gereserveerd geld dat je nog moet ontvangen.",
    "desc": "Een opeisbaar saldo is geld dat al voor jou gereserveerd is, maar dat je nog moet opeisen. Het wordt pas aan je rekening bijgeschreven nadat je het accepteert."
  },
  "protocolUpdate": {
    "title": "Protocolbijwerking",
    "original": "Protocol Update",
    "short": "Aktualisierung der Netzwerk‑Regeln.",
    "desc": "Een protocolupdate is een upgrade van de regels in het Stellar-netwerk, zoals nieuwe functies of beveiligingswijzigingen. Alle knooppunten in het netwerk moeten dezelfde regels gebruiken."
  },
  "soroban": {
    "title": "Soroban",
    "original": "Soroban",
    "short": "Stellars Smart‑Contract‑System.",
    "desc": "Soroban is het smart contract systeem van Stellar. Een smart contract is programmacode op de blockchain. De code kan onafhankelijk regels verifiëren en acties activeren zonder de noodzaak van een tussenkomst van een bank."
  },
  "multiSignature": {
    "title": "Multisignatuur",
    "original": "Multi-Signature",
    "short": "Meerdere handtekeningen vereist; gewichten + drempel bepalen de vrijgave.",
    "desc": "In een multi-handtekening setup moeten meerdere sleutels tekenen voordat een actie geldig wordt. Elke ondertekenaar heeft een gewicht, en de som moet aan de vereiste drempelwaarde voldoen. Dit verhoogt de beveiliging omdat één gestolen sleutel niet voldoende is."
  },
  "signer": {
    "title": "Ondertekenaar",
    "original": "Signer",
    "short": "Openbare sleutel met gewicht, onderdeel van de accountconfiguratie.",
    "desc": "Een ondertekenaar is een publieke sleutel die bij een account hoort en een gewicht heeft. De handtekening telt mee voor de vereiste drempel. Meerdere ondertekenaars kunnen gezamenlijk een transactie autoriseren.\n\nOndertekenaars types:\n- ed25519 (standard key)\n- hashX (Hash-Vorlage)\n- preAuthTx (vorab autorisierte Transaktion)\n\nSKM ondersteunt alleen ed25519. Voor aanvullende opties, bezoek https://lab.stellar.org."
  },
  "thresholds": {
    "title": "Drempels",
    "original": "Thresholds",
    "short": "Limieten (low/med/high) die het vereiste totale gewicht bepalen.",
    "desc": "Drempels bepalen hoeveel gewogen handtekeningen nodig zijn voor acties: laag voor eenvoudige handelingen, middel voor betalingen en hoog voor kritische veranderingen. De som van de ondertekenaarsgewichten moet voldoen aan de respectieve drempelwaarde."
  },
  "masterWeight": {
    "title": "Meestergewicht",
    "original": "master_weight",
    "short": "Gewicht van de hoofdsleutel; bepaalt hoeveel belang de hoofdsleutel heeft.",
    "desc": "Het meestergewicht is het gewicht van de hoofdssleutel van een account. Een hoog meestergewicht stelt de hoofdssleutel in staat om veel acties zelfstandig te ondertekenen; een lage waarde vereist aanvullende ondertekenaars."
  },
  "accountConfig": {
    "title": "Accountconfiguratie",
    "original": "Account Configuration",
    "short": "De interactie tussen ondertekenaars en drempels bepaalt de veiligheid van de rekening.",
    "desc": "De accountconfiguratie bepaalt welke ondertekenaars bestaan met welke gewichten en welke drempels van toepassing zijn. Wijzigingen aan ondertekenaars of drempels zijn van cruciaal belang voor de beveiliging, omdat zij bepalen hoeveel handtekeningen vereist zijn."
  },
  "distributedNetwork": {
    "title": "Gedistribueerd netwerk",
    "original": "Distributed Network",
    "short": "Veel computers werken samen in plaats von één die alle beslissingen neemt.",
    "desc": "Stel je een markt voor waar veel handelaren dezelfde regels kennen. Als één deelnemer wegvalt, blijft het systeem draaien omdat anderen het kunnen overnemen. Dit houdt het systeem stabiel en moeilijker te manipuleren."
  },
  "node": {
    "title": "Knooppunt",
    "original": "Node",
    "short": "Een enkele deelnemer in het netwerk.",
    "desc": "Een knooppunt is als een boekhouder die een kopie van de gegevens bijhoudt. Het verifieert nieuwe invoer en geeft deze door. Veel knooppunten samen maken het netwerk betrouwbaar."
  },
  "block": {
    "title": "Blok",
    "original": "Block",
    "short": "Een blok is een bundel van invoeringen.",
    "desc": "Net als een pagina in een kasboek verzamelt een blok meerdere transacties. Zodra het vol is, wordt het afgesloten en aan de ketting toegevoegd. Dit creëert stap voor stap de geschiedenis."
  },
  "consensusMechanism": {
    "title": "Consensusmechanisme",
    "original": "Consensus Mechanism",
    "short": "Regels waarmee iedereen akkoord gaat over geldige invoer.",
    "desc": "Het is vergelijkbaar met wanneer een groep beslist welke bon geldig is. Dit voorkomt dat iemand in het geheim wijzigingen aanbrengt. Verschillende blockchains gebruiken verschillende werkwijzen, maar het doel is altijd consensus."
  },
  "finality": {
    "title": "Finaliteit / Definitiviteit",
    "original": "Finality",
    "short": "De zekerheid dat een transactie definitief is.",
    "desc": "Wanneer iets definitief is, voelt het als een bevestigde bankafschrift. Je hoeft niet langer te verwachten dat het wordt teruggedraaid. Dit creëert vertrouwen."
  },
  "immutability": {
    "title": "Onveranderlijkheid",
    "original": "Immutability",
    "short": "Invoer mag niet met terugwerkende kracht worden gewijzigd.",
    "desc": "Vergelijkbaar met een grootboek: Eventuele verwijderingen achteraf zijn merkbaar. Wijzigingen worden als een nieuwe invoer toegevoegd en niet overschreven. Dit maakt de geschiedenis traceerbaar."
  },
  "decentralization": {
    "title": "Decentralisatie",
    "original": "Decentralization",
    "short": "Geen centrale autoriteit beheerst alles.",
    "desc": "In plaats van een enkele kluis, zijn er veel kluizen met dezelfde informatie. Beslissingen ontstaan uit de interactie van veel deelnemers. Dit maakt het systeem robuuster."
  },
  "publicBlockchain": {
    "title": "Publieke blockchain",
    "original": "Public Blockchain",
    "short": "Open voor iedereen die wil deelnemen.",
    "desc": "Iedereen kan deelnemen en de gegevens bekijken, vergelijkbaar met een openbaar mededelingenbord. Dit verhoogt de transparantie, maar elke actie is voor iedereen zichtbaar. Regels zorgen ervoor dat niemand kan valsspelen."
  },
  "privateBlockchain": {
    "title": "Private blockchain",
    "original": "Private Blockchain",
    "short": "Toegang alleen voor geselecteerde deelnemers.",
    "desc": "Net als een kasboek van een bedrijf dat alleen door werknemers mag worden ingezien. Het kan sneller en meer gecontroleerd zijn, maar het is minder transparant. Vertrouwen wordt hier opgebouwd door de organisatie."
  },
  "permissionlessBlockchain": {
    "title": "Toestemmingsloze blockchain",
    "original": "Permissionless Blockchain",
    "short": "Iedereen mag zonder toestemming deelnemen.",
    "desc": "Zoals een markt waar iedereen aan kan deelnemen. Dit verlaagt de drempels, maar kan meer regels vereisen om eerlijk te blijven. Voorbeelden hiervan zijn veel openbare blockchains."
  },
  "permissionedBlockchain": {
    "title": "Permissioned blockchain",
    "original": "Permissioned Blockchain",
    "short": "Deelname alleen met toestemming.",
    "desc": "Zoals een club met een ledenlijst. Dit kan duidelijk verantwoordelijkheden creëren. Het is echter minder open."
  },
  "seedPhrase": {
    "title": "Restoratiestelling",
    "original": "Seed Phrase / Recovery Phrase",
    "short": "Een woordenlijst waarmee je je portemonnee kunt herstellen.",
    "desc": "Zij is als de reserve sleutel van je kluis. Degene die het heeft, kan je portemonnee herstellen. Het moet daarom nooit online worden opgeslagen."
  },
  "selfCustody": {
    "title": "Zelfbeheer",
    "original": "Self-Custody",
    "short": "Je bewaart je sleutels zelf.",
    "desc": "Zoals contant geld in je eigen kluis: je hebt de controle, maar ook de verantwoordelijkheid. Als je de toegang verliest, kan niemand helpen. Voor beginners is voorzichtigheid bijzonder belangrijk."
  },
  "custodian": {
    "title": "Bewaker",
    "original": "Custodian",
    "short": "Een dienstverlener bewaart je sleutels voor je.",
    "desc": "Zoals een bank die uw rekening beheert. Het kan handig zijn, maar het neemt de volledige controle van u weg. U moet erop vertrouwen."
  },
  "hardwareWallet": {
    "title": "Hardware wallet",
    "original": "Hardware Wallet",
    "short": "Een fysiek apparaat voor je sleutels.",
    "desc": "Als een kleine kluis in je zak. De sleutels blijven op het apparaat en gaan niet online. Dit beschermt tegen veel online aanvallen."
  },
  "hotWallet": {
    "title": "Hot wallet",
    "original": "Hot Wallet",
    "short": "Een portemonnee met internettoegang.",
    "desc": "Als een portemonnee in een jas: handig maar kwetsbaarder. Geschikt voor kleine bedragen en dagelijks gebruik. Niet ideaal voor grote sommen."
  },
  "coldWallet": {
    "title": "Cold wallet",
    "original": "Cold Wallet",
    "short": "Een portemonnee zonder internetverbinding.",
    "desc": "Als een kluis in de kelder. Zeer veilig, maar onpraktisch voor dagelijks gebruik. Geschikt voor langdurige opslag."
  },
  "cryptocurrency": {
    "title": "Cryptovaluta",
    "original": "Cryptocurrency",
    "short": "Digitale valuta die rechtstreeks tussen mensen wordt verstuurd.",
    "desc": "Als digitaal geld, maar zonder een bank. Je kunt het rechtstreeks naar anderen sturen. De waarde kan fluctueren."
  },
  "altcoin": {
    "title": "Altcoin",
    "original": "Altcoin",
    "short": "Alle cryptocurrencies behalve Bitcoin.",
    "desc": "Net als andere merken op de markt naast de dominante speler. Sommige zijn bekend, veel zijn klein. Kwaliteit en risico variëren sterk."
  },
  "stablecoin": {
    "title": "Stablecoin",
    "original": "Stablecoin",
    "short": "Cryptovaluta met een mogelijk stabiele waarde.",
    "desc": "Zoals digitaal geld dat gekoppeld is aan een standaardvaluta. Dit maakt de prijs stabieler. Echter, vertrouwen in de aanbieder blijft belangrijk."
  },
  "utilityToken": {
    "title": "Gebruikstoken",
    "original": "Utility Token",
    "short": "Een token dat kan worden gebruikt om toegang te krijgen tot een dienst.",
    "desc": "Zoals een tegoedbon op een marktkraam. Het biedt toegang of een korting. De waarde ervan hangt af van het nut van de dienst."
  },
  "securityToken": {
    "title": "Beveiligingstokens",
    "original": "Security Token",
    "short": "Een token met beveiligingseigenschappen.",
    "desc": "Net als een aandeelcertificaat. Het kan rechten of winsten beloven. Strengere regels zijn hier vaak van toepassing."
  },
  "governanceToken": {
    "title": "Governance-token",
    "original": "Governance Token",
    "short": "Een token om inspraak te hebben in regels.",
    "desc": "Zoals een stemkaart in een club. Degenen die tokens hebben, kunnen stemmen over regels. Dat betekent verantwoordelijkheid."
  },
  "liquidityToken": {
    "title": "Liquiditeitstokens / LP-tokens",
    "original": "Liquidity Token",
    "short": "Een token voor geleverde liquiditeit.",
    "desc": "Zoals een bonnetje dat laat zien dat je geld hebt bijgedragen aan een gezamenlijke pool. Je ontvangt proportionele vergoedingen. De waarde kan fluctueren."
  },
  "nft": {
    "title": "Niet-fungibele token / NFT",
    "original": "Non-Fungible Token",
    "short": "Een uniek digitaal token.",
    "desc": "Net als een ondertekend verzamelobject. Het vertegenwoordigt iets unieks, geen inwisselbare munt. De waarde hangt af van de vraag."
  },
  "cbdc": {
    "title": "Digitale valuta van de centrale bank / CBDC",
    "original": "Central Bank Digital Currency",
    "short": "Digitaal geld uitgegeven door een centrale bank.",
    "desc": "Als digitale staatliche Währung. Es wäre offizielles Geld, nur in digitaler Form. Die Einzelheiten hängen vom jeweiligen Land ab."
  },
  "transactionStatus": {
    "title": "Transactiestatus",
    "original": "Transaction Status",
    "short": "Geeft aan of een transactie nog open is of al is voltooid.",
    "desc": "Zoals pakkettracking: in behandeling, bevestigd of mislukt. Op deze manier kun je zien of alles gelukt is. Soms duurt het even."
  },
  "gasFee": {
    "title": "Gasprijs",
    "original": "Gas Fee",
    "short": "Een vergoeding voor rekentaken in het netwerk.",
    "desc": "Zoals een verwerkingskosten bij een marktkraam. Hoe drukker het is, hoe duurder het kan worden. Niet elke blockchain noemt het gas."
  },
  "onChain": {
    "title": "On-chain",
    "original": "On-Chain",
    "short": "Vindt rechtstreeks op de blockchain plaats.",
    "desc": "Net als een directe invoer in het grootboek. Iedereen kan het zien. Het is transparant, maar vaak langzamer of duurder."
  },
  "offChain": {
    "title": "Off-chain",
    "original": "Off-Chain",
    "short": "Vindt plaats buiten de blockchain.",
    "desc": "Zoals een mondelinge overeenkomst die later in het grootboek wordt vastgelegd. Dit kan sneller en kostenefficiënter zijn. Vertrouwen speelt hier een grotere rol."
  },
  "liquidity": {
    "title": "Liquiditeit",
    "original": "Liquidity",
    "short": "Toont hoe gemakkelijk iets kan worden afgehandeld.",
    "desc": "Het aantal kopers en verkopers dat er is. Hoge liquiditeit betekent dat je snel kunt handelen zonder de prijs significant te beïnvloeden. Lage liquiditeit voelt traag aan."
  },
  "volatility": {
    "title": "Volatiliteit",
    "original": "Volatility",
    "short": "Hoeveel prijzen schommelen.",
    "desc": "Net als een markt met wilde prijsschommelingen. Hoge volatiliteit betekent kansen, maar ook risico. Voor beginners kan dit stressvol zijn."
  },
  "marketCap": {
    "title": "Marktkapitalisatie",
    "original": "Market Capitalization",
    "short": "De totale waarde van een munt of project.",
    "desc": "Zoals de totale waarde van alle goederen in een markt. Het is ruwweg afgeleid van de prijs vermenigvuldigd met de circulerende hoeveelheid. Grote waarden lijken stabieler, maar dat zijn ze niet automatisch."
  },
  "circulatingSupply": {
    "title": "Circulatiehoeveelheid",
    "original": "Circulating Supply",
    "short": "De hoeveelheid munten die daadwerkelijk in omloop is.",
    "desc": "Zoals het aantal munten dat daadwerkelijk op de markt is. Niet alles wat bestaat is al in omloop. Dat beïnvloedt de prijs."
  },
  "priceDiscovery": {
    "title": "Prijsvorming",
    "original": "Price Discovery",
    "short": "Dit is hoe de prijs wordt bepaald door vraag en aanbod.",
    "desc": "Het is als een markt: vraag en aanbod komen samen. Veel kleine beslissingen bepalen de prijs. Er is geen vaste schakelaar."
  },
  "spread": {
    "title": "Handelsbereik",
    "original": "Spread",
    "short": "Het verschil tussen de aankoopprijs en de verkoopprijs.",
    "desc": "Zoals de bied-laatspread in een winkel. Hoe kleiner de kloof, hoe eerlijker het voelt. Grote spreads maken transacties duurder."
  },
  "phishing": {
    "title": "Phishing",
    "original": "Phishing",
    "short": "Fraude via nepnieuws of websites.",
    "desc": "Net als een nep bank-e-mail die je in een val lokt. Het doel is dat je je inloggegevens weggeeft. Klik nooit blindelings op links."
  },
  "smartContract": {
    "title": "Slim contract",
    "original": "Smart Contract",
    "short": "Een programma dat automatisch vaste regels uitvoert.",
    "desc": "Als een machine die volgens vaste regels reageert. Hij voert overeenkomsten automatisch uit. Dit bespaart vertrouwen maar vereist duidelijke regels."
  },
  "programmableLogic": {
    "title": "Geautomatiseerde regels",
    "original": "Programmable Logic",
    "short": "Regels die automatisch worden uitgevoerd wanneer er iets gebeurt.",
    "desc": "Net zoals een als-dan-regel in een automaat. Dit maakt het mogelijk om processen te beheersen zonder dat er elke keer handmatige tussenkomst nodig is. Zo worden eenvoudige digitale contracten gecreëerd."
  },
  "networkCongestion": {
    "title": "Netwerkgebruik",
    "original": "Network Congestion",
    "short": "Als er een groot aantal transacties tegelijkertijd in behandeling zijn.",
    "desc": "Net als een verkeersopstopping op de snelweg. Transacties duren langer en de kosten kunnen toenemen. Met minder verkeer gaat het weer sneller."
  },
  "blockchainTypes": {
    "title": "Typen van Blockchain",
    "original": "Blockchain Types",
    "short": "Er zijn verschillende soorten blockchains met verschillende doelen.",
    "desc": "Zoals verschillende voertuigtypen voor verschillende routes. Sommige zijn gebouwd voor betalingen, andere voor programma's. Het is de moeite waard om het doel te kennen."
  },
  "paymentBlockchain": {
    "title": "Betalingsblockchain",
    "original": "Payment Blockchain",
    "short": "Een blockchain ontworpen voor snelle betalingen.",
    "desc": "Als een snel kasboek voor geld. De focus ligt op goedkope en snelle overboekingen. Functies worden vaak opzettelijk eenvoudig gehouden."
  },
  "smartContractBlockchain": {
    "title": "Slim contract blockchain",
    "original": "Smart Contract Blockchain",
    "short": "Een blockchain die programma's en apps kan uitvoeren.",
    "desc": "Als een markt met veel verkoopautomaten. Naast betalingen kunnen daar regels en apps worden uitgevoerd. Dit maakt ze veelzijdig, maar vaak ook complexer."
  },
  "blockchainComparison": {
    "title": "Vergelijking van blockchains",
    "original": "Blockchain Comparison",
    "short": "Een vergelijking onthult de sterke en zwakke punten van verschillende blockchains.",
    "desc": "Net als de vergelijking van banken of markten: Elk heeft zijn sterke en zwakke punten. Belangrijke factoren zijn kosten, snelheid en veiligheid. Er is geen perfect systeem voor alles."
  },
  "stellarVsBitcoinVsEthereum": {
    "title": "Stellar versus Bitcoin versus Ethereum",
    "original": "Stellar vs. Bitcoin vs. Ethereum",
    "short": "Drie bekende blockchains met verschillende aandachtsgebieden.",
    "desc": "Bitcoin is als digitaal goud en wordt vaak gezien als een waardeopslag. Ethereum is als een platform voor programma's en apps. Stellar richt zich op betaalbare betalingen."
  },
  "missingKey": "Ontbrekend woordenlijst sleutel: {{detail}}"
}