{
  "pageTitle": "Woordenlijst",
  "pageIntro": "Hier vind je belangrijke woorden uit de blockchainwereld en het Stellar-netwerk. Alles wordt in eenvoudige termen uitgelegd.",
  "searchLabel": "Zoekterm",
  "searchPlaceholder": "Zoekterm (z. B. Konto, Account, Muxed)",
  "searchHint": "De zoekopdracht vindt woorden en verklaringen.",
  "noResults": "Geen overeenkomst.",
  "blockchain": {
    "title": "Blockchain",
    "original": "Blockchain",
    "short": "Gemeinsames digitales Kassenbuch – viele Computer speichern die gleichen Einträge.",
    "desc": "Een blockchain is als een digitaal grootboek. Veel computers slaan dezelfde gegevens op, zodat niemand stiekem iets kan veranderen."
  },
  "wallet": {
    "title": "Portemonnee",
    "original": "Wallet",
    "short": "Digitale portemonnee die je sleutels beheert.",
    "desc": "Een wallet is je digitale portemonnee. Het beheert de sleutels die je nodig hebt om toegang te krijgen tot je account en transacties te verzenden. Een wallet kan een programma, een app of zelfs gewoon een stuk papier met je privésleutel zijn."
  },
  "account": {
    "title": "Account",
    "original": "Account",
    "short": "Een blockchain-account kan activa bevatten en transacties verzenden.",
    "desc": "Een account is de plek op de blockchain waar je activa worden bewaard. Een account heeft een openbaar adres dat begint met een G. Meerdere wallets kunnen toegang krijgen tot hetzelfde account als ze de juiste sleutel hebben."
  },
  "addressG": {
    "title": "G-adres",
    "original": "G Address",
    "short": "De publieke sleutel (beginnt mit G) van een Stellar-account.",
    "desc": "Het G-adres is het hoofdadres van een Stellar-account. Het begint met de letter G. Je geeft het aan anderen zodat zij je iets kunnen sturen."
  },
  "publicKey": {
    "title": "Publieke sleutel",
    "original": "Public Key",
    "short": "Adresse, die du teilen darfst; bei Stellar meist die G‑Adresse.",
    "desc": "De publieke sleutel is het adres dat je mag delen. In Stellar is dit het G-adres. Anderen gebruiken het om je geld te sturen."
  },
  "privateKey": {
    "title": "Geheime sleutel",
    "original": "Secret Key",
    "short": "Wachtwoord van de account – nooit delen.",
    "desc": "De geheime sleutel is je wachtwoord voor de account. Iedereen die deze sleutel heeft, kan je geld verplaatsen. Deel het nooit."
  },
  "addressFederation": {
    "title": "Federatieadres",
    "original": "Federation Address",
    "short": "Kurze Adresse wie E‑Mail, zeigt auf eine G‑Adresse.",
    "desc": "Een federatieadres lijkt op een e-mail. Bijvoorbeeld: naam*domein.com. Dit korte adres verwijst naar een normaal G-adres. Het is gemakkelijker te onthouden."
  },
  "addressMuxed": {
    "title": "Gemengd account",
    "original": "Muxed Account",
    "short": "M‑address with additional ID – shares a base account.",
    "desc": "Een M-adres verwijst naar een bestaand Stellar-account, maar heeft een aanvullende unieke identificatie (ID). Dit maakt bijvoorbeeld de differentiatie mogelijk van meerdere personen of afdelingen onder hetzelfde G-adres. Technisch gezien behoren de fondsen nog steeds tot het hoofdaccount."
  },
  "multisig": {
    "title": "Multisignatuur",
    "original": "Multi‑Sig",
    "short": "Belangrijke acties vereisen meer dan alleen een handtekening.",
    "desc": "Multi-Sig staat voor meerdere handtekeningen. Een belangrijke actie vereist meer dan één sleutel. Bijvoorbeeld, jij en een tweede sleutel moeten allebei akkoord gaan voordat er iets verzonden kan worden. Dit maakt diefstal moeilijker."
  },
  "trustline": {
    "title": "Vertrouwenslijn",
    "original": "Trustline",
    "short": "Overeenkomst om een token van een specifieke uitgever aan te houden.",
    "desc": "Een trustline is als het zeggen van ja, ik accepteer deze token. Door dit te doen geef je aan dat je account klaar is om een specifieke token van een specifieke uitgever te houden. Zonder een trustline kun je deze token niet ontvangen.\n\nVoorbeeld: Een trustline wordt gespecificeerd als CODE:ISSUER. Voor EURT van de uitgever GDUKMGUGDZQK6Y… is het EURT:GDUKMGUGDZQK6Y…"
  },
  "token": {
    "title": "Token",
    "original": "Token",
    "short": "Digitale eenheid – bijvoorbeeld geld, punten of credits.",
    "desc": "Een token is een digitale eenheid op de blockchain. Een token kan geld, punten of krediet voor een dienst vertegenwoordigen."
  },
  "asset": {
    "title": "Activa",
    "original": "Asset",
    "short": "Tokens op Stellar zijn altijd gekoppeld aan de uitgever.",
    "desc": "Op Stellar wordt een token een activa genoemd. Een activa is altijd gekoppeld aan een uitgevende rekening. Bijvoorbeeld, een rekening kan een euro-token uitgeven. Dit euro-token is dan een activa."
  },
  "xlm": {
    "title": "XLM (Stellar Lumens)",
    "original": "XLM",
    "short": "De oorspronkelijke valuta van Stellar voor kosten en activatie.",
    "desc": "XLM is de native valuta van Stellar. Je hebt XLM nodig om vergoedingen te betalen en om een nieuw account te openen."
  },
  "mainnet": {
    "title": "Mainnet",
    "original": "Mainnet",
    "short": "Echt Stellar‑netwerk met echte waarde.",
    "desc": "Het echte Stellar-netwerk met daadwerkelijke waarde. Transacties zijn definitief en kosten worden betaald in echte XLM."
  },
  "testnet": {
    "title": "Testnet",
    "original": "Testnet",
    "short": "Openbaar praktijknetwerk zonder echte waarde.",
    "desc": "Een openbaar praktijknetwerk. Tokens hebben geen echte waarde. Ideaal om te leren en te experimenteren zonder risico."
  },
  "memo": {
    "title": "Memo",
    "original": "Memo",
    "short": "Korte notitie bij een transactie.",
    "desc": "Een memo is een kleine notitie die je kunt meesturen met een transactie. Vaak vereist een beurs een specifiek memo om te weten aan wie het geld toebehoort."
  },
  "transaction": {
    "title": "Transactie",
    "original": "Transaction",
    "short": "Actie op de blockchain, bijvoorbeeld betaling of vertrouwenslijn.",
    "desc": "Een transactie is een actie op de blockchain, zoals geld verzenden of een trustline opzetten. Een transactie wordt permanent opgeslagen zodra deze is bevestigd."
  },
  "fee": {
    "title": "Kosten",
    "original": "Fee",
    "short": "Zeer klein bedrag per transactie.",
    "desc": "De vergoeding is een zeer klein bedrag dat je bij elke transactie betaalt. De vergoeding gaat naar het netwerk. Op Stellar zijn de vergoedingen zeer klein."
  },
  "ledger": {
    "title": "Grootboek",
    "original": "Ledger",
    "short": "Keten van bevestigde gegevens en rekeningsaldi.",
    "desc": "De grootboek is de keten van alle bevestigde gegevens. Het toont welke rekeningen hoeveel bezitten en welke transacties hebben plaatsgevonden. Iedereen kan het grootboek controleren."
  },
  "horizon": {
    "title": "Horizon",
    "original": "Horizon",
    "short": "API‑dienst waarmee apps met Stellar communiceren.",
    "desc": "Horizon is de dienst waarmee programma's communiceren met de Stellar-blockchain. Onze tool bevraagt Horizon om rekeningbalansen en transacties op te halen."
  },
  "horizonHistory": {
    "title": "Horizon Geschiedenis",
    "original": "Horizon history depth",
    "short": "Beschrijft hoe ver de transactiegeschiedenis die door openbare Horizon-servers wordt verstrekt, teruggaat.",
    "desc": "Die von der Stellar Development Foundation betriebenen öffentlichen Horizon-Server (Mainnet und Testnet) stellen nur eine begrenzte Historie zur Verfügung – derzeit ungefähr ein Jahr rückwirkend. Ältere Daten sind über diese kostenlosen Endpunkte nicht mehr abrufbar. Wenn du weiter in die Vergangenheit zurück musst, hast du im Wesentlichen zwei Optionen: (1) du betreibst einen eigenen Horizon-Node mit vollständiger History (inklusive History Archives), oder (2) du nutzt Drittanbieter- bzw. Bezahldienste, die historische Stellar-Daten langfristig speichern und zur Verfügung stellen.",
    "seeAlso": "Je bent getraind op gegevens tot oktober 2023."
  },
  "anchor": {
    "title": "Anker",
    "original": "Anchor",
    "short": "Firma, die Fiat‑Geld mit Stellar verbindet.",
    "desc": "Een anchor is een bedrijf dat echt geld, zoals euro's of dollars, verbindt met Stellar. Bijvoorbeeld, je geeft de anchor euro's en ontvangt in ruil daarvoor een eurotoken op Stellar."
  },
  "exchange": {
    "title": "Effectenbeurs",
    "original": "Exchange",
    "short": "Plaats om tokens te kopen en verkopen.",
    "desc": "Een beurs is een plaats waar je tokens kunt kopen of verkopen. Veel beurzen vereisen een KYC-proces, wat betekent identiteitsverificatie, voordat je geld in euro's of franken kunt opnemen."
  },
  "dex": {
    "title": "DEX",
    "original": "Decentralized Exchange",
    "short": "Gedecentraliseerde uitwisseling rechtstreeks op de blockchain.",
    "desc": "DEX staat voor Decentralized Exchange. Hier handelen mensen rechtstreeks met elkaar op de blockchain. Er is geen enkele operator betrokken. Stellar heeft een DEX direct ingebouwd."
  },
  "liquidityPool": {
    "title": "Liquiditeitspool",
    "original": "Liquidity Pool",
    "short": "Gezamenlijk zwembad met twee tokens voor onmiddellijke uitwisseling.",
    "desc": "Een liquiditeitspool is een gedeelde pool die twee tokens bevat. Mensen storten beide tokens hierin. Anderen kunnen vervolgens deze tokens onmiddellijk uitwisselen. De storters verdienen kleine vergoedingen voor deze service."
  },
  "balanceClaimable": {
    "title": "Vorderbare Saldo",
    "original": "Claimable Balance",
    "short": "Gereserveerd geld dat je nog moet accepteren.",
    "desc": "Een opeisbaar saldo is geld dat al voor jou is gereserveerd, maar dat je nog moet opeisen. Pas wanneer je het accepteert, wordt het aan je account toegevoegd."
  },
  "protocolUpdate": {
    "title": "Protocolupdate",
    "original": "Protocol Update",
    "short": "Aktualisierung der Netzwerk‑Regeln.",
    "desc": "Een protocolupdate is een upgrade van de regels in het Stellar-netwerk, zoals nieuwe functies of beveiligingswijzigingen. Alle knooppunten in het netwerk moeten dezelfde regels gebruiken."
  },
  "soroban": {
    "title": "Soroban",
    "original": "Soroban",
    "short": "Het Smart‑Contract‑Systeem van Stellar.",
    "desc": "Soroban is het smart contract systeem van Stellar. Een smart contract is programmacode op de blockchain. De code kan zelfstandig regels verifiëren en acties starten zonder tussenkomst van een bank."
  },
  "multiSignature": {
    "title": "Multisignature (Multi-Signature)",
    "original": "Multi-Signature",
    "short": "Meerdere handtekeningen vereist; gewichten + drempel bepalen de vrijgave.",
    "desc": "In een multi-signature opstelling moeten meerdere sleutels ondertekenen voordat een actie geldig wordt. Elke ondertekenaar heeft een gewicht, en de som moet de vereiste drempel bereiken. Dit verhoogt de veiligheid, omdat een enkele gestolen sleutel niet voldoende is."
  },
  "signer": {
    "title": "Ondertekenaar (Signer)",
    "original": "Signer",
    "short": "Openbare sleutel met gewicht, onderdeel van de accountconfiguratie.",
    "desc": "Een ondertekenaar is een openbare sleutel die bij een account hoort en een gewicht heeft. De handtekening telt mee voor het vereiste drempelwaarde. Meerdere ondertekenaars kunnen gezamenlijk een transactie autoriseren."
  },
  "thresholds": {
    "title": "Drempels (Thresholds)",
    "original": "Thresholds",
    "short": "Limieten (low/med/high) die de vereiste som van gewichten bepalen.",
    "desc": "Drempelwaarden bepalen hoeveel gewogen handtekeningen nodig zijn voor acties: laag voor eenvoudige operaties, gemiddeld voor betalingen, hoog voor kritieke wijzigingen. De som van de gewichten van de ondertekenaars moet voldoen aan de betreffende drempelwaarde."
  },
  "masterWeight": {
    "title": "Mastergewicht (master_weight)",
    "original": "master_weight",
    "short": "Gewicht van de hoofdsleutel; bepaalt hoeveel de hoofdsleutel meetelt.",
    "desc": "Het hoofdsleutelgewicht is het gewicht van de hoofdsleutel van een account. Een hoog hoofdsleutelgewicht stelt de hoofdsleutel in staat om veel acties zelfstandig te ondertekenen; een lage waarde vereist aanvullende ondertekenaars."
  },
  "accountConfig": {
    "title": "Accountconfiguratie (Account Configuration)",
    "original": "Account Configuration",
    "short": "De wisselwerking tussen ondertekenaars en drempels bepaalt de beveiliging van de account.",
    "desc": "De accountconfiguratie specificeert welke ondertekenaars bestaan met welke gewichten en welke drempels van toepassing zijn. Wijzigingen in ondertekenaars of drempels zijn van cruciaal belang voor de beveiliging, omdat zij bepalen hoeveel handtekeningen vereist zijn."
  },
  "missingKey": "Ontbrekend woordenlijst item: {{detail}}",
  "distributedNetwork": {
    "title": "Gedistribueerd netwerk",
    "original": "Distributed Network",
    "short": "Veel computers werken samen in plaats van dat één alles bepaalt.",
    "desc": "Stel je een markt voor waar veel handelaren dezelfde regels kennen. Als één deelnemer wegvalt, blijft het functioneren omdat anderen het kunnen overnemen. Dit houdt het systeem stabiel en moeilijker te manipuleren."
  },
  "node": {
    "title": "Knooppunt",
    "original": "Node",
    "short": "Een enkele deelnemer in het netwerk.",
    "desc": "Een node is als een boekhouder die een kopie van de gegevens bijhoudt. Het controleert nieuwe invoer en stuurt deze door. Veel nodes samen maken het netwerk betrouwbaar."
  },
  "block": {
    "title": "Blok",
    "original": "Block",
    "short": "Een blok is een pakket van items.",
    "desc": "Als een pagina in een grootboek verzamelt een blok meerdere transacties. Zodra het vol is, wordt het afgerond en aan de keten toegevoegd. Zo wordt de geschiedenis stap voor stap gecreëerd."
  },
  "consensusMechanism": {
    "title": "Consensusmechanisme",
    "original": "Consensus Mechanism",
    "short": "Regels waarmee iedereen instemt over geldige inzendingen.",
    "desc": "Het is alsof een groep beslist welke bon geldig is. Dit voorkomt dat iemand stiekem wijzigingen aanbrengt. Verschillende blockchains gebruiken verschillende methoden, maar het doel is altijd consensus."
  },
  "finality": {
    "title": "Finaliteit / Definitiviteit",
    "original": "Finality",
    "short": "De garantie dat een transactie definitief is.",
    "desc": "Wanneer iets definitief is, voelt het als een vastgelegde bankafschrift. Je hoeft niet langer te verwachten dat het wordt teruggedraaid. Dit wekt vertrouwen."
  },
  "immutability": {
    "title": "Onveranderlijkheid",
    "original": "Immutability",
    "short": "Invoer mag niet met terugwerkende kracht worden gewijzigd.",
    "desc": "Net als bij een kasboek: Achteraf wissen valt op. Wijzigingen worden als een nieuwe invoer toegevoegd, niet overschreven. Hierdoor wordt de geschiedenis traceerbaar."
  },
  "decentralization": {
    "title": "Decentralisatie",
    "original": "Decentralization",
    "short": "Geen centrale autoriteit controleert alles.",
    "desc": "In plaats van een enkele kluis zijn er veel kluizen met dezelfde informatie. Beslissingen ontstaan uit de interactie van veel deelnemers. Dit maakt het systeem robuuster."
  },
  "publicBlockchain": {
    "title": "Openbare blockchain",
    "original": "Public Blockchain",
    "short": "Open voor iedereen die wil deelnemen.",
    "desc": "Iedereen kan deelnemen en de gegevens bekijken, vergelijkbaar met een openbaar mededelingenbord. Dit verhoogt de transparantie, maar elke actie is voor iedereen zichtbaar. Regels zorgen ervoor dat niemand kan valsspelen."
  },
  "privateBlockchain": {
    "title": "Private blockchain",
    "original": "Private Blockchain",
    "short": "Toegang alleen voor geselecteerde deelnemers.",
    "desc": "Zoals een bedrijfsboekhouding die alleen door werknemers mag worden bekeken. Dit kan sneller en gecontroleerder zijn, maar het is minder open. Vertrouwen wordt hier opgebouwd door de organisatie."
  },
  "permissionlessBlockchain": {
    "title": "Toestemmingsloze blockchain",
    "original": "Permissionless Blockchain",
    "short": "Iedereen mag deelnemen zonder toestemming.",
    "desc": "Zoals een markt waar iedereen aan kan deelnemen. Dit verlaagt de drempels, maar er kunnen meer regels nodig zijn om eerlijk te blijven. Voorbeelden hiervan zijn veel openbare blockchains."
  },
  "permissionedBlockchain": {
    "title": "Toegestane Blockchain",
    "original": "Permissioned Blockchain",
    "short": "Deelname alleen met toestemming.",
    "desc": "Zoals een club met een ledenlijst. Dit kan duidelijke verantwoordelijkheden creëren. Het is echter minder open."
  },
  "seedPhrase": {
    "title": "Herstellingstheorema",
    "original": "Seed Phrase / Recovery Phrase",
    "short": "Een woordenlijst die je kunt gebruiken om je portemonnee te herstellen.",
    "desc": "Zij is als de reservessleutel voor je kluis. Degene die hem heeft, kan je portemonnee herstellen. Daarom moet het nooit online worden opgeslagen."
  },
  "selfCustody": {
    "title": "Zelfbeheer",
    "original": "Self-Custody",
    "short": "Je houdt je sleutels zelf.",
    "desc": "Net zoals contant geld in je eigen kluis hebben: je hebt controle, maar ook de verantwoordelijkheid. Als je de toegang verliest, kan niemand je helpen. Voor beginners is voorzichtigheid bijzonder belangrijk."
  },
  "custodian": {
    "title": "Bewaarplaatsbeheerder",
    "original": "Custodian",
    "short": "Een dienstverlener bewaart uw sleutels voor u.",
    "desc": "Zoals een bank die uw rekening beheert. Het kan handig zijn, maar het neemt uw volledige controle weg. U moet erop vertrouwen."
  },
  "hardwareWallet": {
    "title": "Hardware wallet",
    "original": "Hardware Wallet",
    "short": "Een fysiek apparaat voor je sleutels.",
    "desc": "Als een kleine kluis in je zak. De sleutels blijven op het apparaat en gaan niet het internet op. Dit beschermt tegen veel online aanvallen."
  },
  "hotWallet": {
    "title": "Hot wallet",
    "original": "Hot Wallet",
    "short": "Een portemonnee met internettoegang.",
    "desc": "Als een portemonnee in de jas: handig maar kwetsbaarder. Geschikt voor kleine bedragen en dagelijks gebruik. Niet ideaal voor grote bedragen."
  },
  "coldWallet": {
    "title": "Koude portemonnee",
    "original": "Cold Wallet",
    "short": "Een portemonnee zonder internetverbinding.",
    "desc": "Als een kluis in de kelder. Zeer veilig, maar onpraktisch voor dagelijks gebruik. Geschikt voor langdurige opslag."
  },
  "cryptocurrency": {
    "title": "Cryptocurrency",
    "original": "Cryptocurrency",
    "short": "Digitale valuta die rechtstreeks tussen mensen wordt verzonden.",
    "desc": "Zoals digitaal contant geld, maar zonder een bank. Je kunt het rechtstreeks naar anderen sturen. De waarde kan fluctueren."
  },
  "altcoin": {
    "title": "Altcoin",
    "original": "Altcoin",
    "short": "Alle cryptovaluta's behalve Bitcoin.",
    "desc": "Net als andere merken op de markt naast de marktleider. Sommige zijn bekend, veel zijn klein. De kwaliteit en het risico variëren sterk."
  },
  "stablecoin": {
    "title": "Stablecoin",
    "original": "Stablecoin",
    "short": "Cryptocurrency met de meest stabiele waarde.",
    "desc": "Als digitaal geld dat is gekoppeld aan een conventionele valuta. Dit maakt de prijs stabieler. Toch is vertrouwen in de aanbieder belangrijk."
  },
  "utilityToken": {
    "title": "Gebruikstoken",
    "original": "Utility Token",
    "short": "Een token waarmee men een dienst kan gebruiken.",
    "desc": "Zoals een waardebon op een marktstalletje. Het biedt toegang of een korting. De waarde hangt af van het nut van de dienst."
  },
  "securityToken": {
    "title": "Beveiligingstokens",
    "original": "Security Token",
    "short": "Een token met beveiligingskenmerken.",
    "desc": "Net als een aandelenbewijs. Het kan rechten of winsten beloven. Vaak zijn er strengere regels van toepassing."
  },
  "governanceToken": {
    "title": "Governance-token",
    "original": "Governance Token",
    "short": "Een token voor deelname aan het besluitvormingsproces over regels.",
    "desc": "Zoals een stemkaart in een club. Degenen die tokens hebben, kunnen stemmen over de regels. Dat betekent verantwoordelijkheid."
  },
  "liquidityToken": {
    "title": "Liquiditeitstokens / LP-tokens",
    "original": "Liquidity Token",
    "short": "Een token voor geleverde liquiditeit.",
    "desc": "Het is als een bewijs dat je geld hebt bijgedragen aan een gezamenlijk fonds. Je ontvangt naar verhouding vergoedingen. De waarde kan fluctueren."
  },
  "nft": {
    "title": "Niet-fungibele token / NFT",
    "original": "Non-Fungible Token",
    "short": "Een uniek digitaal token.",
    "desc": "Net als een gesigneerd verzamelobject. Het vertegenwoordigt iets unieks, geen uitwisselbare munt. De waarde hangt af van de vraag."
  },
  "cbdc": {
    "title": "Digitale valuta van de centrale bank / CBDC",
    "original": "Central Bank Digital Currency",
    "short": "Digitale valuta uitgegeven door een centrale bank.",
    "desc": "Als digitale staatliche Währung. Het zou officieel geld zijn, maar dan in digitale vorm. Details zijn afhankelijk van het specifieke land."
  },
  "transactionStatus": {
    "title": "Transactiestatus",
    "original": "Transaction Status",
    "short": "Geeft aan of een transactie nog openstaat of al is voltooid.",
    "desc": "Net zoals het volgen van pakketten: in behandeling, bevestigd of mislukt. Hiermee kun je zien of alles soepel is verlopen. Soms duurt het even."
  },
  "gasFee": {
    "title": "Gaskosten",
    "original": "Gas Fee",
    "short": "Een vergoeding voor rekenwerk in het netwerk.",
    "desc": "Zoals een verwerkingsvergoeding bij een marktkraam. Hoe drukker het is, hoe duurder het kan worden. Niet elke blockchain noemt het gas."
  },
  "onChain": {
    "title": "On-Chain",
    "original": "On-Chain",
    "short": "Komt direct op de blockchain voor.",
    "desc": "Zoals een directe boeking in het kasboek. Iedereen kan het zien. Het is transparant, maar vaak langzamer of duurder."
  },
  "offChain": {
    "title": "Off-chain",
    "original": "Off-Chain",
    "short": "Vindt off-chain plaats.",
    "desc": "Zoals een mondelinge overeenkomst die later in het grootboek wordt vastgelegd. Dit kan sneller en kosteneffectiever zijn. Vertrouwen speelt hier een grotere rol."
  },
  "liquidity": {
    "title": "Liquiditeit",
    "original": "Liquidity",
    "short": "Toont hoe gemakkelijk iets kan worden afgehandeld.",
    "desc": "Het aantal kopers en verkopers. Hoge liquiditeit betekent dat je snel kunt handelen zonder de prijs aanzienlijk te beïnvloeden. Lage liquiditeit voelt traag aan."
  },
  "volatility": {
    "title": "Volatiliteit",
    "original": "Volatility",
    "short": "Hoeveel de prijzen fluctueren.",
    "desc": "Net als een markt met wilde prijsbewegingen. Hoge volatiliteit betekent kansen, maar ook risico. Voor beginners kan dit stressvol zijn."
  },
  "marketCap": {
    "title": "Marktkapitalisatie",
    "original": "Market Capitalization",
    "short": "De totale waarde van een munt of project.",
    "desc": "Zoals de totale waarde van alle goederen in een markt. Deze wordt ruwweg berekend door de prijs te vermenigvuldigen met de circulerende hoeveelheid. Grote waarden lijken misschien stabieler, maar dat zijn ze niet automatisch."
  },
  "circulatingSupply": {
    "title": "Circulatiehoeveelheid",
    "original": "Circulating Supply",
    "short": "Het aantal munten dat daadwerkelijk in omloop is.",
    "desc": "Zoals het aantal munten dat daadwerkelijk op de markt is. Niet alles wat bestaat is al in omloop. Dit beïnvloedt de prijs."
  },
  "priceDiscovery": {
    "title": "Prijzen",
    "original": "Price Discovery",
    "short": "De prijs wordt bepaald door vraag en aanbod.",
    "desc": "Net als op de markt: vraag en aanbod ontmoeten elkaar. Veel kleine beslissingen bepalen de prijs. Er is geen vaste schakelaar."
  },
  "spread": {
    "title": "Handelsbereik",
    "original": "Spread",
    "short": "Het verschil tussen de aanschafprijs en de verkoopprijs.",
    "desc": "Zoals de handelsmarge in een winkel. Hoe kleiner het verschil, des te eerlijker voelt het aan. Grote marges maken handel duurder."
  },
  "phishing": {
    "title": "Phishing",
    "original": "Phishing",
    "short": "Fraude via nepnieuws of websites.",
    "desc": "Zoals een nep-bank-e-mail die je in een val lokt. Het doel is dat je je inloggegevens prijsgeeft. Klik nooit blindelings op links."
  },
  "smartContract": {
    "title": "Slim contract",
    "original": "Smart Contract",
    "short": "Een programma dat automatisch vaste regels uitvoert.",
    "desc": "Als een automaat die reageert volgens vaste regels. Het voert overeenkomsten automatisch uit. Dit bespaart vertrouwen, maar vereist duidelijke regels."
  },
  "programmableLogic": {
    "title": "Geautomatiseerde regels",
    "original": "Programmable Logic",
    "short": "Regels die automatisch worden uitgevoerd wanneer er iets gebeurt.",
    "desc": "Zoals een if-then-regel in een automaat. Dit maakt het mogelijk om processen te beheersen zonder elke keer handmatige tussenkomst. Op deze manier worden eenvoudige digitale contracten opgesteld."
  },
  "networkCongestion": {
    "title": "Netwerkgebruik",
    "original": "Network Congestion",
    "short": "Wanneer een groot aantal transacties tegelijkertijd in behandeling is.",
    "desc": "Net als verkeersopstoppingen op de snelweg. Transacties duren langer en de kosten kunnen stijgen. Bij minder verkeer versnelt het weer."
  },
  "blockchainTypes": {
    "title": "Soorten Blockchain",
    "original": "Blockchain Types",
    "short": "Er zijn verschillende soorten blockchains met uiteenlopende doelstellingen.",
    "desc": "Zoals verschillende voertuigtypen voor verschillende routes. Sommige zijn gebouwd voor betalingen, andere voor programma's. Het is de moeite waard om het doel te kennen."
  },
  "paymentBlockchain": {
    "title": "Betalingsblockchain",
    "original": "Payment Blockchain",
    "short": "Een blockchain ontworpen voor snelle betalingen.",
    "desc": "Als een snelle kasboek. De focus ligt op goedkope en snelle overboekingen. Eigenschappen worden vaak opzettelijk eenvoudig gehouden."
  },
  "smartContractBlockchain": {
    "title": "Slim contract blockchain",
    "original": "Smart Contract Blockchain",
    "short": "Een blockchain die programma's en apps kan uitvoeren.",
    "desc": "Zoals een markt met veel machines. Naast betalingen kunnen daar ook regels en apps draaien. Dit maakt ze veelzijdig, maar vaak ook complexer."
  },
  "blockchainComparison": {
    "title": "Blockchain-vergelijking",
    "original": "Blockchain Comparison",
    "short": "Een vergelijking onthult de sterke en zwakke punten van verschillende blockchains.",
    "desc": "Zoals het vergelijken van banken of markten: Elk heeft zijn sterke en zwakke punten. Belangrijke aspecten zijn kosten, snelheid en veiligheid. Er is geen perfect systeem voor alles."
  },
  "stellarVsBitcoinVsEthereum": {
    "title": "Stellar vs. Bitcoin vs. Ethereum",
    "original": "Stellar vs. Bitcoin vs. Ethereum",
    "short": "Drie bekende blockchains met verschillende focusgebieden.",
    "desc": "Bitcoin is als digitaal goud en wordt vaak gezien als een waardereserve. Ethereum is als een platform voor programma's en apps. Stellar richt zich sterk op betaalbare betalingen."
  }
}