{
  "pageTitle": "Verklarende woordenlijst",
  "pageIntro": "Hier vind je belangrijke woorden uit de blockchainwereld en het Stellar-netwerk. Alles wordt in eenvoudige termen uitgelegd.",
  "searchLabel": "Zoekterm",
  "searchPlaceholder": "Zoek naar term (bijv. account, Muxed)",
  "searchHint": "De zoekopdracht vindt woorden en verklaringen.",
  "noResults": "Geen match.",
  "blockchain": {
    "title": "Blockchain",
    "original": "Blockchain",
    "short": "Gedeeld digitaal grootboek – veel computers slaan dezelfde invoeringen op.",
    "desc": "Een blockchain is als een digitaal grootboek. Veel computers slaan dezelfde gegevens op, zodat niemand stiekem iets kan veranderen."
  },
  "wallet": {
    "title": "Portemonnee",
    "original": "Wallet",
    "short": "Digitale portefeuille die uw sleutels beheert.",
    "desc": "Een wallet is je digitale portemonnee. Het beheert de sleutels die je nodig hebt om toegang te krijgen tot je account en transacties te versturen. Een wallet kan een programma, een app of zelfs gewoon een stuk papier met je private sleutel zijn."
  },
  "account": {
    "title": "Account",
    "original": "Account",
    "short": "Een blockchain-account kan activa bevatten en transacties verzenden.",
    "desc": "Een account is de locatie op de blockchain waar je activa worden opgeslagen. Een account heeft een openbaar adres dat begint met een G. Meerdere wallets kunnen toegang krijgen tot hetzelfde account als ze de juiste sleutel hebben."
  },
  "addressG": {
    "title": "G-adres",
    "original": "G Address",
    "short": "Het openbare hoofdadres van een Stellar-account (begint met een G).",
    "desc": "Het G-adres is het hoofdadres van een Stellar-account. Het begint met de letter G. Je geeft het aan anderen zodat zij je iets kunnen sturen."
  },
  "publicKey": {
    "title": "Openbare sleutel",
    "original": "Public Key",
    "short": "Adres dat je kunt delen; meestal het G-adres voor Stellar.",
    "desc": "De openbare sleutel is het adres dat je kunt delen. In Stellar is dit het G-adres. Anderen gebruiken het om je geld te sturen."
  },
  "privateKey": {
    "title": "Geheime sleutel",
    "original": "Secret Key",
    "short": "Wachtwoord voor het account – nooit delen.",
    "desc": "De geheime sleutel is je wachtwoord voor de account. Degene die deze sleutel heeft, kan je geld verplaatsen. Deel het nooit."
  },
  "addressFederation": {
    "title": "Federatieadres",
    "original": "Federation Address",
    "short": "Kort adres zoals een e-mailadres wijst naar een G-adres.",
    "desc": "Een federatieadres lijkt op een e-mailadres. Voorbeeld: naam*domein.com. Dit korte adres wijst naar een regulier G-adres. Het is gemakkelijker te onthouden."
  },
  "addressMuxed": {
    "title": "Gemengd account",
    "original": "Muxed Account",
    "short": "M-adres met extra ID – deelt een basisaccount.",
    "desc": "Een M-adres verwijst naar een bestaande Stellar-account, maar heeft een extra nummer (ID). Dit maakt het mogelijk om bijvoorbeeld verschillende personen of afdelingen onder hetzelfde G-adres te onderscheiden. Technisch gezien behoort het geld nog steeds tot de hoofdaccount."
  },
  "multisig": {
    "title": "Multi-handtekening",
    "original": "Multi‑Sig",
    "short": "Belangrijke handelingen vereisen meer dan een handtekening.",
    "desc": "Multi-Sig staat voor meerdere handtekeningen. Een belangrijke handeling vereist meer dan één sleutel. Bijvoorbeeld, jij en een tweede sleutel moeten beide akkoord gaan voordat er iets kan worden verzonden. Dit maakt diefstal moeilijker."
  },
  "trustline": {
    "title": "Trustline",
    "original": "Trustline",
    "short": "Toestemming om een token van een specifieke uitgever te houden.",
    "desc": "Een trustline is als een \"ja, ik accepteer deze token.\" Hiermee geef je aan dat je account klaar is om een specifieke token van een specifieke uitgever te houden. Zonder een trustline kun je deze token niet ontvangen.\n\nVoorbeeld: Een trustline wordt gespecificeerd als CODE:ISSUER. Voor EURT van de uitgever GDUKMGUGDZQK6Y… is het EURT:GDUKMGUGDZQK6Y…."
  },
  "token": {
    "title": "Token",
    "original": "Token",
    "short": "Digitale eenheid – bijvoorbeeld geld, punten of krediet.",
    "desc": "Een token is een digitale eenheid op de blockchain. Een token kan geld, punten of credits voor een dienst vertegenwoordigen."
  },
  "asset": {
    "title": "Middel",
    "original": "Asset",
    "short": "Tokens op Stellar zijn altijd gekoppeld aan een uitgever.",
    "desc": "Op Stellar wordt een token een actief genoemd. Een actief is altijd gekoppeld aan een uitgeversaccount. Bijvoorbeeld, een account kan een Euro-token uitgeven. Dit Euro-token is dan een actief."
  },
  "xlm": {
    "title": "Ik ben getraind op gegevens tot oktober 2023.",
    "original": "XLM",
    "short": "Inheemse valuta van Stellar voor kosten en activatie.",
    "desc": "XLM is de native valuta van Stellar. Je hebt XLM nodig om vergoedingen te betalen en om een nieuw account aan te maken."
  },
  "mainnet": {
    "title": "Hoofdnet",
    "original": "Mainnet",
    "short": "Echt Stellar-netwerk met daadwerkelijke waarde.",
    "desc": "Het echte Stellar-netwerk met werkelijke waarde. Transacties zijn definitief en de kosten worden betaald in echte XLM."
  },
  "testnet": {
    "title": "Testnet",
    "original": "Testnet",
    "short": "Publiek trainingsnetwerk zonder echte waarde.",
    "desc": "Een openbaar praktijknetwerk. Tokens hebben geen echte waarde. Ideaal voor leren en experimenteren zonder risico."
  },
  "memo": {
    "title": "Memo",
    "original": "Memo",
    "short": "Korte notitie in een transactie.",
    "desc": "Een memo is een kleine notitie die je kunt meesturen met een transactie. Vaak vereist een beurs een specifieke memo zodat ze weten aan wie het geld toebehoort."
  },
  "transaction": {
    "title": "Transactie",
    "original": "Transaction",
    "short": "Actie op de blockchain, bijvoorbeeld betaling of trustlijn.",
    "desc": "Een transactie is een actie op de blockchain, zoals het versturen van geld of het creëren van een trustline. Een transactie wordt permanent opgeslagen zodra deze is bevestigd."
  },
  "fee": {
    "title": "Kosten",
    "original": "Fee",
    "short": "Zeer klein bedrag per transactie.",
    "desc": "De vergoeding is een zeer klein bedrag dat je bij elke transactie betaalt. De vergoeding gaat naar het netwerk. Op Stellar zijn de vergoedingen zeer klein."
  },
  "ledger": {
    "title": "Grootboek",
    "original": "Ledger",
    "short": "Keten van bevestigde gegevens en rekeningstanden.",
    "desc": "Het grootboek is de keten van alle bevestigde gegevens. Het toont welke accounts hoeveel bezitten en welke transacties hebben plaatsgevonden. Iedereen kan het grootboek controleren."
  },
  "horizon": {
    "title": "Horizon",
    "original": "Horizon",
    "short": "API-service waardoor apps communiceren met Stellar.",
    "desc": "Horizon is de dienst waarmee programma's communiceren met de Stellar Blockchain. Onze tool bevraagt Horizon om rekeningsaldi en transacties te laden."
  },
  "anchor": {
    "title": "Anker",
    "original": "Anchor",
    "short": "Bedrijf dat fiatgeld verbindt met Stellar.",
    "desc": "Een anchor is een bedrijf dat echt geld, zoals euro's of dollars, verbindt met Stellar. Bijvoorbeeld, je geeft de anchor euro's, en in ruil daarvoor ontvang je een euro-token op Stellar."
  },
  "exchange": {
    "title": "Beurs",
    "original": "Exchange",
    "short": "Plaats om tokens te kopen en verkopen.",
    "desc": "Een beurs is een plek waar je tokens kunt kopen of verkopen. Veel beurzen vereisen een KYC-procedure, wat een identiteitsverificatie is, voordat je geld in euro’s of franken kunt opnemen."
  },
  "dex": {
    "title": "DEX",
    "original": "Decentralized Exchange",
    "short": "Gedecentraliseerde uitwisseling direct op de blockchain.",
    "desc": "DEX staat voor Decentralized Exchange. Hier handelen mensen rechtstreeks met elkaar op de blockchain. Er is geen centrale operator. Stellar heeft een DEX die direct is ingebouwd."
  },
  "liquidityPool": {
    "title": "Liquiditeitspool",
    "original": "Liquidity Pool",
    "short": "Gemeenschappelijk zwembad met twee tokens voor onmiddellijke uitwisseling.",
    "desc": "Een liquiditeitspool is een gedeeld pool met twee tokens. Mensen dragen beide tokens bij aan de pool. Anderen kunnen deze tokens vervolgens direct wisselen. De bijdragers verdienen in ruil daarvoor kleine vergoedingen."
  },
  "balanceClaimable": {
    "title": "Claimbare saldo",
    "original": "Claimable Balance",
    "short": "Gereserveerd geld dat je nog moet accepteren.",
    "desc": "Een opeisbaar saldo is geld dat al voor jou gereserveerd is, maar je moet het nog opeisen. Pas wanneer je het accepteert, wordt het op je rekening bijgeschreven."
  },
  "protocolUpdate": {
    "title": "Protocol-update",
    "original": "Protocol Update",
    "short": "De netwerkregels bijwerken.",
    "desc": "Een protocolupdate is een upgrade van de regels in het Stellar-netwerk. Bijvoorbeeld nieuwe functies of veiligheidswijzigingen. Alle nodes in het netwerk moeten dezelfde regels gebruiken."
  },
  "soroban": {
    "title": "Soroban",
    "original": "Soroban",
    "short": "Het slimme contractensysteem van Stellar.",
    "desc": "Soroban is het smart contractsysteem van Stellar. Een smart contract is programmatuur op de blockchain. De code kan zelfstandig regels verifiëren en acties uitvoeren zonder dat er een bank tussenkomt."
  },
  "missingKey": "Missende verklarende woordenlijst sleutel: {{detail}}",
  "multiSignature": {
    "title": "Multisignature (Multi-Signature)",
    "original": "Multi-Signature",
    "short": "Meerdere handtekeningen vereist; gewichten + drempel bepalen de goedkeuring.",
    "desc": "In een multi-signature opstelling moeten meerdere sleutels ondertekenen voordat een actie geldig wordt. Elke ondertekenaar heeft een gewicht en de som moet de vereiste drempel bereiken. Dit verhoogt de beveiliging omdat een enkele gestolen sleutel niet voldoende is."
  },
  "signer": {
    "title": "Ondertekenaar (Signer)",
    "original": "Signer",
    "short": "Openbare sleutel met gewicht, onderdeel van de accountconfiguratie.",
    "desc": "Een ondertekenaar is een openbare sleutel die toebehoort aan een account en heeft een gewicht. De handtekening telt mee voor de vereiste drempel. Meerdere ondertekenaars kunnen gezamenlijk een transactie autoriseren."
  },
  "thresholds": {
    "title": "Drempels (Thresholds)",
    "original": "Thresholds",
    "short": "Limieten (low/med/high) die de noodzakelijke gewichtsoptelsom bepalen.",
    "desc": "Drempels bepalen hoeveel gewogen handtekeningen nodig zijn voor acties: laag voor eenvoudige operaties, gemiddeld voor betalingen, hoog voor kritieke veranderingen. De som van de ondertekenaarsgewichten moet de respectieve drempel bereiken."
  },
  "masterWeight": {
    "title": "Mastergewicht (master_weight)",
    "original": "master_weight",
    "short": "Gewicht van de hoofdsleutel; bepaalt hoe sterk de hoofdsleutel wordt meegeteld.",
    "desc": "Het hoofdgewicht is het gewicht van de hoofd sleutel van een account. Een hoog hoofdgewicht stelt de hoofdsleutel in staat om veel handelingen zelf te ondertekenen; een lage waarde vereist extra ondertekenaars."
  },
  "accountConfig": {
    "title": "Accountconfiguratie (Account Configuration)",
    "original": "Account Configuration",
    "short": "De wisselwerking tussen ondertekenaars en drempelwaarden bepaalt de beveiliging van de rekening.",
    "desc": "De accountconfiguratie specificeert welke ondertekenaars er zijn met welke gewichten en welke drempels van toepassing zijn. Wijzigingen in ondertekenaars of drempels zijn cruciaal voor de veiligheid, aangezien ze bepalen hoeveel handtekeningen er vereist zijn."
  },
  "horizonHistory": {
    "title": "Horizongeschiedenis",
    "original": "Horizon history depth",
    "short": "Beschrijft hoe ver terug de transactiegeschiedenis gaat die door openbare Horizon-servers wordt geleverd.",
    "desc": "De openbare Horizon-servers (Mainnet und Testnet) beheerd door de Stellar Development Foundation bieden slechts een beperkte geschiedenis aan – momenteel ongeveer één jaar terug. Oudere gegevens zijn niet meer toegankelijk via deze gratis eindpunten. Als je verder terug in de tijd moet, heb je in wezen twee opties: (1) je beheert je eigen Horizon-node met volledige geschiedenis (inklusive History Archives), of (2) je maakt gebruik van derde partijen of betaalde diensten die historische Stellar-gegevens langdurig opslaan en beschikbaar stellen.",
    "seeAlso": "Ik ben getraind op gegevens tot oktober 2023."
  }
}