{
  "title": "Algemene uitleg over een multisignature (Multi-Signature) zakelijke rekening",
  "intro": "Een bedrijf kan een gedeelde blockchain-rekening gebruiken waarbij meerdere bevoegde personen betrokken zijn. Doorgaans zijn er minimaal drie ondertekenaars (Signer) bij betrokken, bijvoorbeeld het management, financieel directeur en compliance/backup. Het doel is dat individuele personen zelfstandig betalingen kunnen uitvoeren, zonder dat één enkele persoon de rekening alleen kan beheersen of overnemen.",
  "problem": "Als een ondertekenaar (Signer) genoeg gewicht heeft om betalingen uit te voeren en tegelijkertijd genoeg gewicht heeft voor accountwijzigingen, kan deze persoon andere ondertekenaars (Signer) verwijderen of de drempel/weging (Thresholds) aanpassen en daarmee het account overnemen. Omgekeerd zou de oorspronkelijke eigenaar niet gemakkelijk andere ondertekenaars (Signer) moeten kunnen uitsluiten zonder checks and balances. Een multi-handtekening structuur zorgt ervoor dat belangrijke besluiten altijd gezamenlijk door meerdere personen worden genomen.",
  "setupTitle": "Voorbeeld van een veilige multi-signature structuur met drie ondertekenaars",
  "setupWeights": "In een voorbeeld met drie even belangrijke rollen ontvangen allen dezelfde handtekeningsterkte:\n- Ondertekenaar (Signer) A (Management): Gewicht 2\n- Ondertekenaar (Signer) B (Finanzen): Gewicht 2\n- Ondertekenaar (Signer) C (Compliance/Backup): Gewicht 2",
  "setupThresholds": "Geschikte drempels/gewichten zijn ingesteld:\n- Laag (low_threshold): 1\n- Medium (med_threshold): 2 (for payments and other medium actions)\n- Hoog (high_threshold): 4 (voor structurele veranderingen zoals het toevoegen/verwijderen van ondertekenaars (Signer) of het wijzigen van de drempel/gewicht (Thresholds))\nDit stelt elke bevoegd persoon in staat betalingen uit te voeren, maar geen enkele persoon kan zelfstandig de accountstructuur wijzigen.",
  "behavior": "Met deze configuratie kunnen betalingen door elk van de drie geautoriseerde personen alleen worden uitgevoerd, aangezien het individuele gewicht altijd aan de middelste drempel/Drempel voldoet. Voor structurele veranderingen zoals het verwijderen van een ondertekenaar/Ondertekenaars, het aanpassen van de drempels/gewichten, of het samenvoegen of sluiten van de rekening, is de hoge drempel/hoge_drempel vereist. Deze waarde kan alleen worden bereikt als ten minste twee van de drie ondertekenaars/Ondertekenaars samen tekenen. Op deze manier blijft de rekening flexibel in dagelijks gebruik terwijl deze goed beschermd is tegen misbruik.",
  "removal": "Wanneer een persoon het bedrijf verlaat of niet langer betrouwbaar is, kunnen twee van de overgebleven ondertekenaars (Signer) gezamenlijk de handtekenrechten van deze persoon verwijderen. Geen enkele ondertekenaar (Signer) – noch een werknemer, noch het management – kan anderen zelfstandig van de rekening uitsluiten. Het intrekken van bevoegdheden gebeurt dus altijd gecontroleerd en transparant door minimaal twee verantwoordelijken.",
  "summary": "Dit type multisignatuurstructuur stelt individuele personen in staat om betalingen efficiënt te verwerken, terwijl de controle van de rekening bij meerdere partijen blijft. Het vermindert het risico op overname van de rekening, beschermt tegen unilaterale beslissingen en is bijzonder geschikt voor bedrijfsrekeningen waar zowel veiligheid als operationele flexibiliteit belangrijk zijn.",
  "closeLabel": "Dichtbij",
  "linkLabel": "Wat betekent multi-signature?"
}