{
  "title": "Algemene uitleg van een multi-handtekening (Multi-Signature) zakelijke rekening",
  "intro": "Een bedrijf kan een gezamenlijke blockchain-rekening gebruiken waarbij meerdere bevoegde personen betrokken zijn. Meestal zijn minstens drie ondertekenaars (Signer) betrokken, zoals het management, de financieel verantwoordelijk persoon, en de naleving/reserve. Het doel is dat de afzonderlijke personen onafhankelijk betalingen kunnen uitvoeren zonder dat één persoon de enige controle over of het beheer van de rekening heeft.",
  "problem": "Als een ondertekenaar (Signer) genoeg gewicht heeft om betalingen uit te voeren en tegelijkertijd genoeg gewicht voor accountwijzigingen, zou die persoon andere ondertekenaars (Signer) kunnen verwijderen of de drempel/weging (Thresholds) kunnen aanpassen en zo de rekening overnemen. Omgekeerd mag de oorspronkelijke eigenaar ook niet in staat zijn om andere ondertekenaars (Signer) uit te sluiten zonder checks and balances. Een multi-sig structuur zorgt ervoor dat belangrijke beslissingen altijd gezamenlijk door meerdere mensen worden ondersteund.",
  "setupTitle": "Voorbeeld van een veilige multi-sig structuur met drie ondertekenaars.",
  "setupWeights": "In een voorbeeld met drie equivalente rollen, ontvangen allen dezelfde handtekeningsterkte:\n- Ondertekenaar (Signer) A (management): gewicht 2\n- Ondertekenaar (Signer) B (Finanzen): gewicht 2\n- Ondertekenaar (Signer) C (Compliance/Backup): gewicht 2",
  "setupThresholds": "Geschikte drempels/wegingen zijn ingesteld:\n- Laag (low_threshold): 1\n- Medium (med_threshold): 2 (for payments and other medium actions)\n- Hoog (high_threshold): 4 (voor structurele wijzigingen zoals het toevoegen/verwijderen van ondertekenaars (Signer) of het wijzigen van de drempel/weging (Thresholds))\nDeze opstelling stelt elke gemachtigde persoon in staat betalingen uit te voeren, maar geen enkele persoon kan alleen de accountstructuur wijzigen.",
  "behavior": "Met deze configuratie kunnen betalingen individueel worden uitgevoerd door elk van de drie geautoriseerde personen, omdat het gewicht van elk individu aan de gemiddelde drempel/weging (Threshold) voldoet. Voor structurele wijzigingen, zoals het verwijderen van een ondertekenaar (Signers), het aanpassen van de drempels/wegingen, of het samenvoegen of sluiten van de rekening, is de hoge drempel/weging (high_threshold) vereist. Deze waarde kan alleen worden bereikt als ten minste twee van de drie ondertekenaars (Signer) samen tekenen. Op deze manier blijft de rekening flexibel voor dagelijks gebruik en is hij goed beschermd tegen misbruik.",
  "removal": "Als een persoon het bedrijf verlaat of niet meer betrouwbaar is, kunnen twee van de overgebleven ondertekenaars (Signer) samen de handtekeningrechten van deze persoon verwijderen. Geen enkele individuele ondertekenaar (Signer) – noch een medewerker, noch het management – kan anderen zelfstandig van de rekening uitsluiten. Het intrekken van bevoegdheden gebeurt dus altijd gecontroleerd en traceerbaar door minstens twee verantwoordelijken.",
  "summary": "Dit soort multi-handtekeningenstructuur stelt individuele personen in staat om betalingen efficiënt te verwerken, terwijl de controle over de rekening in handen van meerdere partijen blijft. Het vermindert het risico op overnames van rekeningen, beschermt tegen unilaterale beslissingen en is bijzonder geschikt voor bedrijfsrekeningen waar zowel beveiliging als operationele flexibiliteit belangrijk zijn.",
  "closeLabel": "Sluiten",
  "linkLabel": "Wat betekent Multi-Signature?"
}