{
  "title": "Algemene uitleg van een Multi-Signature-bedrijfsrekening met meerdere handtekeningen.",
  "intro": "Een bedrijf kan gebruik maken van een gedeelde blockchain-account die meerdere bevoegde personen betreft. Meestal zijn er ten minste drie ondertekenaars (Signer) bij betrokken, zoals management, financieel medewerker en naleving/backup. Het doel is dat individuen zelfstandig betalingen kunnen uitvoeren, zonder dat één enkele persoon de account alleen kan beheren of overnemen.",
  "problem": "Als een ondertekenaar (Signer) genoeg gewicht heeft om betalingen uit te voeren en tegelijkertijd genoeg gewicht voor accountwijzigingen, kan deze persoon andere ondertekenaars (Signer) verwijderen of de drempel/weging aanpassen (Thresholds), waardoor hij de account kan overnemen. Omgekeerd moet de oorspronkelijke eigenaar niet in staat zijn om andere ondertekenaars (Signer) zomaar uit te sluiten zonder checks and balances. Een multi-sig-structuur zorgt ervoor dat belangrijke beslissingen altijd gezamenlijk door meerdere personen worden ondersteund.",
  "setupTitle": "Voorbeeld van een veilige multi-handtekeningenstructuur met drie ondertekenaars.",
  "setupWeights": "In een voorbeeld met drie gelijke rollen, ontvangen alle dezelfde handtekeningsterkte:\n- Ondertekenaar (Signer) A (management): gewicht 2\n- Ondertekenaar (Signer) B (Finanzen): gewicht 2\n- Ondertekenaar (Signer) C (Compliance/Backup): gewicht 2",
  "setupThresholds": "Geschikte drempels/wegingen worden als volgt ingesteld:\n- Laag (low_threshold): 1\n- Medium (med_threshold): 2 (for payments and other medium actions)\n- Hoog (high_threshold): 4 (voor structurele veranderingen zoals het toevoegen/verwijderen van ondertekenaars (Signer) of het veranderen van de drempel/weging (Thresholds))\nDit stelt elke bevoegde persoon in staat betalingen uit te voeren, maar geen enkele persoon kan alleen de accountstructuur wijzigen.",
  "behavior": "Met deze configuratie kunnen betalingen individueel worden uitgevoerd door elk van de drie geautoriseerde personen, aangezien het individuele gewicht voldoet aan de mediumdrempel/drempel. Structurele veranderingen, zoals het verwijderen van een ondertekenaar/ondertekenaars, het aanpassen van drempels/gewichtingen, of het samenvoegen of sluiten van de rekening, vereisen echter een hoge drempel/hoge_drempel. Deze waarde kan alleen worden bereikt wanneer ten minste twee van de drie ondertekenaars samen ondertekenen. Deze opzet houdt de rekening flexibel voor dagelijks gebruik, terwijl het sterke bescherming biedt tegen misbruik.",
  "removal": "Wenn eine Person das Unternehmen verlässt oder nicht mehr vertrauenswürdig ist, können zwei der verbleibenden Unterzeichner (Signer) gemeinsam die Signaturrechte dieser Person entfernen. Kein einzelner Unterzeichner (Signer) – weder ein Mitarbeiter noch die Geschäftsführung – kann andere eigenständig aus dem Konto ausschließen. Der Entzug von Berechtigungen erfolgt also immer kontrolliert und nachvollziehbar durch mindestens zwei Verantwortliche.",
  "summary": "Dit type multi-handtekeningstructuur stelt individuele personen in staat om efficiënt betalingen te verwerken, terwijl de controle over de rekening bij meerdere partijen blijft. Het vermindert het risico op overnames van accounts, beschermt tegen eenzijdige beslissingen, en is bijzonder geschikt voor zakelijke rekeningen waar zowel veiligheid als operationele flexibiliteit belangrijk zijn.",
  "closeLabel": "Sluiten",
  "linkLabel": "Wat betekent Multi-Signature?"
}