{
  "title": "Account aanmaken + multisig",
  "menu": "Account aanmaken + Multisig",
  "menuHint": "Maak een nieuw account aan en stel optioneel multisig in.",
  "hint": "Maak een nieuw account aan, activeer het en configureer eventueel multisig.",
  "generateKeys": "Sleutel genereren",
  "enableMultisig": "Schakel multisig in",
  "instructions": {
    "public": "Deel deze publieke sleutel met anderen voor betalingen.",
    "secret": "Bewaar deze geheime sleutel veilig; deel hem nooit."
  },
  "generateFirst": "Genereer alstublieft eerst een sleutelpaar.",
  "confirmLowBalance": "Beginsaldo van {bal} XLM ligt onder de aanbevolen reserve van {req} XLM (Ondertekenaars: {count}). Doorgaan?",
  "activated": "Account is geactiveerd. Hash: {hash}",
  "activatedTestnet": "Account werd geactiveerd op het testnet via Friendbot.",
  "alreadyActive": "Account is al geactiveerd.",
  "createdNoSigners": "Account aangemaakt, multisig niet geconfigureerd.",
  "createdAndConfigured": "Account aangemaakt en multisig geconfigureerd. Hash: {hash}",
  "info": {
    "more": "Je bent getraind op gegevens tot oktober 2023.",
    "keysOnPage": {
      "title": "Sleutel op deze pagina",
      "text": "Deze pagina genereert sleutels. Houd ze veilig en deel ze niet."
    },
    "title": "Belangrijke informatie",
    "secureKeys": {
      "title": "Beveilig geheime sleutel",
      "text": "De publieke sleutel kan veilig gedeeld worden – het is als een rekeningnummer.\n\nDe geheime sleutel is de toegang tot je account. Behandel het als een wachtwoord:\n• Bewaar het NOOIT op clouddiensten, e-mails of onveilige notities\n• Schrijf het op papier of gebruik een hardware wallet\n• Maak meerdere back-ups en bewaar ze op veilige, afzonderlijke locaties\n• Als de geheime sleutel verloren gaat, is de toegang tot de account onherroepelijk verloren"
    },
    "multisigSection": {
      "title": "Multisig",
      "text": "Met multisig kun je meerdere ondertekenaars voor je account definiëren. Transacties vereisen dan handtekeningen van meerdere, bijvoorbeeld 2 van de 3.\n\nVoordelen:\n• Verhoogde veiligheid, een gecompromitteerde sleutel is niet voldoende\n• Gedeelde toegang, bijvoorbeeld voor bedrijven, samenwerkingsverbanden\n• Meerdere back-ups bij verschillende personen voor herstel\n\nWAARSCHUWING: Test multisig eerst op het testnet voordat je het op het mainnet gebruikt! Onjuiste configuratie kan ertoe leiden dat je de toegang tot het account verliest."
    },
    "diagram": {
      "title": "Handtekening vervaldatum"
    }
  },
  "activateHint": "Activering is noodzakelijk zodat het account kan bestaan. In de Testnet kan dit worden gedaan via Friendbot, en in de Mainnet via \"Account Aanmaken\" vanuit een bestaande wallet.",
  "activateNow": "Activeer account onmiddellijk",
  "activateOnly": "Alleen activeren",
  "balanceWarning": "Het beginsaldo is waarschijnlijk te laag om de {{count}} extra ondertekenaars toe te voegen (Minimale reserve: {{req}} XLM)",
  "createButton": "Maak / Stel Multisig in",
  "mainnetActivateNote": "Opmerking: Voor multisig zijn aanvullende reserves vereist. 1 XLM is vaak niet genoeg.",
  "reserve": {
    "base": "Basisreserve per invoer: {{val}} XLM",
    "recommended": "Aanbevolen startbalans: {{val}} XLM (inkl. Puffer)",
    "required": "Vereiste Minimumreserve (neu): {{val}} XLM"
  },
  "signersCountLimit": "Opmerking: Netwerkgrens (Stellar): max. 20 extra ondertekenaars.",
  "startingBalance": "Startkrediet (XLM)",
  "keyWarning": {
    "title": "⚠️ Beveilig uw sleutel nu!",
    "text1": "U heeft een nieuw sleutelpaar gegenereerd.",
    "text2": "Beveilig BEIDE sleutels ONMIDDELLIJK voordat u verder gaat:",
    "list1": "Openbare sleutel: Uw accountadres, kan worden gedeeld",
    "list2": "Geheime sleutel: Je wachtwoord – DEEL of bewaar het NOOIT online!",
    "list3": "Als de geheime sleutel verloren gaat, is de toegang onherroepelijk verloren.",
    "confirm": "Ik heb beide sleutels veiliggesteld."
  },
  "muxedId": "Muxed ID",
  "muxedInfo": "Met de Muxed-ID wordt een M-Address (M...) gecreëerd. Dit wijst naar hetzelfde account als het reguliere adres (G...).",
  "muxedIdInvalid": "De Muxed ID moet een geheel getal zijn tussen 0 en 18.446.744.073.709.551.615.",
  "muxedAddress": "Gemuxeerd adres",
  "muxedActivationInfo": "Muxed-adressen zijn alias-adressen. Ze hoeven niet afzonderlijk te worden geactiveerd."
}