{
  "title": "Multisig & Beveiliging",
  "introText": "Test je kennis over handtekeningen, drempels en veilige opslag.",
  "q1": {
    "question": "Waarom multisig gebruiken?",
    "hint": "Denk aan gedeelde verantwoordelijkheid.",
    "a1": "Om het risico van verlies van individuele sleutels te verminderen.",
    "a1fb": "Correct: Meerdere handtekeningen verminderen het individuele risico.",
    "a2": "Om op kosten te besparen.",
    "a2fb": "Onjuist: Multisig verbetert de beveiliging, niet de kosten.",
    "a3": "Om sneller te verzenden.",
    "a3fb": "Onjuist: Multisig is niet ontworpen voor snelheid."
  },
  "q2": {
    "question": "Wanneer is een transactie op een multisig-account geldig?",
    "hint": "Bekijk de gewogen handtekeningen.",
    "a1": "Als de handtekeningen de vereiste drempel bereiken.",
    "a1fb": "Correct: De som van de gewichten moet aan de drempelwaarde voldoen.",
    "a2": "Zodra er een handtekening aanwezig is.",
    "a2fb": "Onjuist: Een enkele handtekening is niet voldoende als de drempelwaarde hoger is.",
    "a3": "Alleen met de hoofdsleutel, ongeacht de drempel.",
    "a3fb": "Foutief: De hoofdsleutel is ook onderhevig aan drempels."
  },
  "q3": {
    "question": "Wat gebeurt er als drempelwaarden onjuist worden ingesteld?",
    "hint": "Waarden die te hoog of te laag zijn, hebben gevolgen.",
    "a1": "Transacties kunnen worden geblokkeerd of te gemakkelijk worden goedgekeurd.",
    "a1fb": "Correct: Onjuiste drempelwaarden leiden tot uitsluitingen of onvoldoende beveiliging.",
    "a2": "Helemaal niets, drempels zijn slechts informatie.",
    "a2fb": "Onjuist: Drempels bepalen hoeveel handtekeningen nodig zijn.",
    "a3": "Het volgnummer van de rekening wordt gereset.",
    "a3fb": "Onjuist: Drempelwaarden hebben geen invloed op de volgorde."
  },
  "q4": {
    "question": "Hoeveel handtekeningen zijn er nodig voor een transactie met Threshold med?",
    "hint": "Med threshold = mediane drempel.",
    "a1": "De gewichten van de handtekeningen moeten ten minste de mediedrempel bereiken.",
    "a1fb": "Correct: De mediane drempel is van toepassing op betalingen.",
    "a2": "Slechts één handtekening ooit.",
    "a2fb": "Onjuist: Het hangt af van gewichten en drempels.",
    "a3": "Altijd alle ondertekenaars.",
    "a3fb": "Onjuist: Alleen voldoende handtekeningen om de drempel te halen."
  },
  "q5": {
    "question": "Hoe moeten geheime sleutels worden opgeslagen in echte multisig-opstellingen?",
    "hint": "Scheiding is veiligheid.",
    "a1": "Gescheiden op verschillende apparaten/locaties.",
    "a1fb": "Correct: Handtekeningen moeten afzonderlijk worden verzameld.",
    "a2": "Allemaal op dezelfde laptop voor het gemak.",
    "a2fb": "Incorrect: Een apparaat vormt een enkelvoudig storingspunt.",
    "a3": "Deel eenvoudig in een chat.",
    "a3fb": "Onjuist: Deel nooit geheime sleutels."
  }
}