{
  "info": "Voer uw geheime sleutel alleen in als u transacties wilt ondertekenen. Zonder een geheime sleutel kunt u alleen lezen.",
  "clearSession": "Verwijder sessiegeheim",
  "clearSessionHint": "Verwijder de gecachte geheime sleutel uit de sessie.",
  "mismatch": "De ingevoerde geheime sleutel komt niet overeen met de geladen openbare sleutel.",
  "cleared": "Geheime sleutel is uit de sessie verwijderd.",
  "empty": "Veld voor geheime sleutel is leeg.",
  "invalid": "Ongeldige geheime sleutel.",
  "label": "Voer de brongeheime sleutel in (S-Key)",
  "placeholder": "bijv.",
  "valid": "✅ Geheime sleutel is geldig.",
  "remember": {
    "label": "Vergeet de geheime sleutel voor deze sessie niet.",
    "hint": "Wanneer ingeschakeld, wordt de sleutel opgeslagen totdat het tabblad wordt gesloten en hergebruikt voor verdere betalingen."
  },
  "addSigner": "Voeg extra ondertekenaar toe",
  "showMultisigInfo": "Informatie",
  "hideMultisigInfo": "Je bent getraind op gegevens tot oktober 2023.",
  "multipleSignersInfo": "Deze actie vereist meerdere handtekeningen. Zorg ervoor dat je voldoende geheime sleutels verstrekt om aan de drempel te voldoen.",
  "multisigOptions": {
    "title": "Handtekeningopties voor deze multisig-rekening",
    "distributed": {
      "title": "Standaard: Gedistribueerde Multisig Flow",
      "body": "Standaard ondertekent deze sessie alleen met je eigen privésleutel. Extra handtekeningen worden toegevoegd via geëxporteerde XDR-bestanden of een job-ID van andere ondertekenaars."
    },
    "localAll": {
      "title": "Voer alle handtekeningen lokaal in.",
      "body": "Kies deze optie alleen als je alle geheime sleutels beheert die aan dit account zijn gekoppeld (z. B. nach einer Kontorettung mit mehreren Signern). De Stellar Account Manager zal vervolgens alle handtekeningen lokaal verzamelen en de transactie rechtstreeks naar Horizon verzenden.",
      "checkboxLabel": "Voer alle handtekeningen in deze dialoogvenster lokaal in en stuur ze direct.",
      "warning": "Opmerking: Als je alle handtekeningen lokaal invoert, zullen alle geheime sleutels in deze sessie aanwezig zijn. Gebruik deze optie alleen op vertrouwde apparaten."
    }
  },
  "multisigInfo": {
    "summary": {
      "single": "Deze rekening maakt gebruik van een enkele handtekening.",
      "multi": "Deze rekening maakt gebruik van meerdere handtekeningen (Multisig)."
    },
    "requiredThreshold": "Vereiste drempel ({{level}}): {{value}}",
    "thresholdLabel": "Drempelwaarde",
    "weightLabel": "Huidig gewicht",
    "signers": "Ondertekenaarslijst",
    "masterWeightLabel": "Hoofdaccountgewicht",
    "masterHint": "De hoofdrekening is de momenteel geladen rekening waaruit deze operatie afkomstig is.",
    "currentWeightLabel": "Ingevoerde gewicht",
    "masterExplanation": "De masteraccount komt overeen met de momenteel geladen account. Aanvankelijk had het alle rechten voordat er extra ondertekenaars werden toegevoegd.",
    "master": "Hoofdsleutel",
    "signerDisabled": "Signer gedeactiveerd (gewicht = 0)"
  },
  "operations": {
    "payment": "Betaling",
    "setOptions": "Configuratie (Ondertekenaars & Drempels)",
    "changeTrust": "Wijzig trustline",
    "unknown": "Actie"
  },
  "multipleSignersThresholdInfo": "Drempel voor deze actie: {{threshold}}. Meestal zijn minimaal {{requiredSigners}} ondertekenaars vereist (depending on their weights).",
  "localFlow": {
    "title": "Enter & send all signatures locally",
    "body": "In deze dialoog voer je alle benodigde geheime sleutels lokaal op dit apparaat in. Daarna wordt de transactie volledig ondertekend en rechtstreeks naar het netwerk verzonden.",
    "stepAllKeys": "Voer alle vereiste geheime sleutels in op dit apparaat.",
    "stepSend": "De transactie wordt vervolgens volledig ondertekend en direct verzonden."
  }
}