{
  "info": "Voer uw geheime sleutel alleen in als u transacties wilt ondertekenen. Zonder een geheime sleutel kunt u alleen lezen.",
  "clearSession": "Verwijder sessiegeheim",
  "clearSessionHint": "Verwijder de opgeslagen geheime sleutel uit de sessie.",
  "mismatch": "De ingevoerde geheime sleutel komt niet overeen met de geladen publieke sleutel.",
  "cleared": "Geheime sleutel uit de sessie verwijderd",
  "empty": "Het veld voor de geheime sleutel is leeg.",
  "invalid": "Ongeldige geheime sleutel.",
  "label": "Voer de bron-geheime sleutel in (S-Key)",
  "placeholder": "bijv.",
  "valid": "✅ Geheime sleutel is geldig.",
  "remember": {
    "label": "Onthoud de geheime sleutel voor deze sessie.",
    "hint": "Wanneer ingeschakeld, wordt de sleutel opgeslagen totdat het tabblad wordt gesloten en opnieuw gebruikt voor verdere betalingen."
  },
  "showMultisigInfo": "Informatie",
  "hideMultisigInfo": "Verberg informatie",
  "multipleSignersThresholdInfo": "Drempel voor deze actie: {{threshold}}. Meestal zijn er ten minste {{requiredSigners}} ondertekenaars nodig (depending on their weights).",
  "localFlow": {
    "title": "Alle handtekeningen lokaal invoeren & verzenden",
    "body": "In deze dialoog voer je alle benodigde geheime sleutels lokaal in op dit apparaat. Vervolgens wordt de transactie volledig ondertekend en direct naar het netwerk verzonden.",
    "stepAllKeys": "Voer alle vereiste geheime sleutels in op dit apparaat.",
    "stepSend": "De transactie wordt vervolgens volledig ondertekend en direct verzonden."
  },
  "multisigOptions": {
    "title": "Handtekeningsopties voor dit multisig-account",
    "distributed": {
      "title": "Standaard: Gedistribueerde Multisig-Flow",
      "body": "Standaard ondertekent deze sessie alleen met je eigen privésleutel. Extra handtekeningen worden aangevuld via geëxporteerde XDR-bestanden of een taak-ID van andere ondertekenaars."
    },
    "localAll": {
      "title": "Voer alle handtekeningen lokaal in.",
      "body": "Kies deze optie alleen als je alle geheime sleutels beheert die aan deze account zijn gekoppeld (z. B. nach einer Kontorettung mit mehreren Unterzeichnern). De Stellar Account Manager zal dan alle handtekeningen lokaal verzamelen en de transactie direct naar Horizon sturen.",
      "checkboxLabel": "Voer alle handtekeningen lokaal in deze dialoog in en stuur ze direct.",
      "warning": "Opmerking: Wanneer u alle handtekeningen lokaal invoert, zijn alle privésleutels in deze sessie aanwezig. Gebruik deze optie alleen op vertrouwde apparaten."
    }
  },
  "multisigInfo": {
    "summary": {
      "single": "Deze rekening maakt gebruik van een enkele handtekening.",
      "multi": "Deze rekening gebruikt meerdere handtekeningen (Multisig)."
    },
    "requiredThreshold": "Vereiste drempel ({{level}}): {{value}}",
    "thresholdLabel": "Drempel",
    "masterWeightLabel": "Hoofdrekening gewicht",
    "masterHint": "De hoofdaccount is de momenteel geladen account van waaruit deze bewerking afkomstig is.",
    "currentWeightLabel": "Ingevoerd gewicht",
    "weightLabel": "Weging",
    "signers": "Lijst van ondertekenaars",
    "master": "Hoofdsleutel",
    "signerDisabled": "Ondertekenaar gedeactiveerd (gewicht = 0)",
    "masterExplanation": "De hoofdaccount komt overeen met de momenteel geladen account. Aanvankelijk had deze alle rechten voordat er extra ondertekenaars werden toegevoegd."
  },
  "jobSign": {
    "masterOnly": "Alleen de hoofdsleutel van deze account kan voor deze stap tekenen.",
    "anyActive": "Mastergewicht is 0. Voer de geheime sleutel in van een van de vermelde ondertekenaars met een gewicht > 0."
  },
  "operations": {
    "payment": "Betaling",
    "setOptions": "Configuratie (Ondertekenaars & Drempels)",
    "changeTrust": "Verander de trustlijn",
    "unknown": "Actie"
  }
}