{
  "info": "Voer alleen uw geheime sleutel in als u transacties wilt ondertekenen. Zonder een geheime sleutel kunt u alleen lezen.",
  "clearSession": "Sessiegeheim verwijderen",
  "clearSessionHint": "Verwijdert de opgeslagen geheime sleutel uit de sessie.",
  "mismatch": "De ingevoerde geheime sleutel komt niet overeen met de geladen openbare sleutel.",
  "cleared": "Geheime sleutel uit de sessie verwijderd",
  "empty": "Het veld voor de geheime sleutel is leeg.",
  "invalid": "Ongeldige geheime sleutel.",
  "label": "Voer de bron geheime sleutel in (S-Key)",
  "placeholder": "bijv. (for example)",
  "valid": "✅ Geheime sleutel is geldig.",
  "remember": {
    "label": "Onthoud de geheime sleutel voor deze sessie.",
    "hint": "Wanneer ingeschakeld, wordt de sleutel opgeslagen totdat het tabblad wordt gesloten en hergebruikt voor verdere betalingen."
  },
  "showMultisigInfo": "Ik ben getraind op data tot en met oktober 2023.",
  "hideMultisigInfo": "Verberg informatie.",
  "multipleSignersThresholdInfo": "Drempel voor deze actie: {{threshold}}. Meestal zijn er minstens {{requiredSigners}} ondertekenaars nodig (depending on their weights).",
  "localFlow": {
    "title": "Alle handtekeningen lokaal invoeren & verzenden",
    "body": "In deze dialoog voert u alle vereiste geheime sleutels lokaal op dit apparaat in. Daarna wordt de transactie volledig ondertekend en rechtstreeks naar het netwerk verzonden.",
    "stepAllKeys": "Voer alle vereiste geheime sleutels in op dit apparaat.",
    "stepSend": "De transactie wordt dan volledig ondertekend en direct verzonden."
  },
  "multisigOptions": {
    "title": "Handtekeningsopties voor deze multisig-rekening",
    "distributed": {
      "title": "Standaard: Gedistribueerde Multisig Flow",
      "body": "Standaard ondertekent deze sessie alleen met je eigen geheime sleutel. Extra handtekeningen worden aangevuld via geëxporteerde XDR-bestanden of een taak-ID van andere ondertekenaars."
    },
    "localAll": {
      "title": "Voer alle handtekeningen lokaal in.",
      "body": "Kies deze optie alleen als je alle geheime sleutels die aan deze account zijn gekoppeld (z. B. nach einer Kontorettung mit mehreren Unterzeichnern) beheert. De Stellar Account Manager verzamelt dan alle handtekeningen lokaal en stuurt de transactie rechtstreeks naar Horizon.",
      "checkboxLabel": "Voer alle handtekeningen lokaal binnen deze dialoog in en stuur ze direct.",
      "warning": "Opmerking: Als je alle handtekeningen lokaal invoert, zullen alle geheime sleutels in deze sessie aanwezig zijn. Gebruik deze optie alleen op vertrouwde apparaten."
    }
  },
  "multisigInfo": {
    "summary": {
      "single": "Deze rekening gebruikt een enkele handtekening.",
      "multi": "Deze rekening maakt gebruik van meerdere handtekeningen (Multisig)."
    },
    "requiredThreshold": "Vereiste drempel ({{level}}): {{value}}",
    "thresholdLabel": "Drempelwaarde",
    "masterWeightLabel": "Hoofdrekeninggewicht",
    "masterHint": "De hoofdaccount is de momenteel geladen account waaruit deze operatie afkomstig is.",
    "currentWeightLabel": "Ingevoerd gewicht",
    "weightLabel": "Weging",
    "signers": "Ondertekenaarslijst",
    "master": "Moedersleutel",
    "signerDisabled": "Signer gedeactiveerd (gewicht = 0)",
    "masterExplanation": "De masteraccount komt overeen met de momenteel geladen account. Het had aanvankelijk alle rechten voordat extra ondertekenaars werden toegevoegd."
  },
  "jobSign": {
    "masterOnly": "Alleen de hoofdsleutel van deze account kan voor deze stap tekenen.",
    "anyActive": "Hoofdgewicht is 0. Voer de geheime sleutel in van een van de vermelde ondertekenaars met een gewicht groter dan 0."
  },
  "operations": {
    "payment": "Betaling",
    "setOptions": "Configuratie (Ondertekenaars & Drempels)",
    "changeTrust": "Wijzig trustline",
    "unknown": "Actie"
  }
}