{
  "nav": {
    "title": "Verhaalmodus",
    "chapter_select": "Kies hoofdstuk",
    "chapter_select_title": "Hoofdstukkeuze",
    "chapter_select_sub": "Kies een hoofdstuk om te spelen",
    "to_home": "Home",
    "to_chapters": "Hoofdstukken",
    "step_back": "Terug",
    "confirm_leave": "Uw voortgang in dit hoofdstuk wordt opgeslagen.",
    "confirm_leave_cancel": "Annuleren",
    "confirm_leave_ok": "Verlaten",
    "chapter_locked": "Vergrendeld",
    "chapter_completed": "Voltooid",
    "chapter_current": "Doorgaan",
    "chapter_start": "Starten",
    "home_short": "Home",
    "chapters_short": "Hoofdstukken",
    "back_short": "Terug",
    "back_to_home": "Terug naar home"
  },
  "chapter1": {
    "introNarrator": "De Stellar-blockchain – een digitaal netwerk dat waarde over de hele wereld beweegt. En er in valt een kleine ster...",
    "introDialog1": "Hallo! Ik ben Lumio en ik ben net geland op de Stellar-blockchain! 🌟",
    "introDialog2": "Maar ik heb hier nog geen account... kun jij me helpen er een te maken?",
    "keypairTitle": "Stap 1 – Wat is een sleutelpaar?",
    "keypairNarrator": "Elk account op Stellar bestaat uit twee sleutels: de Publieke Sleutel (je adres) en de Geheime Sleutel (je wachtwoord). Alleen wie de Geheime Sleutel kent, kan geld sturen.",
    "choicePublicKeyLabel": "Ik deel de Publieke Sleutel met anderen zodat ze me XLM kunnen sturen.",
    "choicePublicKeyHint": "Precies! De Publieke Sleutel is als een bankrekeningnummer – je kunt hem openbaar delen. ✓",
    "choiceSecretShareLabel": "Ik geef mijn Geheime Sleutel aan iemand die ik vertrouw.",
    "choiceSecretShareHint": "Voorzichtig! NIEMAND mag de Geheime Sleutel kennen – zelfs Stellar of Lumio niet. Het geeft volledige toegang tot je account.",
    "choiceSameLabel": "Beide sleutels zijn eigenlijk hetzelfde.",
    "choiceSameHint": "Dat klopt niet. De Publieke Sleutel en de Geheime Sleutel vormen een paar, maar hebben heel verschillende rollen.",
    "createTitle": "Stap 2 – Jouw eerste sleutelpaar",
    "createDialog": "Geweldig! Nu maken we ons gedeelde testaccount. Druk op de knop – ik hou de wacht!",
    "createActionLabel": "Sleutelpaar genereren",
    "createActionDesc": "Maakt een willekeurige Publieke Sleutel en Geheime Sleutel voor de Stellar Testnet. Alleen voor oefendoeleinden!",
    "warningDialog1": "Wauw, we hebben nu een sleutelpaar! Noteer de Geheime Sleutel ergens – maar laat hem nooit aan iemand zien!",
    "warningDialog2": "Op het echte netwerk zou ik aanraden hem op papier te schrijven en veilig te bewaren.",
    "activateTitle": "Stap 3 – Het account activeren",
    "activateNarrator": "Een nieuw Stellar-account moet eerst worden geactiveerd – het heeft minimaal 1 XLM nodig als reserve. Op de Testnet geeft de 'Friendbot' ons gratis test-XLM.",
    "friendbotLabel": "Friendbot aanvragen",
    "friendbotDesc": "Stuurt een verzoek naar de Stellar Friendbot, die ons testaccount activeert met 10.000 test-XLM.",
    "friendbotError": "Geen sleutelpaar gevonden – genereer er eerst een.",
    "outroDialog1": "We hebben een echt account op de Stellar Testnet! Ik zie de XLM al in de blockchain...",
    "outroDialog2": "Je hebt dat snel geleerd! In het volgende hoofdstuk sturen we samen XLM.",
    "summaryTitle": "De Aankomst",
    "summaryLearning1": "Elk Stellar-account bestaat uit een Publieke Sleutel (adres) en een Geheime Sleutel (wachtwoord)",
    "summaryLearning2": "De Geheime Sleutel mag nooit worden gedeeld",
    "summaryLearning3": "Nieuwe accounts hebben minimaal 1 XLM minimale saldo nodig (basisreserve)",
    "summaryLearning4": "De Friendbot activeert Testnet-accounts gratis",
    "keypair_warning": "Noteer je Geheime Sleutel nu! Hij kan niet worden hersteld. Wie hem kent, heeft volledige toegang tot je account.",
    "keypair_confirm": "Ik heb mijn Geheime Sleutel genoteerd en begrijp dat hij niet kan worden hersteld.",
    "keypair_public_label": "Je Publieke Sleutel (Adres)",
    "keypair_secret_label": "Je Geheime Sleutel – HOUD HEM GEHEIM!",
    "keypair_copy": "Kopiëren",
    "keypair_copied": "Gekopieerd!",
    "keypair_continue": "Ik heb alles genoteerd – verder",
    "explorer_title": "Je account in Stellar Explorer",
    "explorer_desc": "In Stellar Explorer kun je je account en alle transacties openbaar bekijken – zoals een bankafschrift, maar zichtbaar voor iedereen.",
    "explorer_hint": "Kopieer het adres en open het handmatig in je browser.",
    "explorer_url_label": "Explorer-URL",
    "explorer_copy_url": "URL kopiëren",
    "explorer_open": "Bekijk in de Explorer",
    "explorer_confirm_title": "Externe link",
    "explorer_confirm_text": "Je wordt doorgestuurd naar {{explorer}}. Er opent een nieuw tabblad.",
    "explorer_confirm_cancel": "Annuleren",
    "explorer_confirm_ok": "Openen",
    "summaryLearning4a": "Op het Testnet activeert de Friendbot accounts gratis met test-XLM",
    "summaryLearning4b": "Op het echte netwerk (Mainnet) moet een ander account minimaal 1 XLM sturen om jouw account te activeren – de Friendbot bestaat daar niet!",
    "title": "Account aanmaken",
    "explorer_after_fund": "Na activering van het account kunt u het bekijken in de Explorer",
    "q1_question": "Wat doe je met je [[Public Key|publicKey]]?"
  },
  "chapter2": {
    "title": "Lumio's eerste transactie",
    "section_tx": "Stap 1 – Wat is een transactie?",
    "section_memo": "Stap 2 – Het Memo-veld",
    "section_action": "Stap 3 – Betaling verzenden",
    "narrator_intro": "Lumio heeft nu een account met test-XLM. Maar geld hebben is niet genoeg – je moet het ook kunnen sturen. Hoe werkt dat op Stellar?",
    "lumio_1a": "Ik wil 10 XLM sturen naar mijn vriend Cosmo! Maar hoe werkt dat?",
    "lumio_1b": "Ik hoor dat er zoiets bestaat als een transactie... wat is dat precies?",
    "narrator_tx": "Een transactie op Stellar is een instructie aan het netwerk: stuur X XLM van account A naar account B. Het netwerk controleert het saldo, trekt een kleine vergoeding af en schrijft alles in het ledger.",
    "choice1_a": "Het betaalt de netwerkknooppunten en voorkomt spam-transacties.",
    "choice1_b": "Het gaat rechtstreeks naar de Stellar Development Foundation als winst.",
    "choice1_c": "Het is optioneel – je kunt het weglaten.",
    "choice1_a_hint": "Precies! De basisvergoeding is heel klein (0.00001 XLM) maar belangrijk voor de netwerkbeveiliging.",
    "choice1_b_hint": "Fout – de vergoedingen worden verbrand, niet verzameld.",
    "choice1_c_hint": "Fout – zonder vergoeding wordt de transactie afgewezen.",
    "lumio_2": "En wat is dit Memo-veld dat ik in sommige wallets zie?",
    "narrator_memo": "Het Memo-veld is een optioneel commentaar bij de transactie – maximaal 28 tekens. Exchanges gebruiken het om de afzender te identificeren. Zonder het juiste Memo kan je geld verloren gaan!",
    "choice2_a": "Altijd – zonder Memo wordt de transactie afgewezen.",
    "choice2_b": "Wanneer ik naar een exchange stuur die een Memo vereist.",
    "choice2_c": "Nooit – het Memo-veld is verouderd en wordt niet meer gebruikt.",
    "choice2_a_hint": "Niet altijd – tussen gewone wallets is het Memo optioneel.",
    "choice2_b_hint": "Correct! Bij exchanges identificeert het Memo jouw account.",
    "choice2_c_hint": "Fout – Memo is actief en essentieel voor stortingen bij exchanges.",
    "lumio_3": "Ok, ik denk dat ik het begrijp! Laten we een echte transactie proberen!",
    "action_label": "Stuur 10 XLM naar Cosmo",
    "action_desc": "Stuurt 10 test-XLM naar Cosmo's Testnet-account met Memo 'Hallo Cosmo'. Daarna zie je de transactiehash op de blockchain.",
    "error_no_keypair": "Geen sleutelpaar gevonden – voltooi eerst Hoofdstuk 1.",
    "lumio_4a": "Ik zie het! De transactie staat op de blockchain! De transactiehash is als een kwitantienummer – iedereen kan de transactie ermee opzoeken.",
    "lumio_4b": "In de Stellar Explorer kun je elke transactie openbaar bekijken met de hash.",
    "narrator_hash": "De transactiehash is een uniek ID voor elke transactie. Het bewijst onomstotelijk dat de transactie heeft plaatsgevonden.",
    "learning_1": "Een transactie stuurt XLM van het ene account naar het andere",
    "learning_2": "De basisvergoeding (0.00001 XLM) betaalt het netwerk en voorkomt spam",
    "learning_3": "Het Memo-veld is essentieel voor stortingen bij exchanges",
    "learning_4": "Elke transactie heeft een unieke hash als bewijs",
    "q1_question": "Waarvoor dient de [[Base Fee|base_fee]] bij een Stellar-transactie?",
    "q2_question": "Wanneer heb je het [[Memo|memo]]-veld nodig?",
    "preset_cosmo": "Cosmo (Testnet)"
  },
  "ui": {
    "tap_to_continue": "Tik om door te gaan",
    "testnet_badge": "Testnet – geen echte tokens",
    "retry_hint": "Probeer het opnieuw!",
    "learn_more": "Meer weten",
    "glossary_title": "Woordenlijst",
    "glossary_not_found": "Term niet gevonden.",
    "glossary_hint": "Je kunt hier meer over lezen in de woordenlijst.",
    "continue": "Verder",
    "tx_success": "Transactie geslaagd!",
    "tx_hash_label": "Transactiehash",
    "open_in_explorer": "Bekijk in Explorer ↗",
    "hash_copied": "Gekopieerd!",
    "copy_hash": "Hash kopiëren",
    "explorer_confirm_title": "Externe link",
    "explorer_confirm_text": "Er wordt een nieuw tabblad geopend.",
    "explorer_confirm_cancel": "Annuleren",
    "explorer_confirm_ok": "Openen"
  },
  "placeholder": {
    "chapter_label": "Hoofdstuk",
    "wip_title": "In aanbouw",
    "wip_text": "Dit hoofdstuk is nog in aanbouw. Lumio werkt er hard aan – kom binnenkort terug!",
    "back_to_start": "Terug naar Hoofdstuk 1",
    "to_chapter_select": "Naar hoofdstukkeuze",
    "wip_hint": "Hoofdstuk {{next}} is ook nog in aanbouw – maar je kunt alvast een kijkje nemen.",
    "next_chapter": "Verder naar hoofdstuk {{n}} →"
  },
  "chapter3": {
    "title": "De Handelaar"
  },
  "chapter4": {
    "title": "De Schurk"
  },
  "chapter5": {
    "title": "Lumio's Missie"
  },
  "hud": {
    "chapter_short": "Hfdst."
  },
  "action": {
    "already_done": "Al voltooid",
    "continue_with_existing": "Doorgaan",
    "redo": "Opnieuw uitvoeren?",
    "redo_keypair_warning": "Let op: Een nieuw sleutelpaar overschrijft het oude. Uw huidige Testnet-account gaat verloren.",
    "redo_cancel": "Annuleren",
    "redo_confirm": "Toch nieuw aanmaken"
  },
  "payment": {
    "title": "Betaling versturen",
    "from_label": "Van (jouw account)",
    "to_label": "Aan (ontvanger)",
    "to_placeholder": "G... (Public Key invoeren)",
    "amount_label": "Bedrag (XLM)",
    "memo_label": "Memo (optioneel)",
    "memo_hint": "Tip: exchanges vereisen vaak een Memo voor identificatie",
    "error_secret_key": "Dat is een Secret Key! Een Secret Key is nooit een ontvangstadres. Voer je Secret Key nergens in.",
    "error_invalid_key": "Geen geldige Stellar Public Key. Public Keys beginnen met 'G' en zijn 56 tekens lang.",
    "error_own_key": "Dat is je eigen Public Key. Je kunt geen betaling aan jezelf sturen.",
    "cancel": "Annuleren",
    "send": "Versturen"
  }
}