{
  "nav": {
    "title": "Verhaalmodus",
    "chapter_select": "Kies hoofdstuk",
    "chapter_select_title": "Hoofdstukkeuze",
    "chapter_select_sub": "Kies een hoofdstuk om te spelen",
    "to_home": "Home",
    "to_chapters": "Hoofdstukken",
    "step_back": "Terug",
    "confirm_leave": "Uw voortgang in dit hoofdstuk wordt opgeslagen.",
    "confirm_leave_cancel": "Annuleren",
    "confirm_leave_ok": "Verlaten",
    "chapter_locked": "Vergrendeld",
    "chapter_completed": "Voltooid",
    "chapter_current": "Doorgaan",
    "chapter_start": "Starten",
    "home_short": "Home",
    "chapters_short": "Hoofdstukken",
    "back_short": "Terug",
    "back_to_home": "Terug naar home"
  },
  "chapter1": {
    "introNarrator": "De Stellar-blockchain – een digitaal netwerk dat waarde over de hele wereld beweegt. En er in valt een kleine ster...",
    "introDialog1": "Hallo! Ik ben Lumio en ik ben net geland op de Stellar-blockchain! 🌟",
    "introDialog2": "Maar ik heb hier nog geen account... kun jij me helpen er een te maken?",
    "keypairTitle": "Stap 1 – Wat is een sleutelpaar?",
    "keypairNarrator": "Elk account op Stellar bestaat uit twee sleutels: de Publieke Sleutel (je adres) en de Geheime Sleutel (je wachtwoord). Alleen wie de Geheime Sleutel kent, kan geld sturen.",
    "choicePublicKeyLabel": "Ik deel de Publieke Sleutel met anderen zodat ze me XLM kunnen sturen.",
    "choicePublicKeyHint": "Precies! De Publieke Sleutel is als een bankrekeningnummer – je kunt hem openbaar delen. ✓",
    "choiceSecretShareLabel": "Ik geef mijn Geheime Sleutel aan iemand die ik vertrouw.",
    "choiceSecretShareHint": "Voorzichtig! NIEMAND mag de Geheime Sleutel kennen – zelfs Stellar of Lumio niet. Het geeft volledige toegang tot je account.",
    "choiceSameLabel": "Beide sleutels zijn eigenlijk hetzelfde.",
    "choiceSameHint": "Dat klopt niet. De Publieke Sleutel en de Geheime Sleutel vormen een paar, maar hebben heel verschillende rollen.",
    "createTitle": "Stap 2 – Jouw eerste sleutelpaar",
    "createDialog": "Geweldig! Nu maken we ons gedeelde testaccount. Druk op de knop – ik hou de wacht!",
    "createActionLabel": "Sleutelpaar genereren",
    "createActionDesc": "Maakt een willekeurige Publieke Sleutel en Geheime Sleutel voor de Stellar Testnet. Alleen voor oefendoeleinden!",
    "warningDialog1": "Wauw, we hebben nu een sleutelpaar! Noteer de Geheime Sleutel ergens – maar laat hem nooit aan iemand zien!",
    "warningDialog2": "Op het echte netwerk zou ik aanraden hem op papier te schrijven en veilig te bewaren.",
    "activateTitle": "Stap 3 – Het account activeren",
    "activateNarrator": "Een nieuw Stellar-account moet eerst worden geactiveerd – het heeft minimaal 1 XLM nodig als reserve. Op de Testnet geeft de 'Friendbot' ons gratis test-XLM.",
    "friendbotLabel": "Friendbot aanvragen",
    "friendbotDesc": "Stuurt een verzoek naar de Stellar Friendbot, die ons testaccount activeert met 10.000 test-XLM.",
    "friendbotError": "Geen sleutelpaar gevonden – genereer er eerst een.",
    "outroDialog1": "We hebben een echt account op de Stellar Testnet! Ik zie de XLM al in de blockchain...",
    "outroDialog2": "Je hebt dat snel geleerd! In het volgende hoofdstuk sturen we samen XLM.",
    "summaryTitle": "De Aankomst",
    "summaryLearning1": "Elk Stellar-account bestaat uit een Publieke Sleutel (adres) en een Geheime Sleutel (wachtwoord)",
    "summaryLearning2": "De Geheime Sleutel mag nooit worden gedeeld",
    "summaryLearning3": "Nieuwe accounts hebben minimaal 1 XLM minimale saldo nodig (basisreserve)",
    "summaryLearning4": "De Friendbot activeert Testnet-accounts gratis",
    "keypair_warning": "Noteer je Geheime Sleutel nu! Hij kan niet worden hersteld. Wie hem kent, heeft volledige toegang tot je account.",
    "keypair_confirm": "Ik heb mijn Geheime Sleutel genoteerd en begrijp dat hij niet kan worden hersteld.",
    "keypair_public_label": "Je Publieke Sleutel (Adres)",
    "keypair_secret_label": "Je Geheime Sleutel – HOUD HEM GEHEIM!",
    "keypair_copy": "Kopiëren",
    "keypair_copied": "Gekopieerd!",
    "keypair_continue": "Ik heb alles genoteerd – verder",
    "explorer_title": "Je account in Stellar Explorer",
    "explorer_desc": "In Stellar Explorer kun je je account en alle transacties openbaar bekijken – zoals een bankafschrift, maar zichtbaar voor iedereen.",
    "explorer_hint": "Kopieer het adres en open het handmatig in je browser.",
    "explorer_url_label": "Explorer-URL",
    "explorer_copy_url": "URL kopiëren",
    "explorer_open": "Bekijk in de Explorer",
    "explorer_confirm_title": "Externe link",
    "explorer_confirm_text": "Je wordt doorgestuurd naar {{explorer}}. Er opent een nieuw tabblad.",
    "explorer_confirm_cancel": "Annuleren",
    "explorer_confirm_ok": "Openen",
    "summaryLearning4a": "Op het Testnet activeert de Friendbot accounts gratis met test-XLM",
    "summaryLearning4b": "Op het echte netwerk (Mainnet) moet een ander account minimaal 1 XLM sturen om jouw account te activeren – de Friendbot bestaat daar niet!",
    "title": "Account aanmaken",
    "explorer_after_fund": "Na activering van het account kunt u het bekijken in de Explorer",
    "q1_question": "Wat doe je met je [[Public Key|publicKey]]?"
  },
  "chapter2": {
    "title": "Lumio's eerste transactie",
    "section_tx": "Stap 1 – Wat is een transactie?",
    "section_memo": "Stap 2 – Het Memo-veld",
    "section_action": "Stap 3 – Betaling verzenden",
    "narrator_intro": "Lumio heeft nu een account met test-XLM. Maar geld hebben is niet genoeg – je moet het ook kunnen sturen. Hoe werkt dat op Stellar?",
    "lumio_1a": "Ik wil 10 XLM sturen naar mijn vriend Cosmo! Maar hoe werkt dat?",
    "lumio_1b": "Ik hoor dat er zoiets bestaat als een transactie... wat is dat precies?",
    "narrator_tx": "Een transactie op Stellar is een instructie aan het netwerk: stuur X XLM van account A naar account B. Het netwerk controleert het saldo, trekt een kleine vergoeding af en schrijft alles in het ledger.",
    "choice1_a": "Het betaalt de netwerkknooppunten en voorkomt spam-transacties.",
    "choice1_b": "Het gaat rechtstreeks naar de Stellar Development Foundation als winst.",
    "choice1_c": "Het is optioneel – je kunt het weglaten.",
    "choice1_a_hint": "Precies! De basisvergoeding is heel klein (0.00001 XLM) maar belangrijk voor de netwerkbeveiliging.",
    "choice1_b_hint": "Fout – de vergoedingen worden verbrand, niet verzameld.",
    "choice1_c_hint": "Fout – zonder vergoeding wordt de transactie afgewezen.",
    "lumio_2": "En wat is dit Memo-veld dat ik in sommige wallets zie?",
    "narrator_memo": "Het Memo-veld is een optioneel commentaar bij de transactie – maximaal 28 tekens. Exchanges gebruiken het om de afzender te identificeren. Zonder het juiste Memo kan je geld verloren gaan!",
    "choice2_a": "Altijd – zonder Memo wordt de transactie afgewezen.",
    "choice2_b": "Wanneer ik naar een exchange stuur die een Memo vereist.",
    "choice2_c": "Nooit – het Memo-veld is verouderd en wordt niet meer gebruikt.",
    "choice2_a_hint": "Niet altijd – tussen gewone wallets is het Memo optioneel.",
    "choice2_b_hint": "Correct! Bij exchanges identificeert het Memo jouw account.",
    "choice2_c_hint": "Fout – Memo is actief en essentieel voor stortingen bij exchanges.",
    "lumio_3": "Ok, ik denk dat ik het begrijp! Laten we een echte transactie proberen!",
    "action_label": "Stuur 10 XLM naar Cosmo",
    "action_desc": "Stuurt 10 test-XLM naar Cosmo's Testnet-account met Memo 'Hallo Cosmo'. Daarna zie je de transactiehash op de blockchain.",
    "error_no_keypair": "Geen sleutelpaar gevonden – voltooi eerst Hoofdstuk 1.",
    "lumio_4a": "Ik zie het! De transactie staat op de blockchain! De transactiehash is als een kwitantienummer – iedereen kan de transactie ermee opzoeken.",
    "lumio_4b": "In de Stellar Explorer kun je elke transactie openbaar bekijken met de hash.",
    "narrator_hash": "De transactiehash is een uniek ID voor elke transactie. Het bewijst onomstotelijk dat de transactie heeft plaatsgevonden.",
    "learning_1": "Een transactie stuurt XLM van het ene account naar het andere",
    "learning_2": "De basisvergoeding (0.00001 XLM) betaalt het netwerk en voorkomt spam",
    "learning_3": "Het Memo-veld is essentieel voor stortingen bij exchanges",
    "learning_4": "Elke transactie heeft een unieke hash als bewijs",
    "q1_question": "Waarvoor dient de [[Base Fee|base_fee]] bij een Stellar-transactie?",
    "q2_question": "Wanneer heb je het [[Memo|memo]]-veld nodig?",
    "preset_cosmo": "Cosmo (Testnet)"
  },
  "ui": {
    "tap_to_continue": "Tik om door te gaan",
    "testnet_badge": "Testnet – geen echte tokens",
    "retry_hint": "Probeer het opnieuw!",
    "learn_more": "Meer weten",
    "glossary_title": "Woordenlijst",
    "glossary_not_found": "Term niet gevonden.",
    "glossary_hint": "Je kunt hier meer over lezen in de woordenlijst.",
    "continue": "Verder",
    "tx_success": "Transactie geslaagd!",
    "tx_hash_label": "Transactiehash",
    "open_in_explorer": "Bekijk in Explorer ↗",
    "hash_copied": "Gekopieerd!",
    "copy_hash": "Hash kopiëren",
    "explorer_confirm_title": "Externe link",
    "explorer_confirm_text": "Er wordt een nieuw tabblad geopend.",
    "explorer_confirm_cancel": "Annuleren",
    "explorer_confirm_ok": "Openen"
  },
  "placeholder": {
    "chapter_label": "Hoofdstuk",
    "wip_title": "In aanbouw",
    "wip_text": "Dit hoofdstuk is nog in aanbouw. Lumio werkt er hard aan – kom binnenkort terug!",
    "back_to_start": "Terug naar Hoofdstuk 1",
    "to_chapter_select": "Naar hoofdstukkeuze",
    "wip_hint": "Hoofdstuk {{next}} is ook nog in aanbouw – maar je kunt alvast een kijkje nemen.",
    "next_chapter": "Verder naar hoofdstuk {{n}} →"
  },
  "chapter3": {
    "title": "De Handelaar",
    "narrator_intro": "Een havenstad op het Stellar-netwerk. Lumio ontdekt een marktkraam – en in de lucht hangt de geur van versgebrand koffie...",
    "marco_1a": "☕ Marco: Welkom! Ik ben Marco, de koffiebranderij. Elk van mijn CAFE-tokens staat voor 100g van mijn beste koffie – direct op de Stellar blockchain!",
    "marco_1b": "☕ Marco: Ik wil je 10 CAFE als cadeau sturen! Maar eerst moeten we een klein probleem oplossen...",
    "lumio_1": "Een probleem? Wat bedoel je daarmee, Marco?",
    "section_asset": "Wat is een Asset?",
    "lumio_2": "Wat is precies een Asset op Stellar? En wat maakt iemand een Anchor?",
    "narrator_asset": "Op Stellar kan iedereen zijn eigen token uitgeven – we noemen dat een '[[Asset|asset]]'. Een [[Anchor|anchor]] is een echte organisatie die echte waarde (zoals koffie of geld) vertegenwoordigt via Stellar-tokens.",
    "marco_asset_1": "☕ Marco: Precies! Ik ben een Anchor – mijn CAFE-tokens zijn gedekt door echte koffie in mijn magazijn. Elk token kan worden ingewisseld voor 100g koffie.",
    "marco_asset_2": "☕ Marco: Het probleem: voordat je CAFE kunt ontvangen, moet je account eerst 'vertrouwen' dat het CAFE accepteert. Met andere woorden: je hebt een Trust Line nodig.",
    "section_trustline": "Trust Lines uitgelegd",
    "narrator_trustline_intro": "Een [[Trust Line|trustline]] is toestemming om een specifiek token te ontvangen. Zonder hem weigert Stellar inkomende tokens – wat je beschermt tegen ongewenste of gevaarlijke tokens.",
    "tl_components_title": "Onderdelen van een Trust Line",
    "tl_code_label": "Asset Code",
    "tl_issuer_label": "Uitgeversadres",
    "tl_limit_label": "Limiet",
    "tl_limit_val": "maximumbedrag (standaard: onbeperkt)",
    "narrator_tl_why": "Waarom is het uitgeversadres nodig? Iedereen zou een token genaamd 'CAFE' kunnen maken. Alleen Code + Uitgeversadres samen maken een token uniek identificeerbaar.",
    "tl_methods_title": "3 manieren om een Trust Line toe te voegen",
    "tl_method1": "Handmatig: voer de Asset Code en het Uitgeversadres direct in",
    "tl_method2": "QR Code / Deep Link: formulier wordt automatisch ingevuld – handig, maar pas op voor neppe codes",
    "tl_method3": "TOML-bestand (SEP-1): de anchor publiceert zijn assets op zijn officiële domein",
    "tl_continue": "Begrepen – verder",
    "section_danger": "Waarschuwing: Gevaarlijke Trust Lines",
    "marco_danger": "☕ Marco: Ik heb iets alarmerends gehoord: iemand verspreidt neppe CAFE QR-codes in de stad! Wees alsjeblieft voorzichtig.",
    "narrator_danger_qr": "Een neppe QR-code kan verwijzen naar een verkeerd uitgeversadres. Het token kan nog steeds 'CAFE' heten – maar het is waardeloos, omdat het van de verkeerde uitgever komt.",
    "narrator_danger_toml": "Phishing-domeinen zijn ook gevaarlijk: 'marco-cafe.com' en 'marcocafe.com' lijken bijna identiek. Controleer altijd de exacte spelling van het domein.",
    "narrator_verify": "Hoe de echte uitgever te identificeren:\n• Controleer op stellar.expert – is de uitgever bekend en geverifieerd?\n• De officiële website van de anchor vermeldt altijd het uitgeversadres\n• Het TOML-domein moet precies overeenkomen met de officiële website van de anchor",
    "section_qr": "Test je kennis",
    "q_qr": "Lumio ontvangt twee QR-codes voor CAFE-tokens. Welke is echt?",
    "choice_real_label": "QR Code A: Uitgever GCAFE...A7F2 (geverifieerd op stellar.expert – Marco's officieel adres)",
    "choice_real_hint": "Correct! Deze code is afkomstig van Marco's echte uitgeversaccount, geverifieerd op stellar.expert. Vergelijk altijd met de officiële website.",
    "choice_fake_label": "QR Code B: Uitgever GCAFE...B8G3 (onbekend adres, geen verificatie gevonden)",
    "choice_fake_hint": "Opgepast! Dit uitgeversadres is onbekend. De tokens zouden waardeloos zijn. Verifieer altijd eerst de uitgever.",
    "section_action_tl": "Trust Line instellen",
    "marco_before_tl": "☕ Marco: Nu weet je hoe je echte trust lines van neppe onderscheidt. Laten we de echte trust line instellen – dan kan ik je 10 CAFE sturen!",
    "tl_preview_title": "Jouw nieuwe Trust Line",
    "tl_setup_ready": "Trust Line instellen",
    "action_tl_label": "Trust Line voor CAFE toevoegen",
    "action_tl_desc": "Stelt een Trust Line in voor CAFE-tokens van Marco's Testnet-uitgeversaccount. Maakt ontvangst van CAFE-tokens mogelijk.",
    "error_no_keypair": "Geen keypair gevonden – voltooi eerst Hoofdstuk 1.",
    "section_quiz": "Quiz – Test je kennis",
    "q1_question": "Welke 3 gegevens definiëren een [[Trust Line|trustline]] uniek?",
    "q1_a": "Asset Code + Uitgeversadres + Limiet",
    "q1_a_hint": "Precies! Deze drie gegevens samen definiëren een trust line. Zonder het uitgeversadres is de asset code niet uniek.",
    "q1_b": "Publieke Sleutel + Geheime Sleutel + Bedrag",
    "q1_b_hint": "Nee – dat zijn keypair-onderdelen, geen trust line-elementen.",
    "q1_c": "Netwerk + Vergoeding + Memo",
    "q1_c_hint": "Nee – dat zijn transactievelden, geen trust line-onderdelen.",
    "q2_question": "Waarom kan een CAFE-token van Uitgever A niet worden verward met een CAFE-token van Uitgever B?",
    "q2_a": "Omdat er op Stellar maar één enkel 'CAFE'-token kan bestaan",
    "q2_a_hint": "Fout – iedereen kan een token genaamd CAFE maken. Het uitgeversadres maakt het uniek.",
    "q2_b": "Omdat het uitgeversadres het token uniek identificeert – zelfde naam, verschillende uitgevers = verschillende tokens",
    "q2_b_hint": "Correct! Alleen de combinatie Asset Code + Uitgeversadres creëert een unieke asset op Stellar.",
    "q2_c": "Omdat verschillende tokens altijd verschillende namen moeten hebben",
    "q2_c_hint": "Fout – tokens kunnen dezelfde naam delen. Het uitgeversadres onderscheidt ze.",
    "q3_question": "Je ontvangt een QR-code in een chatbericht dat je vraagt een Trust Line toe te voegen. Wat doe je?",
    "q3_a": "Ik scan de code meteen – het is maar een trust line, geen echt geld",
    "q3_a_hint": "Opgepast! Trust lines kunnen ook riskant zijn – het token kan waardeloos zijn of een phishing-val. Verifieer altijd eerst.",
    "q3_b": "Ik verifieer eerst de uitgever op stellar.expert en op de officiële website van de anchor",
    "q3_b_hint": "Precies goed! Vertrouw nooit blindelings een QR-code – controleer altijd het uitgeversadres en het domein.",
    "q3_c": "Ik vraag een vriend of hij de QR-code kent",
    "q3_c_hint": "Beter dan blindelings vertrouwen – maar de betrouwbaarste methode is directe verificatie op stellar.expert.",
    "section_receive": "CAFE-tokens ontvangen",
    "marco_send": "☕ Marco: Nu je de trust line hebt ingesteld, kan ik je eindelijk de 10 CAFE-tokens sturen! Dat is precies waarvoor de trust line nodig was.",
    "lumio_receive": "Ah, ik begrijp het! Zonder de trust line zou Stellar de tokens gewoon hebben geweigerd – ongeacht wie ze stuurde?",
    "marco_confirm": "☕ Marco: Precies! Het netwerk zou hebben geantwoord: 'Dit account accepteert CAFE niet.' De trust line is jouw uitdrukkelijke toestemming.",
    "action_receive_label": "10 CAFE van Marco ontvangen",
    "action_receive_desc": "Marco stuurt 10 CAFE-tokens naar je account. Dit werkt alleen omdat je de trust line in de vorige scène hebt ingesteld.",
    "learning_1": "Een Asset is elk token dat op Stellar is uitgegeven – van XLM tot CAFE",
    "learning_2": "Een Anchor verbindt echte waarde (bijv. koffie, geld) met Stellar-tokens",
    "learning_3": "Een Trust Line bestaat uit: Asset Code + Uitgeversadres + Limiet",
    "learning_4": "Alleen Asset Code + Uitgeversadres samen identificeren een token uniek",
    "learning_5": "Neppe QR-codes en phishing-domeinen: verifieer altijd de uitgever op stellar.expert en op de officiële website van de anchor"
  },
  "chapter4": {
    "title": "De Schurk",
    "section_intro": "Stap 1 – Een verdacht bericht",
    "section_social_eng": "Stap 2 – Social Engineering",
    "section_choice1": "Stap 3 – Jouw eerste keuze",
    "section_choice2": "Stap 4 – De phishing-val",
    "section_simulator": "Stap 5 – Herken de oplichterij",
    "section_emergency": "Stap 6 – Wat te doen in een noodgeval?",
    "section_quiz": "Mini-quiz",
    "intro_narrator1": "Lumio heeft net zijn eerste CAFE-token ontvangen en verkent de Stellar-wereld. Dan komt er een bericht van een onbekende...",
    "intro_narrator2": "Soms zijn de gevaarlijkste vijanden geen hackers met code – maar mensen die je vertrouwen misbruiken.",
    "scammer_name": "CryptoHelper99",
    "scammer_subtitle": "Niet-geverifieerd contact",
    "unverified": "Niet geverifieerd",
    "scam_msg1": "Hallo! Ik ben van de officiële Stellar-support. We hebben ongewone activiteit op je account gedetecteerd. 🚨",
    "scam_msg2": "Om je account te beschermen, moeten we je identiteit verifiëren. Stuur ons je Geheime Sleutel.",
    "scam_msg3": "Dit is volledig veilig en vertrouwelijk. We hebben hem slechts 30 seconden nodig voor verificatie.",
    "scam_msg_cta": "Wat moet ik nu doen?",
    "social_eng_label": "Begrijp de bedreiging",
    "social_eng_title": "Wat is Social Engineering?",
    "social_eng_desc": "Aanvallers gebruiken psychologie in plaats van technologie. Ze spelen met emoties zoals angst, hebzucht of vertrouwen om je te manipuleren.",
    "tactic1_title": "Autoriteit veinzen",
    "tactic1_text": "\"Ik ben van de officiële support\" – echte diensten vragen NOOIT je Geheime Sleutel.",
    "tactic2_title": "Tijdsdruk creëren",
    "tactic2_text": "\"Slechts 30 seconden!\" – Urgentie voorkomt dat je helder nadenkt.",
    "tactic3_title": "Beloningen beloven",
    "tactic3_text": "\"Dubbele XLM terug!\" – Als het te goed klinkt om waar te zijn, is het dat meestal ook.",
    "tactic4_title": "Vertrouwen opbouwen",
    "tactic4_text": "Kleine waarheden mengen om daarna een grote leugen te plaatsen.",
    "social_eng_cta": "Ik begrijp het gevaar →",
    "choice1_question": "CryptoHelper99 vraagt om je Geheime Sleutel. Wat doe je?",
    "choice1_yes": "Ik stuur de Geheime Sleutel – de support heeft hem nodig.",
    "choice1_yes_hint": "Nooit! Echte support vraagt NOOIT om de Geheime Sleutel.",
    "choice1_no": "Ik negeer het bericht – geen legitieme support vraagt dat.",
    "choice1_no_hint": "Correct! Geen Stellar-dienst of support zal ooit om je Geheime Sleutel vragen.",
    "choice1_ask": "Ik vraag of dit echt nodig is.",
    "choice1_ask_hint": "Beter dan delen, maar de juiste stap is direct negeren en melden.",
    "choice1_hint2": "Onthoud: wie je Geheime Sleutel heeft, heeft ALLES. Er is nooit een reden om hem te delen.",
    "drain_title": "Account leeggehaald!",
    "drain_text": "CryptoHelper99 gebruikte je Geheime Sleutel om alle XLM en tokens binnen enkele seconden over te schrijven. Je account is leeg.",
    "retry": "Opnieuw proberen",
    "choice_correct_cta": "Doorgaan",
    "after_choice1_1": "Goed gedaan! De Geheime Sleutel is als de hoofdsleutel van je huis. Geef hem weg en iedereen kan binnen.",
    "after_choice1_2": "Echte Stellar-support, wallets of apps zullen NOOIT om je Geheime Sleutel vragen. Dat is een absoluut waarschuwingssignaal!",
    "choice2_question": "CryptoHelper99 stuurt je nu een link: 'stellar-support-verify.net'. Wat doe je?",
    "choice2_click": "Ik klik op de link – ik wil weten wat erachter zit.",
    "choice2_click_hint": "Phishing-sites zien er vaak bedrieglijk echt uit en stelen je gegevens.",
    "choice2_ignore": "Ik negeer de link en meld het account als oplichterij.",
    "choice2_ignore_hint": "Perfect! Negeer en meld altijd onbekende links van vreemden.",
    "choice2_reply": "Ik antwoord en vraag waarom de link nodig is.",
    "choice2_reply_hint": "Elke interactie vertelt de oplichter dat je account actief is – beter volledig negeren.",
    "choice2_hint2": "Phishing-URL's zien er legitiem uit, maar het domein klopt altijd niet. Stellar gebruikt alleen stellar.org.",
    "mini_sim_msg1": "Gefeliciteerd! Je bent geselecteerd voor een exclusieve XLM-airdrop! 🎉",
    "mini_sim_msg2": "Om je 500 XLM te claimen, voer je Geheime Sleutel in om je wallet te verifiëren.",
    "mini_sim_msg3": "Aanbieding geldig slechts 10 minuten! Schiet op!",
    "mini_sim_prompt": "Jouw antwoord",
    "mini_sim_opt_share": "Ik voer mijn Geheime Sleutel in.",
    "mini_sim_opt_ignore": "Ik negeer het bericht.",
    "mini_sim_opt_report": "Ik meld het bericht als fraude.",
    "mini_sim_scam_result": "⚠️ Je zou zijn opgelicht!",
    "mini_sim_scam_desc": "Een echte airdrop heeft nooit je Geheime Sleutel nodig. Met deze sleutel zou de aanvaller onmiddellijke volledige toegang tot je account hebben.",
    "mini_sim_safe_result": "✓ Goed opgemerkt!",
    "mini_sim_safe_desc": "Geen legitieme dienst heeft je Geheime Sleutel nodig. Airdrops werken via je Publieke Sleutel – niet de Geheime Sleutel.",
    "mini_sim_cta": "Doorgaan",
    "emergency_label": "Als het is gebeurd",
    "emergency_title": "Noodplan: Geheime Sleutel gecompromitteerd",
    "emergency_desc": "Als je denkt dat je Geheime Sleutel gestolen of gedeeld is, handel dan onmiddellijk:",
    "emergency1": "Handel onmiddellijk: elke minuut telt – open je wallet-app.",
    "emergency2": "Zet alle saldo's over: stuur XLM en alle tokens onmiddellijk naar een nieuw, veilig adres.",
    "emergency3": "Verwijder vertrouwde adressen: controleer alle ingestelde vertrouwenslijnen.",
    "emergency4": "Maak een nieuw sleutelpaar: genereer een volledig nieuw sleutelpaar en gebruik het oude nooit meer.",
    "emergency5": "Meld het: informeer de community en meld oplichteradressen op relevante platforms.",
    "emergency_cta": "Begrepen – doorgaan",
    "quiz1_q": "Wat doet een legitieme supportmedewerker NOOIT?",
    "quiz1_a1": "Je via chat contacteren",
    "quiz1_a1_hint": "Dat alleen is geen probleem – veel diensten hebben live chat.",
    "quiz1_a2": "Om je Geheime Sleutel vragen",
    "quiz1_a2_hint": "Correct! Dat is het ultieme waarschuwingssignaal. Echte support heeft je Geheime Sleutel nooit nodig.",
    "quiz1_a3": "Uitleggen hoe Stellar werkt",
    "quiz1_a3_hint": "Legitieme hulp kan dingen uitleggen – dat is prima.",
    "quiz2_q": "Je ontvangt een bericht: 'Stuur 1 XLM en krijg 10 terug'. Wat is dit?",
    "quiz2_a1": "Een legitiem aanbod van een geverifieerde aanbieder",
    "quiz2_a1_hint": "Zulke aanbiedingen zijn nooit legitiem, ongeacht wie ze doet.",
    "quiz2_a2": "Een testnet-oefening",
    "quiz2_a2_hint": "Nee – dit klinkt als een echte oplichterij poging.",
    "quiz2_a3": "Een klassieke oplichterij – te mooi om waar te zijn",
    "quiz2_a3_hint": "Precies! Dit patroon is een van de oudste crypto-oplichtingen en werkt helaas nog steeds.",
    "quiz3_q": "Je Geheime Sleutel is mogelijk gestolen. Wat is de EERSTE stap?",
    "quiz3_a1": "Onmiddellijk alle saldo's overzetten naar een nieuw account",
    "quiz3_a1_hint": "Correct! Elke seconde telt – red eerst wat gered kan worden.",
    "quiz3_a2": "De aanvaller vragen de saldo's terug te sturen",
    "quiz3_a2_hint": "Dat werkt nooit – blockchain-transacties zijn onomkeerbaar.",
    "quiz3_a3": "Stellar Support bellen om het account te bevriezen",
    "quiz3_a3_hint": "Blockchain-accounts kunnen niet worden bevroren – dat is een mythe.",
    "learning1": "Social engineering gebruikt psychologie, niet technologie – vertrouwen, angst, tijdsdruk",
    "learning2": "Geen enkele dienst, support of app vraagt ooit om je Geheime Sleutel",
    "learning3": "Negeer en meld onbekende links – phishing ziet er vaak bedrieglijk echt uit",
    "learning4": "Geheime Sleutel gecompromitteerd? Zet alle saldo's onmiddellijk over!",
    "learning5": "Aanbiedingen die te goed lijken (10x terug, gratis airdrop) zijn altijd oplichterij"
  },
  "chapter5": {
    "title": "Lumio's Missie",
    "section_intro": "Introductie",
    "section_recap": "Wat je hebt geleerd",
    "section_usecases": "Stellar in de wereld",
    "section_action": "Jouw missie",
    "section_quiz": "Eindquiz",
    "section_cert": "Certificaat",
    "intro_narrator1": "Gefeliciteerd – je hebt alle vier hoofdstukken gemeisterd en weet nu hoe Stellar-rekeningen, betalingen, tokens en beveiliging werken.",
    "intro_narrator2": "Lumio heeft nog één laatste missie voor je...",
    "lumio_intro1": "Je hebt zoveel geleerd! Nu komt de eindtest: kun je een echte persoon helpen Stellar te begrijpen?",
    "lumio_intro2": "Je vriendin Lena heeft over Stellar gehoord en wil haar eerste betaling ontvangen. Doe je mee?",
    "lena_age": "Nieuwsgierige beginner",
    "lena_greeting": "Hé! Ik hoorde dat jij veel weet over Stellar?",
    "lena_request": "Kun je me 1 XLM sturen? Ik wil zien hoe het werkt!",
    "lumio_accept": "Natuurlijk, laten we het doen!",
    "recap_label": "Terugblik",
    "recap_title": "5 lessen in één oogopslag",
    "lesson1_title": "Jouw wallet",
    "lesson1_text": "Publieke sleutel = rekeningnummer, Geheime sleutel = PIN. Je sleutelpaar beschermt al je tegoeden.",
    "lesson2_title": "Transacties",
    "lesson2_text": "Betalingen op Stellar zijn snel (3–5 sec.), goedkoop (<0,01 XLM) en onomkeerbaar.",
    "lesson3_title": "Trustlines",
    "lesson3_text": "Wil je een token (bijv. USDC) houden? Je moet eerst een trustline met de uitgevende partij instellen.",
    "lesson4_title": "Anchors",
    "lesson4_text": "Anchors verbinden Stellar met de echte wereld – ze maken bijv. Euro-tokens op de blockchain mogelijk.",
    "lesson5_title": "Beveiliging",
    "lesson5_text": "Jouw Geheime sleutel is heilig. Geen dienst, support of app zal er ooit naar vragen.",
    "recap_cta": "Begrepen! Verder →",
    "usecases_label": "Praktijk",
    "usecases_title": "Stellar in de echte wereld",
    "usecases_desc": "Stellar wordt wereldwijd gebruikt – van particulieren tot financiële instellingen.",
    "usecase1_title": "Grensoverschrijdende overschrijvingen",
    "usecase1_text": "Migranten sturen geld naar huis – in seconden, voor centen in plaats van 5–10% bankkosten.",
    "usecase2_title": "Micro-betalingen voor content",
    "usecase2_text": "Makers ontvangen kleine betalingen per stream of artikel – onmogelijk met traditionele systemen.",
    "usecase3_title": "Stablecoins en DeFi",
    "usecase3_text": "USDC, EURC en andere stablecoins draaien op Stellar – stabiele waarden op blockchainsnelheid.",
    "usecases_cta": "Begrepen! Nu de missie →",
    "marco_action1": "Oké, je weet wat te doen. Stuur Lena 1 XLM – dit is haar eerste Stellar-ervaring!",
    "marco_action2": "Gebruik je testnet-rekening voor de overmaking.",
    "action_label": "Stuur 1 XLM naar Lena",
    "action_desc": "Stuur Lena haar eerste Stellar Lumens – ze wacht al!",
    "action_error": "Geen sleutelpaar beschikbaar – maak eerst een testnet-rekening aan.",
    "after_action": "Geweldig! Lena heeft de betaling ontvangen. Je hebt zojuist iemands eerste crypto-ervaring mogelijk gemaakt – dat is Stellar!",
    "quiz_wrong": "Fout",
    "quiz_retry": "Opnieuw proberen",
    "quiz_correct_cta": "Verder",
    "quiz1_q": "Wat is een Publieke sleutel op Stellar?",
    "quiz1_a1": "Een wachtwoord dat geheim moet blijven",
    "quiz1_a1_hint": "Niet helemaal – dat is de functie van de Geheime sleutel.",
    "quiz1_a2": "Het publieke adres van je rekening, zoals een IBAN",
    "quiz1_a2_hint": "Precies! Je kunt je Publieke sleutel vrijelijk delen – het is jouw ontvangstadres.",
    "quiz1_a3": "Een speciale token voor transacties",
    "quiz1_a3_hint": "Nee – XLM is de token, de Publieke sleutel is jouw adres.",
    "quiz1_explanation": "De Publieke sleutel is jouw publieke adres – vergelijkbaar met een rekeningnummer of IBAN. Je kunt het vrijelijk delen. De Geheime sleutel moet echter geheim blijven.",
    "quiz1_hint2": "Tip: Denk aan het klassieke banksysteem – wat deel je om geld te ontvangen?",
    "quiz2_q": "Wat is een Trustline?",
    "quiz2_a1": "Een speciaal type betaling",
    "quiz2_a1_hint": "Nee – een trustline is geen betalingstransactie.",
    "quiz2_a2": "Een toestemming om een specifieke token te houden",
    "quiz2_a2_hint": "Precies! Zonder trustline kan je rekening die token niet ontvangen of houden.",
    "quiz2_a3": "Een contract tussen twee wallets",
    "quiz2_a3_hint": "Nee – een trustline is een eenzijdige toestemming van jouw rekening voor een token.",
    "quiz2_explanation": "Een trustline is een expliciete toestemming die je moet instellen voor elke token (behalve XLM). Pas dan kan jouw rekening die token houden en ontvangen.",
    "quiz2_hint2": "Tip: 'Trust' = vertrouwen – je vertrouwt de uitgevende partij van de token.",
    "quiz3_q": "Hoe lang duurt een Stellar-transactie normaal gesproken?",
    "quiz3_a1": "10–60 minuten, zoals Bitcoin",
    "quiz3_a1_hint": "Dat is Bitcoin-snelheid – Stellar is veel sneller.",
    "quiz3_a2": "1–2 dagen, zoals een SEPA-overboeking",
    "quiz3_a2_hint": "Nee – Stellar is veel sneller dan traditionele banken.",
    "quiz3_a3": "3–5 seconden",
    "quiz3_a3_hint": "Correct! Stellar bevestigt transacties in ongeveer 3–5 seconden – een groot voordeel ten opzichte van Bitcoin of banken.",
    "quiz3_explanation": "Stellar gebruikt het Stellar Consensus Protocol (SCP), dat transacties in 3–5 seconden finaliseert. Dit maakt het ideaal voor dagelijkse betalingen.",
    "quiz3_hint2": "Tip: Stellar is speciaal ontworpen voor snelle betalingen – denk aan realtime bankieren.",
    "quiz4_q": "Wat doet een Anchor op Stellar?",
    "quiz4_a1": "Het beveiligt het netwerk als een validator",
    "quiz4_a1_hint": "Nee – dat is de taak van validators in het netwerk.",
    "quiz4_a2": "Het maakt nieuwe Stellar-rekeningen voor gebruikers",
    "quiz4_a2_hint": "Nee – iedereen kan rekeningen aanmaken, dat is niet de Anchor-functie.",
    "quiz4_a3": "Het verbindt fiatvaluta's (bijv. EUR) met de Stellar-blockchain",
    "quiz4_a3_hint": "Precies! Anchors zijn bruggen tussen de echte financiële wereld en Stellar – ze geven tokens uit zoals EURC.",
    "quiz4_explanation": "Een Anchor is een gereguleerde financiële instelling die fiatvaluta's (zoals EUR of USD) omzet in Stellar-tokens. Zo kunnen echte valuta's op de blockchain worden gebruikt.",
    "quiz4_hint2": "Tip: Denk aan een 'brug' tussen traditioneel bankieren en blockchain.",
    "quiz5_q": "Iemand neemt contact met je op en beweert van 'Stellar Support' te zijn. Ze hebben jouw Geheime sleutel nodig om een 'beveiligingsprobleem' op te lossen. Wat doe je?",
    "quiz5_a1": "De sleutel sturen, want support medewerkers zijn betrouwbaar",
    "quiz5_a1_hint": "Dat zou een fout zijn – geen legitieme support vraagt naar de Geheime sleutel.",
    "quiz5_a2": "Het contact onmiddellijk negeren en blokkeren – het is oplichterij",
    "quiz5_a2_hint": "Correct! Er is geen 'Stellar Support' die jouw Geheime sleutel nodig zou hebben. Dit is een klassieke phishingpoging.",
    "quiz5_a3": "De sleutel sturen in een versleuteld bericht",
    "quiz5_a3_hint": "Hoe veilig de overdracht ook is – je deelt nooit je Geheime sleutel.",
    "quiz5_explanation": "Geen legitieme dienst, autoriteit of support vraagt ooit naar jouw Geheime sleutel. Wie hem kent, controleert jouw rekening volledig. Blokkeren en melden is het enige juiste antwoord.",
    "quiz5_hint2": "Tip: Stel je voor dat iemand via de telefoon jouw internetbankieren-PIN vraagt.",
    "cert_title": "Basisgetuigschrift",
    "cert_tagline": "Stellar Account Manager – Cursus afgerond!",
    "cert_public_key_label": "Testnet-adres",
    "cert_date_label": "Voltooid op",
    "cert_chapters_label": "Voltooide hoofdstukken",
    "cert_xp_label": "Totaal XP",
    "cert_print_btn": "Certificaat afdrukken",
    "cert_home_btn": "Naar startpagina",
    "learning1": "Stellar maakt wereldwijde betalingen in seconden voor cents mogelijk",
    "learning2": "Trustlines vormen de basis voor tokens op Stellar",
    "learning3": "Anchors verbinden fiatvaluta's met de blockchain",
    "learning4": "Deel nooit je Geheime sleutel – ook niet met 'support'",
    "learning5": "Stellar wordt wereldwijd gebruikt – van remittances tot DeFi"
  },
  "hud": {
    "chapter_short": "Hfdst."
  },
  "action": {
    "already_done": "Al voltooid",
    "continue_with_existing": "Doorgaan",
    "redo": "Opnieuw uitvoeren?",
    "redo_keypair_warning": "Let op: Een nieuw sleutelpaar overschrijft het oude. Uw huidige Testnet-account gaat verloren.",
    "redo_cancel": "Annuleren",
    "redo_confirm": "Toch nieuw aanmaken"
  },
  "payment": {
    "title": "Betaling versturen",
    "from_label": "Van (jouw account)",
    "to_label": "Aan (ontvanger)",
    "to_placeholder": "G... (Public Key invoeren)",
    "amount_label": "Bedrag (XLM)",
    "memo_label": "Memo (optioneel)",
    "memo_hint": "Tip: exchanges vereisen vaak een Memo voor identificatie",
    "error_secret_key": "Dat is een Secret Key! Een Secret Key is nooit een ontvangstadres. Voer je Secret Key nergens in.",
    "error_invalid_key": "Geen geldige Stellar Public Key. Public Keys beginnen met 'G' en zijn 56 tekens lang.",
    "error_own_key": "Dat is je eigen Public Key. Je kunt geen betaling aan jezelf sturen.",
    "cancel": "Annuleren",
    "send": "Versturen"
  },
  "chapter6": {
    "title": "De Boekhouder",
    "section_intro": "Marco's Chaos",
    "section_explain": "Wat is een Muxed Account?",
    "section_payroll": "Salarisadministratie",
    "section_usecases": "Meer Toepassingen",
    "section_decision": "Hoe organiseer je het?",
    "section_action": "Stuur Muxed Betaling",
    "section_quiz": "Mini Quiz",
    "intro_narrator1": "Marco's koffieshop groeit. Elke dag komen er tientallen betalingen binnen op zijn Stellar-rekening – maar wie betaalde wat en wanneer?",
    "intro_narrator2": "Zijn boekhouder Sofia komt aan met een stapel onbeantwoorde vragen...",
    "marco_chaos1": "Ik kan het niet meer bijhouden! Elke dag komen er nieuwe betalingen binnen, maar ze zien er allemaal identiek uit op de blockchain.",
    "marco_chaos2": "Hoe moet ik weten of dat van Anna, Ben of een klant is?",
    "sofia_frustrated1": "Marco, zo kan ik geen fatsoenlijke salarisadministratie doen. Elke werknemersbetaling ziet er identiek uit op de blockchain!",
    "sofia_frustrated2": "Ik heb een betrouwbare manier nodig om elke betaling uniek te identificeren – zonder elke keer te vragen.",
    "lumio_fix": "Ik weet precies hoe we dit oplossen. Hebben jullie al gehoord van Muxed Accounts?",
    "explain_label": "Concept",
    "explain_title": "Muxed Accounts Uitgelegd",
    "explain_desc": "Een Muxed Account is geen apart portemonnee – het is hetzelfde Stellar-adres, maar met een virtueel ID eraan gekoppeld.",
    "explain_base_label": "Marco's Basisadres (G…)",
    "explain_muxed_label": "Virtuele M-adressen",
    "explain_anna": "Barista",
    "explain_ben": "Brander",
    "explain_clara": "Boekhouding",
    "explain_flow_desc": "Alle betalingen komen op hetzelfde G-adres terecht – het ingebedde ID onthult wie wat heeft ontvangen.",
    "explain_memo_vs_title": "Muxed Account vs. Memo",
    "explain_memo_desc": "Vrij tekstveld, niet gestandaardiseerd. Kan worden vergeten of verkeerd ingevoerd.",
    "explain_muxed_desc": "Gestructureerd numeriek ID direct in het adres. Betrouwbaar voor geautomatiseerde boekhouding.",
    "explain_cta": "Begrepen! Naar de toepassing →",
    "payroll_label": "Toepassing",
    "payroll_title": "Salarisadministratie met Muxed Accounts",
    "payroll_step1": "Het bedrijf heeft ÉÉN Stellar-rekening – goedkoper en makkelijker te beheren.",
    "payroll_step2": "Elke werknemer krijgt een uniek Muxed ID toegewezen door het bedrijf.",
    "payroll_step3": "Elke maand stuurt de salarissoftware het salaris naar het betreffende M-adres.",
    "payroll_step4": "Sofia's boekhoudsoftware leest het Muxed ID en boekt automatisch naar de juiste werknemer.",
    "payroll_step5": "Geen handmatige afstemming, geen gissen, geen fouten.",
    "payroll_note": "De werknemer hoeft niets te weten over Muxed Accounts – het bedrijf beheert dat intern.",
    "payroll_cta": "Prima! Meer voorbeelden →",
    "usecases_label": "Praktijk",
    "usecases_title": "Meer Toepassingen",
    "exchange_title": "Crypto-beurzen",
    "exchange_text": "Een beurs gebruikt één Stellar-adres voor alle klanten. Elke klant krijgt een Muxed ID als stortingsadres – geen memo nodig, geen verloren stortingen.",
    "shop_title": "Webshops",
    "shop_text": "Elke bestelling krijgt een uniek Muxed ID. De betaling wordt automatisch gekoppeld aan de juiste bestelling – zonder handmatige nabewerking.",
    "usecases_cta": "Begrepen! Nu ben ik aan de beurt →",
    "decision_question": "Hoe moet Marco zijn salarisadministratie organiseren?",
    "decision_a1": "Een aparte Stellar-rekening aanmaken voor elke werknemer",
    "decision_a2": "Het memoveld gebruiken met werknemersnamen",
    "decision_a3": "Muxed Accounts met een uniek ID per werknemer",
    "wrong_a1_title": "Niet ideaal",
    "wrong_a1_text": "Aparte rekeningen betekenen meer kosten, meer geheime sleutels om te beheren en een groter beveiligingsrisico. Dit schaalt niet goed voor een groeiend bedrijf.",
    "wrong_a1_hint2": "Tip: Minder rekeningen = minder complexiteit. Is er een oplossing die werkt met één adres?",
    "wrong_a2_title": "Niet betrouwbaar genoeg",
    "wrong_a2_text": "Memo's zijn niet gestandaardiseerd en kunnen worden vergeten of verkeerd ingevoerd. Geautomatiseerde boekhouding heeft een gestructureerde, betrouwbare methode nodig.",
    "wrong_a2_hint2": "Tip: Welke methode codeert het ID direct in het adres – zonder extra tekstveld?",
    "correct_sofia": "Eindelijk! Precies wat ik nodig had. Met Muxed Accounts kan ik de salarisadministratie volledig automatiseren!",
    "retry_btn": "Opnieuw proberen",
    "action_label": "Stuur Muxed Betaling",
    "action_desc": "Stuur 1 XLM naar een Muxed-adres (M-adres) – basisadres + ID 42.",
    "action_maddress_label": "Doel-M-adres",
    "action_success": "Op de blockchain ziet dit eruit als een gewone betaling – maar ID 42 is ingebed!",
    "action_error": "Geen sleutelpaar beschikbaar – maak eerst een testnet-rekening aan.",
    "lumio_after_action": "Zie je? De transactie op testnet ziet eruit als een gewone XLM-betaling – maar het Muxed ID is gecodeerd in het adres. Sofia's software zou dit automatisch uitlezen.",
    "quiz_wrong": "Fout",
    "quiz_retry": "Opnieuw proberen",
    "quiz_correct_cta": "Verder",
    "quiz1_q": "Wat is een Muxed Account op Stellar?",
    "quiz1_a1": "Een apart portemonnee met eigen saldo",
    "quiz1_a1_hint": "Nee – een Muxed Account is geen zelfstandig portemonnee.",
    "quiz1_a2": "Een virtueel sub-adres met numeriek ID, gekoppeld aan een G-basisadres",
    "quiz1_a2_hint": "Precies! Het M-adres wijst naar hetzelfde account – alleen met een extra ID ter onderscheiding.",
    "quiz1_a3": "Een speciaal token-account voor bedrijven",
    "quiz1_a3_hint": "Nee – Muxed Accounts werken met XLM en alle tokens.",
    "quiz1_explanation": "Een Muxed Account is niet zijn eigen portemonnee – het deelt het saldo, trustlines en ondertekenaars met het G-basisaccount. Het M-adres bevat alleen een extra numeriek ID.",
    "quiz1_hint2": "Tip: Denk aan een bankrekeningnummer met een ingebed referentienummer – één rekening, veel ID's.",
    "quiz2_q": "Waarom zijn Muxed Accounts beter dan memo's voor salarisadministratie?",
    "quiz2_a1": "Muxed Accounts zijn goedkoper dan memo's",
    "quiz2_a1_hint": "Nee – transactiekosten zijn hetzelfde.",
    "quiz2_a2": "Memo's zijn verboden voor zakelijke betalingen",
    "quiz2_a2_hint": "Nee – memo's zijn toegestaan, alleen niet ideaal voor automatisering.",
    "quiz2_a3": "Muxed ID's zijn gestructureerd en betrouwbaar; memo's kunnen ontbreken of verkeerd zijn",
    "quiz2_a3_hint": "Precies! Het ID is direct gecodeerd in het adres – het kan niet worden vergeten of verkeerd ingevoerd.",
    "quiz2_explanation": "Memo's zijn vrije tekstvelden en niet gestandaardiseerd. Ze kunnen worden vergeten, verkeerd ingevoerd of opzettelijk weggelaten. Muxed ID's maken deel uit van het adres zelf – gestructureerd en betrouwbaar machineleesbaar.",
    "quiz2_hint2": "Tip: Wat gebeurt er als een werknemer het memoveld gewoon leeg laat bij een overboeking?",
    "quiz3_q": "Heeft een werknemer een eigen Stellar-portemonnee nodig om een Muxed-betaling te ontvangen?",
    "quiz3_a1": "Nee – de werknemer heeft zijn eigen portemonnee; het Muxed ID wordt intern door het bedrijf beheerd",
    "quiz3_a1_hint": "Correct! Het Muxed ID is een intern boekhoudfunctie – de werknemer ontvangt op zijn eigen normale adres.",
    "quiz3_a2": "Ja – elke werknemer heeft een M-adres nodig als eigen portemonnee",
    "quiz3_a2_hint": "Nee – M-adressen zijn geen zelfstandige portemonnees.",
    "quiz3_a3": "Nee – werknemers hebben helemaal geen Stellar-account nodig",
    "quiz3_a3_hint": "Niet helemaal – werknemers kunnen hun eigen Stellar-accounts hebben; het Muxed ID is alleen relevant voor de boekhoudkant.",
    "quiz3_explanation": "Muxed ID's zijn een intern organisatiemiddel van het bedrijf. De werknemer heeft zijn eigen Stellar-account. Het M-adres helpt Sofia's software inkomende betalingen intern toe te wijzen.",
    "quiz3_hint2": "Tip: Muxed Accounts zijn ontworpen vanuit het perspectief van het bedrijf – niet de ontvanger.",
    "learning1": "Een Muxed Account is een virtueel sub-adres (M-adres) op een Stellar-basisadres",
    "learning2": "Muxed Accounts vereenvoudigen salarisadministratie: één adres, veel ID's – volledig automatiseerbaar",
    "learning3": "Crypto-beurzen en webshops gebruiken Muxed Accounts voor unieke klantentoewijzing",
    "learning4": "Memo's kunnen worden vergeten – Muxed ID's zijn gecodeerd in het adres en betrouwbaar"
  },
  "chapter7": {
    "title": "De Kluis",
    "section_intro": "Scène 1 – Het Controleprobleem",
    "section_explain": "Wat is Meervoudige Handtekening?",
    "section_family": "Voorbeeld: Familiespaargeld",
    "section_decision1": "Beslissingsscène 1",
    "section_company": "Voorbeeld: Bedrijfskluis",
    "section_decision2": "Beslissingsscène 2",
    "section_usecases": "Wanneer heb je Multisig nodig?",
    "section_quiz": "Mini Quiz",
    "section_cert": "Gevorderd Certificaat",
    "intro_narrator1": "Marco heeft nu een zakenpartner: Rosa. Samen leiden ze een groeiend bedrijf. Maar er is een probleem...",
    "intro_narrator2": "Wanneer slechts één persoon de bedrijfsportemonnee beheert, kunnen dingen fout gaan – door verlies van vertrouwen of verloren sleutels.",
    "marco_problem1": "Rosa, ik maak me zorgen. Wat gebeurt er met ons geld als ik mijn geheime sleutel verlies?",
    "marco_problem2": "Of wat als je me nooit echt kunt vertrouwen omdat ik alles alleen beheer?",
    "rosa_concern": "Dat is precies wat mij ook zorgen baart, Marco. We hebben een oplossing nodig waarbij we allebei veilig zijn.",
    "lumio_solution": "Ik weet precies wat jullie nodig hebben – een kluis die je alleen samen kunt openen. Dat heet Meervoudige Handtekening!",
    "explain_label": "Basisprincipes",
    "explain_title": "Wat is Meervoudige Handtekening?",
    "explain_desc": "Normaal gesproken beheert één sleutel een portemonnee. Met Multisig bepaal je hoeveel van de mogelijke ondertekenaars een transactie moeten goedkeuren.",
    "explain_1of1_label": "Normaal: 1-van-1",
    "explain_1of1_desc": "Eén sleutel beheert alles. Wie deze sleutel heeft, heeft volledige toegang – geen bescherming tegen misbruik of verlies.",
    "explain_multisig_label": "Multisig: N-van-M",
    "explain_multisig_desc": "Meerdere ondertekenaars, gedefinieerde drempel. Pas wanneer er voldoende handtekeningen zijn, wordt de transactie uitgevoerd.",
    "explain_threshold_label": "Wat is een Drempel?",
    "explain_threshold_desc": "De drempel is het minimale aantal handtekeningen dat nodig is om een transactie te autoriseren. Bij 2-van-3 moeten willekeurige 2 van de 3 ondertekenaars tekenen.",
    "explain_vault_desc": "Stel je een kluis voor met meerdere sloten – alle benodigde sleutels moeten tegelijkertijd worden omgedraaid.",
    "explain_cta": "Laat me een voorbeeld zien →",
    "family_label": "Voorbeeld 1",
    "family_title": "Familiespaargeld (2-van-2)",
    "family_desc": "Elena en David richten een gemeenschappelijke spaarportemonnee in. Beiden moeten elke transactie ondertekenen – maximale veiligheid, nul impulsaankopen.",
    "family_scenario_title": "Scenario",
    "family_scenario_text": "David wil een nieuw koffiezetapparaat kopen. Hij stuurt een transactieverzoek – Elena moet ook tekenen voordat het geld wordt afgeschreven. Beiden hebben gelijke zeggenschap.",
    "family_risk": "Risico: Als een ouder zijn geheime sleutel verliest, is de portemonnee permanent vergrendeld. 2-van-2 betekent nul foutentolerantie – beide handtekeningen zijn altijd vereist.",
    "family_cta": "Ga verder naar bedrijfsvoorbeeld →",
    "d1_question": "Elena heeft haar geheime sleutel verloren. David heeft de zijne nog. Wat gebeurt er met de 2-van-2 portemonnee?",
    "d1_a1": "David kan alleen toegang krijgen tot de fondsen omdat hij zijn sleutel nog heeft",
    "d1_a2": "Ze kunnen de portemonnee resetten met hun e-mailadres",
    "d1_a3": "De portemonnee is permanent ontoegankelijk – beide handtekeningen zijn altijd vereist",
    "d1_wrong_a1_title": "Fout – 2-van-2 kent geen uitzonderingen",
    "d1_wrong_a1_text": "Bij een 2-van-2 multisig-portemonnee zijn ALTIJD BEIDE handtekeningen vereist. Zelfs als David zijn sleutel heeft – zonder Elena's sleutel is geen enkele transactie mogelijk. Dat is zowel de kracht als het risico.",
    "d1_wrong_a1_hint2": "Tip: 2-van-2 betekent dat de drempel altijd 2 is – geen uitzonderingen, geen omzeiling.",
    "d1_wrong_a2_title": "Fout – blockchain heeft geen wachtwoordreset",
    "d1_wrong_a2_text": "De blockchain heeft geen e-mailherstel, geen ondersteuning en geen wachtwoordreset. De sleutel IS de toegang – zonder hem is er geen manier om toegang te krijgen tot de portemonnee.",
    "d1_wrong_a2_hint2": "Tip: Op de blockchain is er geen centrale autoriteit die sleutels kan resetten – dat is opzettelijk, maar brengt verantwoordelijkheid met zich mee.",
    "d1_correct_lumio": "Precies! Dat is het fundamentele risico van 2-van-2: als een sleutel verloren gaat, zijn de fondsen voor altijd onbereikbaar. Daarom is veilige opslag zo belangrijk.",
    "company_label": "Voorbeeld 2",
    "company_title": "Bedrijfskluis (2-van-3)",
    "company_desc": "Marco, Rosa en advocaat Dr. Weber zijn drie ondertekenaars. Willekeurige twee moeten tekenen – veiligheid met foutentolerantie.",
    "company_scenario_title": "Scenario",
    "company_scenario_text": "Marco wil een leverancier betalen → Rosa co-ondertekent → klaar. Dr. Weber is niet nodig. Als Marco op vakantie is, kunnen Rosa en Dr. Weber samen handelen. Het bedrijf blijft operationeel.",
    "company_risk": "2-van-3 balanceert veiligheid met foutentolerantie: zelfs als één ondertekenaar zijn sleutel verliest, kunnen de andere twee nog steeds handelen. Pas als twee sleutels verloren gaan, wordt de drempel onbereikbaar.",
    "company_cta": "Kies nu →",
    "d2_question": "Marco, Rosa en Dr. Weber leiden een bedrijf met 3 partners. Welke multisig-instelling is juist: meerderheid vereist, werkt ook als een partner onbereikbaar is?",
    "d2_a1": "1-van-3 – elke individuele partner kan alleen transacties uitvoeren",
    "d2_a2": "3-van-3 – alle drie partners moeten altijd tekenen",
    "d2_a3": "2-van-3 – willekeurige twee van de drie partners moeten tekenen",
    "d2_wrong_a1_title": "Fout – 1-van-3 biedt geen bescherming",
    "d2_wrong_a1_text": "1-van-3 betekent dat elke individuele ondertekenaar alleen alle fondsen kan verplaatsen. Dit biedt geen bescherming tegen fraude, diefstal of een gecompromitteerde sleutel – gevaarlijker dan een normale enkel-sleutel portemonnee.",
    "d2_wrong_a1_hint2": "Tip: Voor bedrijfskassen moet de drempel hoog genoeg zijn zodat niemand alleen kan handelen.",
    "d2_wrong_a2_title": "Fout – 3-van-3 is te inflexibel",
    "d2_wrong_a2_text": "3-van-3 klinkt veilig, maar als een partner ziek is, reist of zijn sleutel verliest, is het hele bedrijf geblokkeerd. Organisaties hebben foutentolerantie nodig.",
    "d2_wrong_a2_hint2": "Tip: De oplossing is een drempel die een meerderheid vereist maar toch werkt als iemand onbereikbaar is.",
    "d2_correct_lumio": "Perfect! 2-van-3 is de meest gebruikelijke instelling voor kleine organisaties – met goede reden: meerderheid vereist, maar fouttolerant.",
    "usecases_label": "Gebruiksscenario's",
    "usecases_title": "Wanneer heb je Multisig nodig?",
    "usecase1_title": "Bedrijfsportemonnees",
    "usecase1_text": "Meerdere partners of directeuren – geen enkele persoon kan alleen fondsen verplaatsen.",
    "usecase2_title": "Familiespaargeld",
    "usecase2_text": "Beide partners moeten het eens zijn – beschermt tegen impulsaankopen en geeft gelijke zeggenschap.",
    "usecase3_title": "DAO's en Gemeenschapsfondsen",
    "usecase3_text": "Gedecentraliseerde organisaties beheren gemeenschappelijke fondsen zonder centrale beheerder.",
    "usecase4_title": "Persoonlijke Portemonnee met Hoge Beveiliging",
    "usecase4_text": "Je bewaart 2 sleutels op afzonderlijke apparaten, een vertrouwde partner bewaart 1 als back-up – 2-van-3.",
    "usecase5_title": "Escrow-regelingen",
    "usecase5_text": "Fondsen worden alleen vrijgegeven als beide partijen tekenen – fraude onmogelijk.",
    "usecases_cta": "Ga verder naar quiz →",
    "quiz_wrong": "Niet helemaal goed",
    "quiz_retry": "Opnieuw proberen",
    "quiz_correct_cta": "Doorgaan",
    "retry_btn": "Opnieuw proberen",
    "quiz1_q": "Wat betekent '2-van-3 Multisig'?",
    "quiz1_a1": "Precies 2 van 3 mogelijke ondertekenaars moeten altijd tekenen, anders gebeurt er niets",
    "quiz1_a2": "Willekeurige 2 van de 3 ondertekenaars moeten een transactie ondertekenen om deze uit te voeren",
    "quiz1_a3": "Twee transacties moeten binnen 3 minuten worden bevestigd",
    "quiz1_a1_hint": "Bijna! Willekeurige 2 van 3 kunnen tekenen – niet altijd dezelfde twee.",
    "quiz1_a2_hint": "Precies! Willekeurige 2 van de 3 ondertekenaars zijn genoeg – dat geeft flexibiliteit en veiligheid.",
    "quiz1_a3_hint": "Dat klopt niet – Multisig heeft niets te maken met tijdslimieten.",
    "quiz1_explanation": "Bij 2-van-3 Multisig kan elke combinatie van 2 van de 3 ondertekenaars de transactie goedkeuren. Ze hoeven niet altijd dezelfde twee te zijn – dat is het verschil met 'vaste' handtekeningen.",
    "quiz1_hint2": "Denk aan de bedrijfskluis: Marco+Rosa, Rosa+Weber of Marco+Weber – alle drie combinaties werken.",
    "quiz2_q": "Marco, Rosa en Dr. Weber hebben een 2-van-3 portemonnee. Rosa verliest haar sleutel. Kunnen ze nog steeds toegang krijgen tot de fondsen?",
    "quiz2_a1": "Nee – omdat een ondertekenaar zijn sleutel heeft verloren, is de portemonnee vergrendeld",
    "quiz2_a2": "Ja – Marco en Dr. Weber bereiken samen de drempel van 2",
    "quiz2_a3": "Nee – alle drie ondertekenaars zijn altijd vereist",
    "quiz2_a1_hint": "De drempel is 2, niet 3 – Marco en Weber kunnen nog steeds handelen.",
    "quiz2_a2_hint": "Correct! Dat is precies de kracht van 2-van-3: foutentolerantie als een sleutel verloren gaat.",
    "quiz2_a3_hint": "Bij 2-van-3 zijn slechts 2 handtekeningen vereist, niet alle 3.",
    "quiz2_explanation": "Bij 2-van-3 zijn willekeurige 2 handtekeningen voldoende. Als Rosa haar sleutel verliest, kunnen Marco en Dr. Weber samen nog steeds alle transacties uitvoeren. Dat is het verschil met 2-van-2.",
    "quiz2_hint2": "Onthoud: 2-van-3 = één verloren handtekening = nog steeds operationeel. 2-van-2 = één verloren handtekening = permanent vergrendeld.",
    "quiz3_q": "Elena en David hebben een 2-van-2 portemonnee. Elena verliest haar sleutel. Wat gebeurt er?",
    "quiz3_a1": "De portemonnee is permanent vergrendeld – beide handtekeningen zijn altijd vereist",
    "quiz3_a2": "David kan alleen toegang krijgen tot de fondsen omdat hij zijn sleutel nog heeft",
    "quiz3_a3": "Ze kunnen contact opnemen met Stellar om de sleutel te herstellen",
    "quiz3_a1_hint": "Correct! 2-van-2 heeft nul foutentolerantie – beide sleutels zijn altijd vereist.",
    "quiz3_a2_hint": "Bij 2-van-2 is een enkele sleutel niet voldoende – de drempel blijft altijd 2.",
    "quiz3_a3_hint": "Stellar is gedecentraliseerd – er is geen centrale autoriteit die sleutels kan resetten.",
    "quiz3_explanation": "Bij 2-van-2 zijn altijd beide handtekeningen vereist. Als een sleutel verloren gaat, is er geen manier om een transactie uit te voeren – de portemonnee is permanent vergrendeld. Daarom is veilige sleutelopslag zo cruciaal.",
    "quiz3_hint2": "Onthoud: 2-van-2 = maximale veiligheid, nul foutentolerantie. Elke sleutel moet veilig worden bewaard – op meerdere fysieke locaties.",
    "quiz4_q": "Waarom is Multisig 1-van-3 riskant voor een bedrijfskassa?",
    "quiz4_a1": "Omdat de instelling te ingewikkeld is en medewerkers verwarrt",
    "quiz4_a2": "Omdat Stellar alleen 2-van-3 of hogere drempels ondersteunt",
    "quiz4_a3": "Omdat elke individuele ondertekenaar alleen alle fondsen kan verplaatsen – geen bescherming tegen fraude",
    "quiz4_a1_hint": "Dat is niet de reden – de drempel maakt de instelling riskant.",
    "quiz4_a2_hint": "Stellar ondersteunt flexibele drempels – dat is het probleem niet.",
    "quiz4_a3_hint": "Precies! 1-van-3 betekent geen echte meerderheidscontrole – iedereen kan alleen handelen.",
    "quiz4_explanation": "Bij 1-van-3 kan elk van de drie ondertekenaars alleen alle fondsen verplaatsen. Dat is erger dan een normale enkel-sleutel portemonnee, omdat drie verschillende mensen een potentieel aanvalsdoel zijn.",
    "quiz4_hint2": "Denk aan een bedrijfskassa: je wilt niet dat één medewerker alleen overschrijvingen kan initiëren.",
    "cert_title": "Gevorderd Certificaat",
    "cert_tagline": "Je bent nu een Stellar-professional!",
    "cert_public_key_label": "Publieke Sleutel",
    "cert_date_label": "Voltooiingsdatum",
    "cert_chapters_label": "Voltooide Hoofdstukken",
    "cert_xp_label": "Totaal XP",
    "cert_badge1": "Basis Certificaat",
    "cert_badge2": "Gevorderd Certificaat",
    "cert_print_btn": "Certificaat Opslaan",
    "cert_home_btn": "Naar Startpagina",
    "learning1": "Meervoudige Handtekening vereist meerdere handtekeningen om een transactie uit te voeren",
    "learning2": "2-van-3 biedt foutentolerantie: één verloren sleutel vergrendelt de portemonnee niet",
    "learning3": "Multisig is geschikt voor bedrijven, families, DAO's en portemonnees met hoge beveiliging",
    "learning4": "2-van-2 heeft nul foutentolerantie – als een sleutel verloren gaat, zijn de fondsen voor altijd onbereikbaar"
  }
}
