{
  "title": "Kreiraj račun + multisig",
  "menu": "Kreiraj račun + Multisig",
  "menuHint": "Kreiraj novi račun i opcionalno postavi više potpisa (multisig)",
  "hint": "Kreiraj novi račun, aktiviraj ga i po želji konfiguriraj multisig.",
  "generateKeys": "Generiraj ključ",
  "enableMultisig": "Omogući multisig",
  "signersTitle": "Potpisnik",
  "signersInfo": "Dodaj dodatne potpisnike i postavi odgovarajuće pragove.",
  "signersCount": "Broj potpisnika",
  "bestPractices": {
    "title": "Najbolje prakse",
    "text": "Čuvajte tajne ključeve sigurnima i nemojte ih distribuirati nepotrebno."
  },
  "instructions": {
    "public": "Podijelite ovaj javni ključ s drugima za plaćanja.",
    "secret": "Čuvajte ovaj tajni ključ sigurnim; nikad ga nemojte dijeliti."
  },
  "generateFirst": "Molimo, prvo generirajte par ključeva.",
  "confirmLowBalance": "Početno stanje {bal} XLM je ispod preporučene rezerve {req} XLM (Potpisnici: {count}). Nastaviti?",
  "activated": "Račun je aktiviran. Hash: {hash}",
  "activatedTestnet": "Račun je aktiviran na testnetu putem Friendbota.",
  "alreadyActive": "Korisnički račun je već aktiviran.",
  "createdNoSigners": "Račun je kreiran, multisig nije konfigurisan.",
  "createdAndConfigured": "Račun je kreiran i multisig je konfigurisan. Hash: {hash}",
  "info": {
    "more": "Više informacija",
    "keysOnPage": {
      "title": "Ključ na ovoj stranici",
      "text": "⚠️ VAŽNO: Ova web stranica NIKADA ne pohranjuje vaš tajni ključ!\n\nTajni ključ prikazan ovdje postoji samo u vašem pregledniku (lokal im Arbeitsspeicher). Nakon što ponovo učitate ili napustite stranicu, on je nepovratno izgubljen.\n\nKopirajte ili zabilježite tajni ključ odmah nakon generiranja prije zatvaranja stranice.\n\nProvjera: Možete koristiti alate za razvojne programere preglednika (F12 → Mreža) da provjerite da nijedan tajni ključ nije prenesen eksterno. Samo potpisane transakcije se šalju, nikada vaš tajni ključ."
    },
    "title": "Važne informacije",
    "secureKeys": {
      "title": "Sigurni tajni ključ",
      "text": "Javni ključ se može sigurno dijeliti – slično je kao broj računa.\n\nTajni ključ omogućuje pristup vašem računu. Tretirajte ga kao lozinku:\n• NIKADA ga nemojte pohranjivati u oblak usluge, e-poruke ili nesigurne bilješke\n• Zapišite ga na papir ili koristite hardverski novčanik\n• Izradite višestruke sigurnosne kopije i pohranite ih na sigurna, odvojena mjesta\n• Ako se tajni ključ izgubi, pristup računu je trajno izgubljen"
    },
    "multisigSection": {
      "title": "Multisig (Mehrfachsignatur)",
      "text": "Kod multisig možete definirati više potpisnika za vaš račun. Transakcije tada zahtijevaju potpise s više ključeva (multisig).\n\nPrednosti:\n• Poboljšana sigurnost (security)\n• Zajednički računi (shared accounts)\n• Hitni oporavak (emergency recovery)\n\nOPREZ: Prvo testirajte multisig na testnetu prije implementacije na glavnu mrežu! Pogrešna konfiguracija može rezultirati gubitkom pristupa računu."
    },
    "diagram": {
      "title": "Istek potpisa"
    }
  },
  "activateHint": "Aktivacija je potrebna kako bi račun postojao. Na Testnetu, putem Friendbot-a; na Mainnetu, putem \"Create Account\" iz postojećeg novčanika.",
  "activateNow": "Odmah aktivirajte račun.",
  "activateOnly": "Samo aktiviraj",
  "balanceWarning": "Početno stanje je vjerojatno prenisko za dodavanje {{count}} dodatnih potpisnika (minimalna rezerva: {{req}} XLM).",
  "createButton": "Kreiraj / Postavi Multisig",
  "mainnetActivateNote": "Napomena: Dodatne rezerve su potrebne za Multisig. 1 XLM često nije dovoljan.",
  "reserve": {
    "base": "Osnovna rezerva po unosu: {{val}} XLM",
    "recommended": "Preporučeni početni saldo: {{val}} XLM (inkl. Puffer)",
    "required": "Obavezna minimalna rezerva (neu): {{val}} XLM"
  },
  "signersCountHint": "Minimalni broj potpisa postavljate u nastavku pod \"Required Signatures\" (niedrig/mittel/hoch).",
  "signersCountLimit": "Napomena: Granica mreže (Stellar): maksimalno 20 dodatnih potpisnika.",
  "startingBalance": "Početno stanje (XLM)",
  "keyWarning": {
    "title": "⚠️ Osiguraj ključ sada!",
    "text1": "Generirali ste novi par ključeva.",
    "text2": "Odmah osiguraj OBA ključa prije nastavka:",
    "list1": "Javni ključ: Vaša adresa računa, može se dijeliti",
    "list2": "Tajni ključ (Geheimschlüssel): Vaša lozinka – NIKADA ne dijelite niti čuvajte online!",
    "list3": "Ako je tajni ključ izgubljen, pristup je nepovratno izgubljen.",
    "confirm": "Osigurao sam oba ključa."
  },
  "muxedId": "Muxed-ID",
  "muxedInfo": "Mit der Muxed-ID wird eine M-Adresse (M...) erstellt. Sie verweist auf dasselbe Konto wie die reguläre Adresse (G...).",
  "muxedIdInvalid": "Muxed-ID mora biti cijeli broj između 0 i 18.446.744.073.709.551.615.",
  "muxedAddress": "Muxed adresa",
  "muxedActivationInfo": "Muxed adrese su alias adrese. Ne trebaju biti posebno aktivirane."
}