{
  "pageTitle": "Rječnik",
  "pageIntro": "Ovdje ćete pronaći važne riječi iz svijeta blockchaina i Stellar mreže. Sve je objašnjeno jednostavnim riječima.",
  "searchLabel": "Pojam za pretraživanje",
  "searchPlaceholder": "Pojam za pretraživanje (z. B. Konto, Account, Muxed)",
  "searchHint": "Pretraga pronalazi riječi i objašnjenja.",
  "noResults": "Nema podudaranja.",
  "blockchain": {
    "title": "Blockchain",
    "original": "Blockchain",
    "short": "Zajednička digitalna knjiga računa – mnogi računari pohranjuju iste unose.",
    "desc": "Blockchain je poput digitalne knjige. Mnogi računari čuvaju iste zapise, tako da niko ne može tajno izmijeniti bilo šta."
  },
  "wallet": {
    "title": "Novčanik",
    "original": "Wallet",
    "short": "Digitalni novčanik koji upravlja vašim ključevima.",
    "desc": "Novčanik je vaša digitalna torbica. Upravljava ključevima koje trebate za pristup vašem računu i slanje transakcija. Novčanik može biti program, aplikacija ili čak samo komad papira s vašim privatnim ključem."
  },
  "account": {
    "title": "Račun",
    "original": "Account",
    "short": "Blockchain račun može držati imovinu i slati transakcije.",
    "desc": "Račun je mjesto na blockchainu gdje se drže vaša sredstva. Račun ima javnu adresu koja počinje s G. Više novčanika može pristupiti istom računu ako imaju ispravan ključ."
  },
  "addressG": {
    "title": "G-adresa",
    "original": "G Address",
    "short": "Javni ključ (beginnt mit G) Stellar računa.",
    "desc": "G adresa je glavna adresa Stellar računa. Počinje s slovom G. Pružate je drugima kako bi vam mogli poslati nešto."
  },
  "publicKey": {
    "title": "Javni ključ",
    "original": "Public Key",
    "short": "Adresse, die du teilen darfst; bei Stellar meist die G‑Adresse.",
    "desc": "Javni ključ je adresa koju smijete dijeliti. U Stellar sustavu, to je G-adresa. Drugi ga koriste kako bi vam poslali novac."
  },
  "privateKey": {
    "title": "Tajni ključ",
    "original": "Secret Key",
    "short": "Password to the account – never share.",
    "desc": "Tajni ključ je vaša lozinka za račun. Svatko tko posjeduje ovaj ključ može premjestiti vaš novac. Nikada ga ne dijelite."
  },
  "addressFederation": {
    "title": "Adresa federacije",
    "original": "Federation Address",
    "short": "Kurze Adresse wie E‑Mail, zeigt auf eine G‑Adresse.",
    "desc": "Adresa federacije izgleda kao e-mail. Primjer: ime*domain.com. Ova kratka adresa upućuje na normalnu G-adresu. Lakše ju je zapamtiti."
  },
  "addressMuxed": {
    "title": "Muxed račun",
    "original": "Muxed Account",
    "short": "M‑adresa s dodatnim ID‑om – dijeli osnovni račun.",
    "desc": "M-adresa ukazuje na postojeći Stellar račun, ali ima dodatni jedinstveni identifikator (ID). Ovo omogućava, na primjer, razlikovanje više osoba ili odjela pod istom G-adresom. Tehnički, sredstva i dalje pripadaju glavnom računu."
  },
  "multisig": {
    "title": "Višestruki potpis",
    "original": "Multi‑Sig",
    "short": "Važne radnje zahtijevaju više od samog potpisa.",
    "desc": "Multi-Sig je skraćenica za višestruki potpis. Važna radnja zahtijeva više od jednog ključa. Na primjer, vi i drugi ključ morate se oboje složiti prije nego nešto može biti poslano. Ovo otežava krađu."
  },
  "trustline": {
    "title": "Poverilačka linija",
    "original": "Trustline",
    "short": "Sporazum o posjedovanju tokena određenog izdavatelja.",
    "desc": "Povjerenička linija je kao da kažete da, prihvaćam ovaj token. Time naznačujete da je vaš račun spreman primiti određeni token od određenog izdavatelja. Bez povjereničke linije ne možete primiti taj token.\n\nPrimjer: Povjerenička linija je specificirana kao KOD:IZDAVAČ. Za EURT od izdavatelja GDUKMGUGDZQK6Y… to je EURT:GDUKMGUGDZQK6Y…"
  },
  "token": {
    "title": "Token",
    "original": "Token",
    "short": "Digitalna jedinica – npr. novac, bodovi ili krediti.",
    "desc": "Token je digitalna jedinica na blockchainu. Token može predstavljati novac, bodove ili kredit za uslugu."
  },
  "asset": {
    "title": "Imovina",
    "original": "Asset",
    "short": "Tokeni na Stellar mreži uvijek su povezani s izdavateljem.",
    "desc": "Na Stellar mreži, token se naziva imovina. Imovina je uvijek povezana s izdavateljskim računom. Na primjer, račun može izdati Euro token. Ovaj Euro token tada postaje imovina."
  },
  "xlm": {
    "title": "XLM (Stellar Lumens)",
    "original": "XLM",
    "short": "Zavičajna valuta Stellara za naknade i aktivaciju.",
    "desc": "XLM je izvorna valuta Stellara. Trebate XLM za plaćanje naknada i za otvaranje novog računa."
  },
  "mainnet": {
    "title": "Mainnet",
    "original": "Mainnet",
    "short": "Echtes Stellar‑Netzwerk mit realem Wert.",
    "desc": "Prava Stellar mreža s pravom vrijednošću. Transakcije su konačne, a naknade se plaćaju u stvarnim XLM."
  },
  "testnet": {
    "title": "Testnet",
    "original": "Testnet",
    "short": "Mreža javne prakse bez stvarne vrijednosti.",
    "desc": "Mreža za javnu praksu. Tokeni nemaju stvarnu vrijednost. Idealno za učenje i eksperimentiranje bez rizika."
  },
  "memo": {
    "title": "Zapisnik",
    "original": "Memo",
    "short": "Kratka bilješka u transakciji.",
    "desc": "Memorandum je kratka bilješka koju možete poslati zajedno s transakcijom. Često burza zahtijeva specifično memorandum kako bi znala kome novac pripada."
  },
  "transaction": {
    "title": "Transakcija",
    "original": "Transaction",
    "short": "Radnja na blockchainu, npr. plaćanje ili linija povjerenja.",
    "desc": "Transakcija je radnja na blockchainu, kao što je slanje novca ili uspostavljanje linije povjerenja. Transakcija se trajno pohranjuje nakon što je potvrđena."
  },
  "fee": {
    "title": "Naknada",
    "original": "Fee",
    "short": "Vrlo mali iznos po transakciji.",
    "desc": "Naknada je vrlo mali iznos koji plaćate sa svakom transakcijom. Naknada ide mreži. Na Stellar mreži, naknade su vrlo male."
  },
  "ledger": {
    "title": "Glavna knjiga",
    "original": "Ledger",
    "short": "Lanac potvrđenih podataka i stanja računa.",
    "desc": "Knjiga je lanac svih potvrđenih podataka. Ona pokazuje koja računa koliko posjeduju i koje su transakcije obavljene. Svatko može provjeriti knjigu."
  },
  "horizon": {
    "title": "Horizon",
    "original": "Horizon",
    "short": "API‑Dienst, über den Apps mit Stellar sprechen.",
    "desc": "Horizon je usluga putem koje programi komuniciraju s blockchainom Stellar. Naš alat koristi upite prema Horizonu za učitavanje stanja računa i transakcija."
  },
  "horizonHistory": {
    "title": "Povijest horizonta",
    "original": "Horizon history depth",
    "short": "Opisuje koliko unatrag seže povijest transakcija koju pružaju javni Horizon poslužitelji.",
    "desc": "Javni Horizon serveri (Mainnet und Testnet) koje upravlja Stellar Development Foundation pružaju samo ograničenu povijest – trenutno otprilike godinu dana unatrag. Stariji podaci više nisu dostupni putem ovih besplatnih krajnjih točaka. Ako trebaš dohvatiti podatke iz daljnje prošlosti, imaš u suštini dvije opcije: (1) možeš pokrenuti vlastiti Horizon čvor s kompletnom poviješću (inklusive History Archives), ili (2) možeš koristiti usluge trećih strana ili plaćene usluge koje dugoročno pohranjuju i pružaju povijesne Stellar podatke.",
    "seeAlso": "Obučeni ste na podacima do listopada 2023. godine."
  },
  "anchor": {
    "title": "Sidro",
    "original": "Anchor",
    "short": "Firma, die Fiat‑Geld mit Stellar verbindet.",
    "desc": "Anchor je tvrtka koja povezuje stvarni novac, poput eura ili dolara, sa Stellar mrežom. Na primjer, date anchoreu eure i zauzvrat dobijete euro token na Stellar mreži."
  },
  "exchange": {
    "title": "Burza dionica",
    "original": "Exchange",
    "short": "Mjesto za kupnju i prodaju tokena.",
    "desc": "Mjenjačnica je mjesto gdje možete kupovati ili prodavati tokene. Mnoge mjenjačnice zahtijevaju KYC proces, što znači provjeru identiteta, prije nego što možete povući novac u eurima ili francima."
  },
  "dex": {
    "title": "DEX",
    "original": "Decentralized Exchange",
    "short": "Decentralizirana razmjena direktno na blockchainu.",
    "desc": "DEX označava decentraliziranu burzu. Ovdje ljudi trguju izravno jedni s drugima na blockchainu. Ne postoji jedan operater. Stellar ima ugrađeni DEX."
  },
  "liquidityPool": {
    "title": "Likvidnostni bazen",
    "original": "Liquidity Pool",
    "short": "Zajednički bazen s dva tokena za trenutno razmjenu.",
    "desc": "Likvidnosni fond je zajednički fond koji sadrži dva tokena. Ljudi u njega ulažu oba tokena. Drugi mogu odmah zamijeniti te tokene. Ulagači zarađuju male naknade za ovu uslugu."
  },
  "balanceClaimable": {
    "title": "Potraživo stanje",
    "original": "Claimable Balance",
    "short": "Rezervirani novac koji još uvijek trebate prihvatiti.",
    "desc": "Potraživani saldo je novac koji je već rezerviran za vas, ali ga još uvijek trebate zatražiti. Tek kada ga prihvatite, sredstva se prenose na vaš račun."
  },
  "protocolUpdate": {
    "title": "Ažuriranje protokola",
    "original": "Protocol Update",
    "short": "Aktualisierung der Netzwerk‑Regeln.",
    "desc": "Ažuriranje protokola je nadogradnja pravila u mreži Stellar, kao što su nove funkcije ili sigurnosne promjene. Svi čvorovi u mreži moraju koristiti ista pravila."
  },
  "soroban": {
    "title": "Soroban",
    "original": "Soroban",
    "short": "Stellars Smart‑Contract‑System.",
    "desc": "Soroban je sustav pametnih ugovora na Stellaru. Pametni ugovor je programski kod na blockchainu. Kod može samostalno provjeravati pravila i pokretati radnje bez posredničke banke."
  },
  "multiSignature": {
    "title": "Višepotpis (Multi-Signature)",
    "original": "Multi-Signature",
    "short": "Multiple signatures required; weights + threshold determine the release.",
    "desc": "U postavci s više potpisa, više ključeva mora potpisati prije nego što neka radnja postane valjana. Svaki potpisnik ima težinu, a zbroj mora doseći potrebni prag. To povećava sigurnost jer jedan ukradeni ključ nije dovoljan."
  },
  "signer": {
    "title": "Potpisnik (Signer)",
    "original": "Signer",
    "short": "Javni ključ s težinom, dio konfiguracije računa.",
    "desc": "Potpisnik je javni ključ koji pripada računu i ima težinu. Njegov potpis se računa prema potrebnom pragu. Više potpisnika može zajednički ovlastiti transakciju."
  },
  "thresholds": {
    "title": "Pragovi (Thresholds)",
    "original": "Thresholds",
    "short": "Ograničenja (low/med/high) koja određuju potrebnu sumu težina.",
    "desc": "Pragovi definiraju koliko je ponderiranih potpisa potrebno za radnje: nizak prag za jednostavne operacije, srednji za plaćanja, visok za kritične promjene. Zbroj težina potpisnika mora odgovarati odgovarajućem pragu."
  },
  "masterWeight": {
    "title": "Master weight (master_weight)",
    "original": "master_weight",
    "short": "Težina glavnog ključa; kontrolira koliku važnost ima glavni ključ.",
    "desc": "Glavna težina je težina glavnog ključa računa. Visoka glavna težina omogućuje glavnom ključu da samostalno potpisuje mnoge radnje; niska vrijednost zahtijeva dodatne potpisnike."
  },
  "accountConfig": {
    "title": "Konfiguracija računa (Account Configuration)",
    "original": "Account Configuration",
    "short": "Međudjelovanje potpisnika i pragova određuje sigurnost računa.",
    "desc": "Konfiguracija računa navodi koji potpisnici postoje s kojim težinama i koji pragovi se primjenjuju. Promjene potpisnika ili pragova su kritične za sigurnost jer određuju koliko je potpisa potrebno."
  },
  "missingKey": "Nedostaje ključ iz glosara: {{detail}}"
}