{
  "title": "Opće objašnjenje korporativnog računa s višestrukim potpisom (Multi-Signature)",
  "intro": "Tvrtka može koristiti zajednički blockchain račun koji uključuje nekoliko ovlaštenih osoba. Obično su uključena najmanje tri potpisnika (Signer), kao što su uprava, financijski službenik i osoba zadužena za usklađenost/sigurnosna pohrana. Cilj je da pojedinci mogu samostalno izvršavati uplate bez da ijedna osoba ima jedinu kontrolu nad računom ili ga preuzme.",
  "problem": "Ako potpisnik (Signer) ima dovoljno težine za izvršavanje uplata i istovremeno dovoljno težine za promjene na računu, ta osoba bi mogla ukloniti druge potpisnike (Signer) ili prilagoditi prag/ponderiranje (Thresholds) te na taj način preuzeti račun. Nasuprot tome, originalni vlasnik također ne bi trebao biti u mogućnosti isključiti druge potpisnike (Signer) bez odgovarajućih provjera i ravnoteža. Struktura s više potpisa osigurava da važne odluke uvijek budu podržane kolektivno od strane više osoba.",
  "setupTitle": "Primjer sigurne multi-sig strukture s tri potpisnika",
  "setupWeights": "U primjeru s trima ekvivalentnim ulogama, svi dobivaju istu jačinu potpisa:\n- Potpisnik (Signer) A (management): težina 2\n- Potpisnik (Signer) B (Finanzen): težina 2\n- Potpisnik (Signer) C (Compliance/Backup): težina 2",
  "setupThresholds": "Odgovarajući pragovi/vage su postavljeni:\n- Nizak (low_threshold): 1\n- Srednji (med_threshold): 2 (for payments and other medium actions)\n- Visok (high_threshold): 4 (za strukturne promjene kao što su dodavanje/uklanjanje potpisnika (Signer) ili promjena praga/vaganja (Thresholds))\nOva postavka omogućava svakom ovlaštenom osobi izvršavanje plaćanja, ali niti jedna osoba ne može sama promijeniti strukturu računa.",
  "behavior": "S ovom konfiguracijom, plaćanja može provoditi bilo koja od tri ovlaštene osobe pojedinačno, jer težina svakog pojedinca zadovoljava srednji prag/ponder (Threshold). Međutim, za strukturne promjene poput uklanjanja potpisnika (Signers), prilagodbe pragova/pondera ili spajanja ili zatvaranja računa, potreban je visoki prag/ponder (high_threshold). Ova vrijednost može biti postignuta samo ako najmanje dva od tri potpisnika (Signer) potpišu zajedno. Na ovaj način, račun ostaje fleksibilan za svakodnevnu upotrebu, a istovremeno dobro zaštićen od zloupotrebe.",
  "removal": "Ako osoba napusti tvrtku ili više nije pouzdana, dvojica preostalih potpisnika (Signer) mogu zajednički ukloniti prava potpisa te osobe. Nijedan pojedinačni potpisnik (Signer) – ni zaposlenik ni uprava – ne može samostalno isključiti druge s računa. Oduzimanje ovlasti uvijek se odvija kontrolirano i transparentno od strane najmanje dvije odgovorne osobe.",
  "summary": "Ova vrsta multi-potpisne strukture omogućava pojedincima da učinkovito obrađuju plaćanja, dok kontrolu nad računom zadržavaju u rukama više strana. Smanjuje rizik od preuzimanja računa, štiti od jednostranih odluka i posebno je prikladna za korporativne račune gdje su sigurnost i operativna fleksibilnost važni.",
  "closeLabel": "Zatvoren",
  "linkLabel": "Što znači Multi-Signature?"
}