{
  "title": "Opće objašnjenje višestrukog potpisivanja (Multi-Signature) korporativnog računa",
  "intro": "Tvrtka može koristiti zajednički blockchain račun koji uključuje više ovlaštenih osoba. Obično su uključena najmanje tri potpisnika (Signer), kao što su menadžment, financijski službenik i službenik za usklađenost/sigurnost. Cilj je omogućiti pojedincima da samostalno izvršavaju plaćanja, bez da jedna osoba može isključivo kontrolirati ili preuzeti račun.",
  "problem": "Ako potpisnik (Signer) ima dovoljno težine za izvršenje uplata i istovremeno dovoljno težine za promjene na računu, ta osoba mogla bi ukloniti druge potpisnike (Signer) ili prilagoditi prag/vrednovanje (Thresholds), te tako preuzeti račun. Suprotno tome, izvorni vlasnik ne bi trebao biti u mogućnosti jednostavno isključiti druge potpisnike (Signer) bez provjera i ravnoteža. Struktura s višestrukim potpisima osigurava da važne odluke uvijek podržava više osoba zajedničkim dogovorom.",
  "setupTitle": "Primjer sigurne multi-signature strukture s tri potpisnika",
  "setupWeights": "U primjeru s tri jednaka uloge, svi primaju istu jačinu potpisa:\n- Potpisnik (Signer) A (management): snaga 2\n- Potpisnik (Signer) B (Finanzen): snaga 2\n- Potpisnik (Signer) C (Compliance/Backup): snaga 2",
  "setupThresholds": "Odgovarajući pragovi/težine postavljeni su kako slijedi:\n- Niska (low_threshold): 1\n- Srednja (med_threshold): 2 (for payments and other medium actions)\n- Visoka (high_threshold): 4 (za strukturne promjene kao što je dodavanje/uklanjanje potpisnika (Signer) ili promjena praga/težine (Thresholds))\nOvo omogućava svakoj ovlaštenoj osobi izvršavanje plaćanja, ali nijedna pojedinačna osoba ne može sama mijenjati strukturu računa.",
  "behavior": "S ovom konfiguracijom, plaćanja mogu pojedinačno provoditi bilo koja od tri ovlaštene osobe, jer pojedinačna težina zadovoljava srednji prag/Threshold. Međutim, strukturne promjene, poput uklanjanja potpisnika/Potpisnika, prilagođavanja pragova/težina ili spajanja ili zatvaranja računa, zahtijevaju visok prag/high_threshold. Ova vrijednost može se postići samo kada najmanje dva od tri potpisnika/Potpisnika potpišu zajedno. Ova postavka omogućava računu da ostane fleksibilan za svakodnevnu upotrebu, dok istovremeno pruža snažnu zaštitu od zloupotrebe.",
  "removal": "Ako osoba napusti tvrtku ili više nije pouzdana, dvoje preostalih potpisnika (Signer) mogu zajednički ukloniti prava potpisa te osobe. Nijedan pojedinačni potpisnik (Signer) – niti zaposlenik niti uprava – ne može samostalno isključiti druge s računa. Oduzimanje ovlasti stoga se uvijek odvija pod kontrolom i na transparentan način od strane barem dviju odgovornih osoba.",
  "summary": "Ova vrsta višepotpisne strukture omogućava pojedincima da učinkovito obrađuju plaćanja dok kontrola nad računom ostaje u rukama više strana. To smanjuje rizik preuzimanja računa, štiti od jednostranih odluka i posebno je pogodna za poslovne račune gdje su važne i sigurnost i operativna fleksibilnost.",
  "closeLabel": "Zatvoren",
  "linkLabel": "Što znači Multi-Signature?"
}