{
  "title": "Općenito objašnjenje višepotpisnog (Multi-Signature) korporativnog računa",
  "intro": "Tvrtka može koristiti zajednički blockchain račun u koji su uključene više ovlaštenih osoba. Obično su uključena najmanje tri potpisnika (Signer), na primjer, uprava, financijski službenik i usklađenost/sigurnosna kopija. Cilj je da pojedinci mogu samostalno izvršavati plaćanja, bez mogućnosti da jedna osoba sama kontrolira ili preuzme račun.",
  "problem": "Ako potpisnik (Signer) ima dovoljno težine za izvršavanje plaćanja i istovremeno posjeduje dovoljno težine za promjene na računu, ta osoba bi mogla ukloniti druge potpisnike (Signer) ili prilagoditi prag/vaganje (Thresholds) te na taj način preuzeti račun. S druge strane, izvorni vlasnik ne bi trebao moći lako isključiti druge potpisnike (Signer) bez provjera i ravnoteže. Struktura s više potpisa osigurava da se važne odluke uvijek donose zajednički od strane više osoba.",
  "setupTitle": "Primjer sigurnosne strukture s više potpisa s tri potpisnika",
  "setupWeights": "U primjeru s tri jednako važna uloge, svi dobivaju istu snagu potpisa:\n- Potpisnik (Signer) A (Management): Težina 2\n- Potpisnik (Signer) B (Finanzen): Težina 2\n- Potpisnik (Signer) C (Compliance/Backup): Težina 2",
  "setupThresholds": "Postavljene su odgovarajuće granice/težine:\n- Niska (low_threshold): 1\n- Srednja (med_threshold): 2 (for payments and other medium actions)\n- Visoka (high_threshold): 4 (za strukturne promjene kao što je dodavanje/uklanjanje potpisnika (Signer) ili mijenjanje granice/težine (Thresholds))\nOvo omogućava svakom ovlaštenom pojedincu da izvrši plaćanja, ali nijedna pojedinačna osoba ne može sama mijenjati strukturu računa.",
  "behavior": "S ovom konfiguracijom, plaćanja može izvršiti bilo koja od tri ovlaštene osobe samostalno, budući da individualna težina uvijek dostigne srednji prag. Za strukturalne promjene poput uklanjanja potpisnika, prilagođavanja pragova/težina, ili spajanja ili zatvaranja računa, potreban je visok prag. Ova vrijednost se može postići samo ako najmanje dva od tri potpisnika potpišu zajedno. Na taj način, račun ostaje fleksibilan u svakodnevnoj upotrebi, dok je dobro zaštićen od zloupotrebe.",
  "removal": "Ako osoba napusti tvrtku ili više nije pouzdana, dva preostala potpisnika (Signer) zajedno mogu ukloniti prava potpisa te osobe. Nijedan pojedinačni potpisnik (Signer) – niti zaposlenik niti uprava – ne može samostalno isključiti druge s računa. Oduzimanje ovlasti stoga se uvijek provodi kontrolirano i transparentno od strane najmanje dvije odgovorne osobe.",
  "summary": "Ovaj tip strukture s više potpisa omogućuje pojedincima da učinkovito provode plaćanja dok kontrolu nad računom zadržavaju s više strana. Smanjuje rizik preuzimanja računa, štiti od jednostranih odluka i posebno je prikladan za korporativne račune gdje su sigurnost i operativna fleksibilnost važni.",
  "closeLabel": "Zatvoren.",
  "linkLabel": "Što znači multi-potpis?"
}