{
  "title": "Create account + multisig",
  "menu": "Create account + Multisig",
  "menuHint": "Create a new account and optionally set up multisig",
  "hint": "Create a new account, activate it, and optionally configure multisig.",
  "generateKeys": "Generate key",
  "enableMultisig": "Enable multisig",
  "signersTitle": "Signatory",
  "signersInfo": "Add additional signatories and set appropriate thresholds.",
  "signersCount": "Number of signatories",
  "bestPractices": {
    "title": "Best Practices",
    "text": "Keep secret keys secure and do not distribute them unnecessarily."
  },
  "instructions": {
    "public": "Share this public key with others for payments.",
    "secret": "Keep this secret key secure; never share it."
  },
  "generateFirst": "Please generate a key pair first.",
  "confirmLowBalance": "Starting balance {bal} XLM is below the recommended reserve {req} XLM (Signers: {count}). Proceed?",
  "activated": "Account has been activated. Hash: {hash}",
  "activatedTestnet": "Account was activated on the testnet via Friendbot.",
  "alreadyActive": "Account is already activated.",
  "createdNoSigners": "Account created, multisig not configured.",
  "createdAndConfigured": "Account created and multisig configured. Hash: {hash}",
  "info": {
    "more": "More information",
    "keysOnPage": {
      "title": "Key on this page",
      "text": "⚠️ IMPORTANT: This website NEVER stores your secret key!\n\nThe secret key displayed here exists only in your browser (lokal im Arbeitsspeicher). Once you reload or leave the page, it is irretrievably lost.\n\nCopy or note down the secret key immediately after generation before closing the page.\n\nVerification: You can use the browser developer tools (F12 → Network) to verify that no secret key is transmitted externally. Only signed transactions are sent, never your secret key."
    },
    "title": "Important information",
    "secureKeys": {
      "title": "Secure secret key",
      "text": "The public key can be safely shared – it is like an account number.\n\nThe secret key grants access to your account. Treat it like a password:\n• NEVER store it in cloud services, emails, or insecure notes\n• Write it down on paper or use a hardware wallet\n• Create multiple backups and store them in secure, separate locations\n• If the secret key is lost, access to the account is permanently lost"
    },
    "multisigSection": {
      "title": "Multisig (Mehrfachsignatur)",
      "text": "With multisig, you can define multiple signatories for your account. Transactions then require signatures from multiple keys (multisig).\n\nAdvantages:\n• Enhanced security (security)\n• Shared accounts (shared accounts)\n• Emergency recovery (emergency recovery)\n\nCAUTION: Test multisig on the testnet first before deploying it on the mainnet! Incorrect configuration can result in losing access to the account."
    },
    "diagram": {
      "title": "Signature expiration"
    }
  },
  "activateHint": "Activation is necessary for the account to exist. In the Testnet, via Friendbot; in the Mainnet, via \"Create Account\" from an existing wallet.",
  "activateNow": "Activate account immediately",
  "activateOnly": "Just activate",
  "balanceWarning": "Initial balance is likely too low to add the {{count}} additional signers (minimum reserve: {{req}} XLM)",
  "createButton": "Create / Set Multisig",
  "mainnetActivateNote": "Note: Additional reserves are required for Multisig. 1 XLM is often not enough.",
  "reserve": {
    "base": "Base reserve per entry: {{val}} XLM",
    "recommended": "Recommended starting balance: {{val}} XLM (inkl. Puffer)",
    "required": "Required Minimum Reserve (neu): {{val}} XLM"
  },
  "signersCountHint": "You set the minimum number of signatures below under \"Required Signatures\" (niedrig/mittel/hoch).",
  "signersCountLimit": "Note: Network Boundary (Stellar): max. 20 additional signatories.",
  "startingBalance": "Starting balance (XLM)",
  "keyWarning": {
    "title": "⚠️ Secure key now!",
    "text1": "You have generated a new key pair.",
    "text2": "Secure BOTH keys IMMEDIATELY before proceeding:",
    "list1": "Public Key: Your account address, can be shared",
    "list2": "Secret Key (Geheimschlüssel): Ihr Passwort – NIEMALS teilen oder online speichern!",
    "list3": "If the secret key is lost, access is irrevocably lost.",
    "confirm": "I have secured both keys."
  },
  "muxedId": "Muxed-ID",
  "muxedInfo": "With the Muxed-ID, an M-Adresse (M...) is created. It points to the same account as the regular address (G...).",
  "muxedIdInvalid": "The Muxed-ID must be an integer between 0 and 18,446,744,073,709,551,615.",
  "muxedAddress": "Muxed address",
  "muxedActivationInfo": "Muxed addresses are alias addresses. They do not need to be activated separately."
}