{
  "pageTitle": "Glossary",
  "pageIntro": "Here you will find important terms from the blockchain world and the Stellar network. Everything is explained in simple words.",
  "searchLabel": "Search term",
  "searchPlaceholder": "Search term (z. B. Konto, Account, Muxed)",
  "searchHint": "The search finds words and explanations.",
  "noResults": "No match.",
  "groups": {
    "accountsKeys": "Accounts & Keys",
    "multisigSecurity": "Multisig & Account Security",
    "walletsCustody": "Wallets & Custody",
    "tokensAssets": "Token & Assets",
    "transactionsFees": "Transactions & Fees",
    "marketsTrading": "Markets & Trading",
    "networkProtocol": "Network & Protocol",
    "smartContracts": "Smart Contracts",
    "blockchainBasics": "Blockchain Basics",
    "security": "Security & Fraud",
    "moneyFinance": "Money & Finance",
    "cryptography": "Cryptography",
    "defi": "DeFi",
    "onrampOfframp": "Onramp / Offramp"
  },
  "blockchain": {
    "title": "Blockchain",
    "original": "Blockchain",
    "short": "Shared digital ledger – many computers store the same entries.",
    "desc": "A blockchain is like a digital ledger. Many computers store the same entries, ensuring that no one can secretly make changes."
  },
  "wallet": {
    "title": "Wallet",
    "original": "Wallet",
    "short": "Digital wallet that manages your keys.",
    "desc": "A wallet is your digital purse. It manages the keys you need to access your account and send transactions. A wallet can be a program, an app, or even just a piece of paper with your private key."
  },
  "account": {
    "title": "Account",
    "original": "Account",
    "short": "A blockchain account can hold assets and send transactions.",
    "desc": "An account is the location on the blockchain where your assets are held. An account has a public address that begins with G. Multiple wallets can access the same account if they have the correct key."
  },
  "addressG": {
    "title": "G address",
    "original": "G Address",
    "short": "The public primary address of a Stellar account (beginnt mit G).",
    "desc": "The G-address is the main address of a Stellar account. It starts with the letter G. You provide it to others so they can send you something."
  },
  "publicKey": {
    "title": "Public key",
    "original": "Public Key",
    "short": "Adresse, die du teilen darfst; bei Stellar meist die G‑Adresse.",
    "desc": "The public key is the address you are allowed to share. In Stellar, this is the G-address. Others use it to send you money."
  },
  "privateKey": {
    "title": "Secret key",
    "original": "Secret Key",
    "short": "Password for the account – never share it.",
    "desc": "The secret key is your password for the account. Whoever has this key can move your money. Never share it."
  },
  "addressFederation": {
    "title": "Federation address",
    "original": "Federation Address",
    "short": "Kurze Adresse wie E‑Mail, zeigt auf eine G‑Adresse.",
    "desc": "A federation address looks like an email. Example: name*domain.com. This short address points to a regular G-address. It's easier to remember."
  },
  "addressMuxed": {
    "title": "Muxed account",
    "original": "Muxed Account",
    "short": "M‑address with additional ID – shares a base account.",
    "desc": "An M-address points to an existing Stellar account but has an additional number (ID).\n\nMuxed Accounts = G-account + ID (M-Adresse)\nThey provide association, but no account separation.\nBalance, trustlines, signers, flags are always on the G-account.\n\nStellar Development Foundation\n\nFor example, multiple individuals or departments can be distinguished under the same G-address. Technically, the money still belongs to the main account."
  },
  "muxedAccountsUseCases": {
    "title": "Use cases for Muxed Accounts",
    "original": "Muxed accounts use cases",
    "short": "Examples, benefits, and limitations of M-addresses as a mapping aid.",
    "desc": "Company - Example\n\nSetup:\n- A company G-account\n- One M-address per customer/use-case (ID)\n\nProcess:\n- Customer pays to their M-address\n- Everything goes to the company G-account\n- Accounting reads the ID -> unique allocation\n\nSuitable for:\n- Shops, payment providers, exchanges\n- Internal references without memo risks\n\nAssociation - Example\n\nSetup:\n- An association G-account\n- M-addresses for members, departments, purposes\n\nProcess:\n- Contribution/donation to the appropriate M-address\n- Allocation via ID, no memo errors\n\nSuitable for:\n- Membership fees\n- Earmarked revenues\n- Easy auditing\n\nWhat Muxed Accounts excel at:\n- Robust input allocation\n- One account, many identities\n- No memo requirement\n- Fewer operational errors\n\nWhat Muxed Accounts are not:\n- Not sub-accounts\n- No individual balance\n- No individual trustlines\n- No individual signers/rights\n\nTypically unsuitable use cases:\n- Salary payments/payroll accounts (benoetigen eigenes G-Konto)\n- Trust/Escrow for third parties (kein rechtlicher Vermoegenstrenner)\n- Role-based security (keine getrennten Signer/Thresholds)\n- Budget or limit separation (keine separaten Salden/Asset-Limits)\n- Compliance-separated accounts (KYC/Reporting nicht sauber trennbar)\n\nComparison (Kurz):\nAssigning payments: Yes\nSeparating assets: No\nDelegating access: No\nLegally separate account: No\nInternal accounting: Yes\n\nKey takeaway:\nMuxed Accounts address payments - they do not replace accounts.\nIf control, ownership, or separation is needed -> own G-account."
  },
  "multisig": {
    "title": "Multisignature",
    "original": "Multi‑Sig",
    "short": "Important actions require more than a signature.",
    "desc": "Multi-Sig stands for multiple signatures. An important action requires more than one key. Example: You and a second key must both agree before something is sent. This makes theft more difficult.",
    "help": {
      "title": "General Explanation of a Multisignature (Multi-Signature) Company Account",
      "intro": "A company can use a shared blockchain account in which several authorized individuals are involved. Typically, at least three signatories (Signer) are included, for example, the management, the financial officer, and compliance/backup. The objective is for individual persons to be able to execute payments independently without allowing a single person to control or take over the account alone.",
      "problem": "If a signer (Signer) has enough weight to execute payments and simultaneously has enough weight for account changes, that person could remove other signers (Signer) or adjust the threshold/weighting (Thresholds) and thus take over the account. Conversely, the original owner should also not be able to easily exclude other signers (Signer) without checks and balances. A multi-signature structure ensures that important decisions are always collectively made by multiple people.",
      "setupTitle": "Example of a secure multi-signature structure with three signers",
      "setupWeights": "In an example with three equal roles, all receive the same signature strength:\n- Signer (Signer) A (Management): Weight 2\n- Signer (Signer) B (Finanzen): Weight 2\n- Signer (Signer) C (Compliance/Backup): Weight 2",
      "setupThresholds": "Appropriate thresholds/weights are set as follows:\n- Low (low_threshold): 1\n- Medium (med_threshold): 2 (for payments and other medium actions)\n- High (high_threshold): 4 (for structural changes such as adding/removing signers (Signer) or changing the threshold/weight (Thresholds))\nThis ensures that each authorized person can execute payments, but no individual person can alter the account structure alone.",
      "behavior": "With this configuration, payments can be made by any of the three eligible individuals alone because each individual's weight meets the medium threshold/Threshold. For structural changes such as removing a signer/Signers, adjusting the thresholds/weights, or merging or closing the account, the high threshold/high_threshold is required. This value can only be achieved when at least two of the three signers/Signer sign together. This setup keeps the account flexible for daily use while providing strong protection against misuse.",
      "removal": "Wenn eine Person das Unternehmen verlässt oder nicht mehr vertrauenswürdig ist, können zwei der verbleibenden Unterzeichner (Signer) gemeinsam die Signaturrechte dieser Person entfernen. Kein einzelner Unterzeichner (Signer) – weder ein Mitarbeiter noch die Geschäftsführung – kann andere eigenständig aus dem Konto ausschließen. Der Entzug von Berechtigungen erfolgt also immer kontrolliert und nachvollziehbar durch mindestens zwei Verantwortliche.",
      "summary": "This type of multi-sig structure allows individual parties to efficiently process payments while maintaining control of the account among multiple participants. It reduces the risk of account takeovers, protects against unilateral decisions, and is particularly suitable for corporate accounts where both security and operational flexibility are important.",
      "closeLabel": "Close",
      "linkLabel": "What does Multi-Signature mean?",
      "glossaryLinkLabel": "View in glossary"
    }
  },
  "multisigCorporate": {
    "title": "Multisignature - Example",
    "original": "Multi-Signature - Example",
    "short": "Example of a multi-signature structure for corporate accounts with roles, weights, and thresholds.",
    "desc": "Example: A company sets up a Stellar account with three signers: CEO (weight 2), CFO (weight 2), and a board member (weight 1). The thresholds are configured so that low-security operations require weight 1, medium operations (e.g. payments) require weight 3, and high operations (e.g. changing signers) require weight 4. This means the CEO alone can view the account, but must cooperate with the CFO or both other signers for payments and configuration changes."
  },
  "trustline": {
    "title": "Trustline",
    "original": "Trustline",
    "short": "Agreement to hold a token from a specific issuer.",
    "desc": "A trustline is like a \"Yes, I accept this token.\" By setting it up, you're indicating that your account is ready to hold a specific token from a specific issuer. Without a trustline, you cannot receive this token.\n\nExample: A trustline is specified as CODE:ISSUER. For EURT from the issuer GDUKMGUGDZQK6Y…, it would be EURT:GDUKMGUGDZQK6Y…"
  },
  "token": {
    "title": "Token",
    "original": "Token",
    "short": "Digital unit – for example, money, points, or credits.",
    "desc": "A token is a digital unit on the blockchain. A token can represent money, points, or credits for a service."
  },
  "asset": {
    "title": "Asset",
    "original": "Asset",
    "short": "Any digital store of value on a blockchain – from cryptocurrencies to tokens to stablecoins.",
    "desc": "An asset is, in the broadest sense, anything that represents value and can be transferred. On Stellar, anyone can issue an asset – e.g. an airline its miles as a token, a bank its dollar as a stablecoin. Every Stellar asset is defined by two things: the asset code (e.g. 'USDC') and the issuer (the G-address of the entity that created it). XLM is the only asset without an issuer, as it is the native asset of the network."
  },
  "xlm": {
    "title": "XLM",
    "original": "XLM",
    "short": "Native currency of Stellar for fees and activation.",
    "desc": "XLM is the native currency of Stellar. You need XLM to pay fees and to start a new account."
  },
  "mainnet": {
    "title": "Mainnet",
    "original": "Mainnet",
    "short": "Echtes Stellar‑Netzwerk mit realem Wert.",
    "desc": "The real Stellar network with actual value. Transactions are final and fees are paid in real XLM."
  },
  "testnet": {
    "title": "Testnet",
    "original": "Testnet",
    "short": "Public training network without real value.",
    "desc": "A public practice network. Tokens have no real value. Ideal for learning and experimenting without risk."
  },
  "memo": {
    "title": "Memo",
    "original": "Memo",
    "short": "Short note in a transaction.",
    "desc": "A memo is a small note that you can send along with a transaction. Often, an exchange requires a specific memo to know to whom the money belongs."
  },
  "transaction": {
    "title": "Transaction",
    "original": "Transaction",
    "short": "Action on the blockchain, e.g., payment or trustline.",
    "desc": "A transaction is an action on the blockchain, such as sending money or establishing a trust line. Once confirmed, a transaction is permanently recorded."
  },
  "fee": {
    "title": "Fee",
    "original": "Fee",
    "short": "Very small amount per transaction.",
    "desc": "The fee is a very small amount that you pay with each transaction. The fee goes to the network. On Stellar, the fees are very low."
  },
  "operations": {
    "title": "Operation",
    "original": "Operation",
    "short": "The smallest unit of a Stellar transaction – a transaction can contain up to 100 operations.",
    "desc": "On Stellar, a transaction is a container that holds one or more operations. An operation is a single action, for example sending a payment, creating a trustline, or placing an offer. Up to 100 operations can be bundled into a single transaction, which is very efficient. The transaction fee is calculated based on the number of operations included (default: 100 stroops per operation)."
  },
  "pathPayment": {
    "title": "Path Payment",
    "original": "Path Payment",
    "short": "A payment where Stellar automatically performs one or more currency conversions to deliver the target asset.",
    "desc": "With path payments you can, for example, send XLM and the recipient automatically receives USDC – Stellar finds the best exchange route through the decentralized market. The network searches available trading pairs and liquidity pools to find the cheapest path. This is especially useful for cross-border payments: the sender pays in their local currency and the recipient receives theirs. All in a single transaction."
  },
  "clawback": {
    "title": "Clawback",
    "original": "Clawback",
    "short": "An optional Stellar feature that lets an asset issuer take back issued tokens from an account.",
    "desc": "Clawback is a special feature on Stellar that supports regulatory requirements. If an issuer enables clawback when creating an asset, they can reclaim tokens from any account – for example in cases of fraud, money laundering, or legal requirements. For regulated financial products like security tokens, this feature is often legally required. Regular users do not need to worry as long as they use trustworthy issuers."
  },
  "sponsor": {
    "title": "Sponsoring",
    "original": "Sponsoring",
    "short": "A Stellar feature where one account covers the base reserve for another account.",
    "desc": "On Stellar, every account and entry (trustline, data entry, etc.) requires a minimum XLM balance (base reserve). Sponsoring lets one account cover this reserve for another. This is especially useful for apps that want to onboard new users without forcing them to buy XLM first. Example: an app sponsors account creation and trustlines for new users so they can start immediately without owning XLM."
  },
  "ledger": {
    "title": "Ledger",
    "original": "Ledger",
    "short": "Chain of confirmed data and balances.",
    "desc": "The ledger is the chain of all confirmed data. It shows which accounts hold how much and what transactions have occurred. Anyone can check the ledger."
  },
  "horizon": {
    "title": "Horizon",
    "original": "Horizon",
    "short": "API‑Dienst, über den Apps mit Stellar sprechen.",
    "desc": "Horizon is the service through which programs communicate with the Stellar blockchain. Our tool queries Horizon to load account balances and transactions."
  },
  "horizonHistory": {
    "title": "Horizon History",
    "original": "Horizon history depth",
    "short": "Describes how far back the transaction history provided by public Horizon servers extends.",
    "desc": "The public Horizon servers (Mainnet und Testnet) operated by the Stellar Development Foundation only provide a limited history – currently approximately one year retroactively. Older data can no longer be retrieved through these free endpoints. If you need to go further back in time, you essentially have two options: (1) you can run your own Horizon node with full history (inklusive History Archives), or (2) you can use third-party or paid services that store and provide long-term historical Stellar data.",
    "seeAlso": "Es wurde kein spezifischer Text zur Übersetzung bereitgestellt. Bitte geben Sie den Text ein, den Sie übersetzt haben möchten."
  },
  "scp": {
    "title": "Stellar Consensus Protocol",
    "original": "SCP – Stellar Consensus Protocol",
    "short": "Stellar’s unique consensus mechanism that confirms transactions quickly without mining.",
    "desc": "SCP is the heart of Stellar—the algorithm that decides how all network participants agree on the ledger state. Unlike Bitcoin (Proof of Work) or Ethereum (Proof of Stake), Stellar uses a federated voting method: each validator trusts a self‑chosen set of other validators (quorum set). This structure lets Stellar reach consensus in about 3–5 seconds without wasting energy on mining. SCP was designed by David Mazières (Stanford) and is formally proven secure."
  },
  "validator": {
    "title": "Validator",
    "original": "Validator",
    "short": "A network node that checks transactions and takes part in consensus.",
    "desc": "Validators are trusted participants that keep the Stellar network running. They receive transactions, verify them, and vote with other validators on which transactions go into the next ledger. Anyone can run a Stellar validator—companies, universities, or individuals. The Stellar Development Foundation runs some validators, but it is not the only authority. A decentralized set of validators makes Stellar resilient to outages and censorship."
  },
  "quorumSet": {
    "title": "Quorum Set",
    "original": "Quorum Set",
    "short": "The set of validators a node trusts and needs for consensus.",
    "desc": "In SCP, each validator chooses which other validators it trusts—this is its quorum set. Consensus happens when these quorum sets overlap and agree. This model is called Federated Byzantine Agreement (FBA). It is more flexible than classic consensus systems: there is no fixed list of trusted nodes, but an organically grown trust network. The quality and decentralization of a quorum set directly affect network security."
  },
  "sac": {
    "title": "Stellar Asset Contract",
    "original": "SAC – Stellar Asset Contract",
    "short": "A Soroban smart contract that makes a classic Stellar asset usable in smart contracts.",
    "desc": "With Soroban (Stellar smart contracts), a problem appeared: existing Stellar assets (like USDC or XLM) also needed to work inside smart contracts. The Stellar Asset Contract solves this—it is a standardized smart‑contract interface for every Stellar asset. This lets Soroban dApps use native Stellar assets directly without converting them into new tokens. SACs exist automatically for all Stellar assets and do not need to be created manually."
  },
  "anchor": {
    "title": "Anchor",
    "original": "Anchor",
    "short": "Firma, die Fiat‑Geld mit Stellar verbindet.",
    "desc": "An anchor is a company that connects real money, such as euros or dollars, with Stellar. For example, you give the anchor euros and receive a euro token on Stellar in return."
  },
  "exchange": {
    "title": "Stock exchange",
    "original": "Exchange",
    "short": "Place to buy and sell tokens.",
    "desc": "An exchange is a place where you can buy or sell tokens. Many exchanges require a KYC process, meaning identity verification, before you can withdraw money in euros or francs."
  },
  "dex": {
    "title": "DEX (Decentralized Exchange)",
    "original": "Decentralized Exchange",
    "short": "Decentralized exchange directly on the blockchain.",
    "desc": "DEX stands for Decentralized Exchange. Here, people trade directly with each other on the blockchain. There is no single operator. Stellar has a DEX built directly into it."
  },
  "liquidityPool": {
    "title": "Liquidity pool",
    "original": "Liquidity Pool",
    "short": "Common pool with two tokens for immediate exchange.",
    "desc": "A liquidity pool is a shared pot containing two tokens. People deposit both tokens into it. Others are then allowed to instantly exchange these tokens. The depositors earn small fees in return."
  },
  "onramp": {
    "title": "Onramp",
    "original": "Onramp",
    "short": "A service that lets you buy cryptocurrencies with fiat money (e.g., euros or Swiss francs).",
    "desc": "An onramp is the entry point into crypto—the path from traditional money to crypto. Common methods include credit card or bank transfer. Providers like Kado or Onramper let you buy directly in an app without visiting a separate exchange. The Stellar Account Manager integrates onramp services so you can buy XLM and other assets with fiat money. Onramps usually require KYC."
  },
  "offramp": {
    "title": "Offramp",
    "original": "Offramp",
    "short": "A service that lets you sell cryptocurrencies back into fiat money.",
    "desc": "The offramp is the opposite of the onramp—the path back to traditional money. You sell your crypto assets and receive euros, francs, or another fiat currency in your bank account. On Stellar, anchors often handle the offramp: they receive tokens like USDC and send the corresponding fiat amount. Offramps usually require KYC."
  },
  "kyc": {
    "title": "Know Your Customer",
    "original": "KYC / AML – Know Your Customer / Anti-Money Laundering",
    "short": "A legally required identity check that financial services demand before you can use them.",
    "desc": "KYC (Know Your Customer) is a regulatory process where users prove their identity with documents and sometimes a selfie. The goal is to prevent money laundering (AML), terrorist financing, and fraud. Decentralized protocols like the Stellar DEX do not require KYC—you trade directly from your wallet. Onramp and offramp services must perform KYC because they bridge fiat and crypto."
  },
  "defi": {
    "title": "Decentralized Finance",
    "original": "DeFi – Decentralized Finance",
    "short": "Financial services like lending, trading, and saving—without banks, directly through blockchain protocols.",
    "desc": "DeFi is an umbrella term for financial applications that work without central institutions like banks or exchanges. Everything runs automatically through smart contracts. Users keep control of their own funds. Typical DeFi applications include decentralized exchanges (DEX), lending protocols, and liquidity pools. Stellar offers basic DeFi functions with its built-in DEX and AMM liquidity pools, expanded by Soroban smart contracts."
  },
  "yield": {
    "title": "Yield",
    "original": "Yield",
    "short": "The return or profit you earn by providing capital in DeFi protocols.",
    "desc": "In DeFi, yield refers to earnings from activities like providing liquidity, staking, or lending. Returns are usually shown as APY (Annual Percentage Yield). High yields often come with high risk. Important: Very high promised yields (e.g., 1000% APY) are often a warning sign of unreliable projects."
  },
  "staking": {
    "title": "Staking",
    "original": "Staking",
    "short": "Locking cryptocurrencies in a network to earn rewards and support the network.",
    "desc": "In staking, coins are locked in a proof-of-stake network to validate transactions and secure the network. Stakers receive new coins as rewards. Stellar does not use classic staking—XLM holders can provide capital to liquidity pools and earn trading fees instead. Important: distinguish real network staking from “staking” offers on centralized exchanges, which are often just savings products."
  },
  "yieldFarming": {
    "title": "Yield Farming",
    "original": "Yield Farming",
    "short": "Actively moving capital between DeFi protocols to get the highest yields.",
    "desc": "Yield farmers move assets between different liquidity pools and protocols to harvest the best returns. It can be attractive, but it is complex and risky: impermanent loss, smart contract bugs, and sudden yield drops can erase gains. Yield farming is an advanced DeFi concept and not recommended for beginners."
  },
  "dao": {
    "title": "Decentralized Autonomous Organization",
    "original": "DAO – Decentralized Autonomous Organization",
    "short": "An organization run by smart contracts and token votes without central leadership.",
    "desc": "A DAO is like a digital organization governed by code and votes of token holders. There is no CEO or board—decisions are made through governance token voting. Any token holder can submit proposals and vote. DAOs are used for protocol development, treasury management, and rule changes. The concept is innovative but also carries risks like low voter participation or coordinated attacks."
  },
  "dapp": {
    "title": "Decentralized Application",
    "original": "dApp – Decentralized Application",
    "short": "An application that runs on a blockchain and has no central control authority.",
    "desc": "A dApp looks like a normal app to users but runs on a blockchain instead of central servers. Its code lives in smart contracts—publicly visible and not controlled by a single party. Examples include decentralized exchanges, lending protocols, or NFT marketplaces. With Soroban, Stellar enables dApps on its network. dApps usually require a wallet connection instead of a classic login."
  },
  "oracle": {
    "title": "Oracle",
    "original": "Oracle",
    "short": "A service that brings real‑world data (e.g., prices or weather) to smart contracts on a blockchain.",
    "desc": "Blockchains are cut off from the outside world by default—a smart contract cannot fetch the current Bitcoin price or the EUR/USD rate on its own. Oracles solve this by providing trusted external data to the blockchain. Well-known oracle services include Chainlink and Pyth Network. Without oracles, many DeFi applications like lending protocols or synthetic assets would not be possible."
  },
  "cex": {
    "title": "Centralized Exchange",
    "original": "CEX – Centralized Exchange",
    "short": "A crypto exchange run by a company that acts as a middleman between buyers and sellers.",
    "desc": "With a CEX like Coinbase, Binance, or Kraken, you do not directly own your coins – the exchange holds them for you. This is convenient but comes with risks: if the exchange is hacked or becomes insolvent, funds can be lost (example: the FTX collapse in 2022). CEXs usually require identity checks (KYC). In contrast, a DEX lets you trade directly from your own wallet without a middleman."
  },
  "orderBook": {
    "title": "Order Book",
    "original": "Order Book",
    "short": "A list of all open buy and sell offers for a trading pair on an exchange.",
    "desc": "The order book shows in real time the prices buyers are willing to pay (bids) and sellers are willing to accept (asks). The difference between the highest bid and the lowest ask is called the spread. Stellar has a built-in decentralized order book (SDEX – Stellar Decentralized Exchange) where anyone can trade assets. There are also liquidity pools as an alternative to the classic order-book model."
  },
  "limitOrder": {
    "title": "Limit Order",
    "original": "Limit Order",
    "short": "A trade order that is executed only at a specific price or better.",
    "desc": "With a limit order you set the maximum price you want to pay or the minimum price you want to sell for. The order is placed into the order book and waits until someone wants to trade at that price. Advantage: you control the price. Disadvantage: it may not execute immediately, or at all. On Stellar this corresponds to an \"offer\" in the decentralized order book."
  },
  "marketOrder": {
    "title": "Market Order",
    "original": "Market Order",
    "short": "A trade order that executes immediately at the best available market price.",
    "desc": "A market order executes immediately at the best available price in the order book. This guarantees execution but not price. With low liquidity, the actual fill price can differ noticeably from what you expected (slippage). Market orders are good for speed; limit orders are better when price matters."
  },
  "offer": {
    "title": "Offer",
    "original": "Offer",
    "short": "An open buy or sell offer in the decentralized Stellar order book.",
    "desc": "On Stellar anyone can place an offer in the decentralized order book: for example, \"I sell 100 XLM for 0.10 USDC each.\" The offer stays open until it is fully filled, manually removed, or replaced by a new version. Offers are the foundation of the SDEX (Stellar Decentralized Exchange) and are also used for path payments. Each open offer increases the account’s minimum balance by one base reserve."
  },
  "slippage": {
    "title": "Slippage",
    "original": "Slippage",
    "short": "The difference between the expected price and the actual execution price of a trade.",
    "desc": "Slippage happens when the market price moves between sending and executing an order, or when a trade is so large that it “eats through” the order book. Example: you want to buy at 1.00 USDC but due to low liquidity the trade executes at 1.05 USDC – that is 5% slippage. With liquidity pools, slippage is especially relevant for large trades. Many DEXs let you set a maximum slippage tolerance."
  },
  "impermanentLoss": {
    "title": "Impermanent Loss",
    "original": "Impermanent Loss",
    "short": "A temporary loss for liquidity providers that happens when the prices of the pooled assets move apart.",
    "desc": "When you provide liquidity to a pool, you can suffer impermanent loss: if the price ratio of the two assets changes, the value when you withdraw is worse than simply holding the assets. The loss is called “impermanent” because it disappears if prices return to the original ratio. Trading fees can offset this loss. This is an important concept for anyone providing liquidity on the Stellar DEX."
  },
  "amm": {
    "title": "Automated Market Maker",
    "original": "AMM – Automated Market Maker",
    "short": "A smart-contract-based system that enables trading without a classic order book using mathematical pricing formulas.",
    "desc": "An AMM replaces the classic order book with an algorithm. Instead of waiting for a buyer or seller, you trade directly with a liquidity pool. The price is calculated automatically by a formula (usually x × y = k). The more of one asset is bought, the more expensive it becomes. Stellar introduced AMM-based liquidity pools that exist alongside the classic SDEX order book."
  },
  "bullBearMarket": {
    "title": "Bull & Bear Market",
    "original": "Bull & Bear Market",
    "short": "Bull market = rising prices and optimism. Bear market = falling prices and pessimism.",
    "desc": "In a bull market prices rise for a longer time, investors are optimistic and buy. In a bear market prices fall (often more than 20% from the peak) and sentiment is negative. The symbols: the bull pushes upward with its horns (rising prices), the bear strikes downward with its paw (falling prices). Crypto markets regularly switch between these phases—often stronger and faster than traditional markets."
  },
  "hodl": {
    "title": "HODL",
    "original": "HODL",
    "short": "Crypto slang for holding cryptocurrencies long-term regardless of price swings.",
    "desc": "HODL began in 2013 from a typo of “hold” on a Bitcoin forum and became a crypto mantra. The strategy: buy and hold long-term instead of short-term trading. Many long-term investors swear by it because short-term trading often performs worse than simple holding. Sometimes HODL is jokingly interpreted as “Hold On for Dear Life”—especially in volatile markets."
  },
  "dca": {
    "title": "Dollar Cost Averaging",
    "original": "DCA – Dollar Cost Averaging",
    "short": "An investment strategy where a fixed amount is invested regularly, no matter the current price.",
    "desc": "Instead of investing one large amount, you invest a fixed amount regularly (e.g., $50 each month) into XLM or Bitcoin. When prices are low you buy more; when prices are high you buy less—this smooths the average price over time. DCA reduces the risk of entering at the wrong time and is especially suitable for beginners and volatile markets like crypto."
  },
  "portfolio": {
    "title": "Portfolio",
    "original": "Portfolio",
    "short": "The total collection of a user’s held crypto assets and investments.",
    "desc": "A portfolio is an overview of all assets you hold—what coins and tokens you own, in what amounts, and their current value. A good portfolio strategy includes diversification: don’t put everything into one asset. In the Stellar Account Manager you can view your portfolio directly—all assets across your Stellar accounts at a glance."
  },
  "tvl": {
    "title": "Total Value Locked",
    "original": "TVL – Total Value Locked",
    "short": "The total value of all assets locked in a DeFi protocol or liquidity pool.",
    "desc": "TVL is an important metric in DeFi. It shows how much capital is locked in a protocol, a dApp, or a liquidity pool. A high TVL suggests strong trust and active usage. On Stellar, TVL measures the value of all assets in liquidity pools. Platforms like DeFiLlama track TVL across many blockchains and protocols."
  },
  "balanceClaimable": {
    "title": "Claimable Balance",
    "original": "Claimable Balance",
    "short": "Reserved money that you still need to receive.",
    "desc": "A claimable balance is money that is already reserved for you, but you still need to claim it. It only gets credited to your account once you accept it."
  },
  "protocolUpdate": {
    "title": "Protocol Update",
    "original": "Protocol Update",
    "short": "Aktualisierung der Netzwerk‑Regeln.",
    "desc": "A Protocol Update is an upgrade of the rules in the Stellar network, such as new features or security changes. All nodes in the network must use the same rules."
  },
  "soroban": {
    "title": "Soroban",
    "original": "Soroban",
    "short": "Stellars Smart‑Contract‑System.",
    "desc": "Soroban is the smart contract system of Stellar. A smart contract is program code on the blockchain. The code can independently verify rules and trigger actions without the need for a bank intermediary."
  },
  "multiSignature": {
    "title": "Multisignature",
    "original": "Multi-Signature",
    "short": "Multiple signatures required; weights + threshold determine the release.",
    "desc": "In a multi-signature setup, multiple keys must sign before an action becomes valid. Each signer has a weight, and the sum must meet the required threshold. This increases security because a single stolen key is not sufficient."
  },
  "signer": {
    "title": "Signatory",
    "original": "Signer",
    "short": "Public key with weight, part of the account configuration.",
    "desc": "A signer is a public key that belongs to an account and has a weight. Its signature counts towards the required threshold. Multiple signers can collectively authorize a transaction.\n\nSigner types:\n- ed25519 (standard key)\n- hashX (Hash-Vorlage)\n- preAuthTx (vorab autorisierte Transaktion)\n\nSKM supports only ed25519. For additional options, visit https://lab.stellar.org."
  },
  "thresholds": {
    "title": "Thresholds",
    "original": "Thresholds",
    "short": "Limits (low/med/high) that set the required total weight.",
    "desc": "Thresholds define how many weighted signatures are required for actions: low for simple operations, med for payments, and high for critical changes. The sum of the signer weights must meet the respective threshold."
  },
  "masterWeight": {
    "title": "Master weight",
    "original": "master_weight",
    "short": "Weight of the master key; controls how much importance the master key holds.",
    "desc": "The master weight is the weight of the main key of an account. A high master weight allows the master key to sign many actions on its own; a low value requires additional signers."
  },
  "accountConfig": {
    "title": "Account configuration",
    "original": "Account Configuration",
    "short": "The interplay between signers and thresholds determines the security of the account.",
    "desc": "The account configuration defines which signers exist with which weights and what thresholds apply. Changes to signers or thresholds are security-critical because they determine how many signatures are required."
  },
  "distributedNetwork": {
    "title": "Distributed network",
    "original": "Distributed Network",
    "short": "Many computers work together instead of one making all the decisions.",
    "desc": "Imagine a market where many traders know the same rules. If one participant drops out, it continues to run because others can take over. This keeps the system stable and more difficult to manipulate."
  },
  "node": {
    "title": "Node",
    "original": "Node",
    "short": "A single participant in the network.",
    "desc": "A node is like a ledger-keeper that holds a copy of the data. It verifies new entries and passes them on. Many nodes together make the network reliable."
  },
  "block": {
    "title": "Block",
    "original": "Block",
    "short": "A block is a bundle of entries.",
    "desc": "Like a page in a cash book, a block collects several transactions. Once it is full, it is completed and added to the chain. This creates the history step by step."
  },
  "consensusMechanism": {
    "title": "Consensus mechanism",
    "original": "Consensus Mechanism",
    "short": "Rules by which everyone agrees on valid entries.",
    "desc": "It's like when a group decides which receipt is valid. This prevents anyone from secretly making changes. Different blockchains use different methods, but the goal is always consensus."
  },
  "finality": {
    "title": "Finality / Definitiveness",
    "original": "Finality",
    "short": "The certainty that a transaction is final.",
    "desc": "When something is final, it feels like a confirmed bank statement. You no longer have to expect it to be reversed. This creates trust."
  },
  "immutability": {
    "title": "Immutability",
    "original": "Immutability",
    "short": "Entries should not be altered retrospectively.",
    "desc": "Similar to a ledger: Any after-the-fact erasures are noticeable. Changes are added as a new entry, not overwritten. This makes the history traceable."
  },
  "decentralization": {
    "title": "Decentralization",
    "original": "Decentralization",
    "short": "No central authority controls everything.",
    "desc": "Instead of a single vault, there are many vaults with the same information. Decisions emerge from the interaction of many participants. This makes the system more robust."
  },
  "publicBlockchain": {
    "title": "Public blockchain",
    "original": "Public Blockchain",
    "short": "Open to anyone who wishes to participate.",
    "desc": "Everyone can participate and view the data, similar to a public notice board. This increases transparency, but every action is visible to everyone. Rules ensure that nobody can cheat."
  },
  "privateBlockchain": {
    "title": "Private blockchain",
    "original": "Private Blockchain",
    "short": "Access for selected participants only.",
    "desc": "Like a company cash book that only employees are allowed to see. It can be faster and more controlled, but it is less open. Trust is established here through the organization."
  },
  "permissionlessBlockchain": {
    "title": "Permissionless blockchain",
    "original": "Permissionless Blockchain",
    "short": "Everyone is allowed to participate without permission.",
    "desc": "Like a market that anyone can join. This lowers barriers but may require more rules to stay fair. Examples include many public blockchains."
  },
  "permissionedBlockchain": {
    "title": "Permissioned blockchain",
    "original": "Permissioned Blockchain",
    "short": "Participation by permission only.",
    "desc": "Like a club with a membership list. This can create clear responsibilities. However, it is less open."
  },
  "seedPhrase": {
    "title": "Restoration theorem",
    "original": "Seed Phrase / Recovery Phrase",
    "short": "A word list with which you can restore your wallet.",
    "desc": "She is like the backup key to your safe. Whoever has it can restore your wallet. Therefore, it should never be stored online."
  },
  "selfCustody": {
    "title": "Self-custody",
    "original": "Self-Custody",
    "short": "You are keeping your keys yourself.",
    "desc": "Like cash in your own safe: you have control, but also the responsibility. If you lose access, no one can help. For beginners, caution is especially important."
  },
  "custodian": {
    "title": "Custodian",
    "original": "Custodian",
    "short": "A service provider keeps your keys for you.",
    "desc": "Like a bank that manages your account. It can be convenient but takes away full control from you. You have to trust it."
  },
  "hardwareWallet": {
    "title": "Hardware wallet",
    "original": "Hardware Wallet",
    "short": "A physical device for your keys.",
    "desc": "Like a small safe in your pocket. The keys remain on the device and do not go online. This protects against many online attacks."
  },
  "hotWallet": {
    "title": "Hot wallet",
    "original": "Hot Wallet",
    "short": "A wallet with internet access.",
    "desc": "Like a wallet in a jacket: convenient but more vulnerable. Good for small amounts and everyday use. Not ideal for large sums."
  },
  "coldWallet": {
    "title": "Cold wallet",
    "original": "Cold Wallet",
    "short": "A wallet without an internet connection.",
    "desc": "Like a safe in the basement. Very secure, but impractical for everyday use. Suitable for long-term storage."
  },
  "cryptocurrency": {
    "title": "Cryptocurrency",
    "original": "Cryptocurrency",
    "short": "Digital currency that is sent directly between people.",
    "desc": "Like digital cash, but without a bank. You can send it directly to others. The value can fluctuate."
  },
  "altcoin": {
    "title": "Altcoin",
    "original": "Altcoin",
    "short": "All cryptocurrencies except Bitcoin.",
    "desc": "Like other brands on the market besides the dominant player. Some are well-known, many are small. Quality and risk vary greatly."
  },
  "stablecoin": {
    "title": "Stablecoin",
    "original": "Stablecoin",
    "short": "Cryptocurrency with a potentially stable value.",
    "desc": "Like digital money that is pegged to a standard currency. This makes its price more stable. However, trust in the provider is still important."
  },
  "utilityToken": {
    "title": "Usage token",
    "original": "Utility Token",
    "short": "A token that can be used to access a service.",
    "desc": "Like a voucher at a market stall. It provides access or a discount. Its value depends on the usefulness of the service."
  },
  "securityToken": {
    "title": "Security tokens",
    "original": "Security Token",
    "short": "A token with security characteristics.",
    "desc": "Like a stock certificate. It can promise rights or profits. Stricter rules often apply for this."
  },
  "governanceToken": {
    "title": "Governance token",
    "original": "Governance Token",
    "short": "A token to have a say in rules.",
    "desc": "Like a voting card in a club. Those who have tokens can vote on rules. That means responsibility."
  },
  "liquidityToken": {
    "title": "Liquidity tokens / LP tokens",
    "original": "Liquidity Token",
    "short": "A token for provided liquidity.",
    "desc": "Like a receipt showing that you have contributed money to a shared pool. You receive proportional fees. The value can fluctuate."
  },
  "nft": {
    "title": "Non-fungible token / NFT",
    "original": "Non-Fungible Token",
    "short": "A unique digital token.",
    "desc": "Like a signed collectible item. It represents something unique, not an interchangeable coin. The value depends on demand."
  },
  "cbdc": {
    "title": "Central Bank Digital Currency / CBDC",
    "original": "Central Bank Digital Currency",
    "short": "Digital money issued by a central bank.",
    "desc": "Like digital cash from the state. It would be official money, just in digital form. Details depend on the specific country."
  },
  "transactionStatus": {
    "title": "Transaction status",
    "original": "Transaction Status",
    "short": "Indicates whether a transaction is still open or already completed.",
    "desc": "Like package tracking: pending, confirmed, or failed. This way, you can see if everything worked out. Sometimes it takes a little while."
  },
  "gasFee": {
    "title": "Gas fee",
    "original": "Gas Fee",
    "short": "A fee for computational work in the network.",
    "desc": "Like a processing fee at a market stall. The busier it is, the more expensive it can become. Not every blockchain calls it gas."
  },
  "onChain": {
    "title": "On-chain",
    "original": "On-Chain",
    "short": "Occurs directly on the blockchain.",
    "desc": "Like an entry directly into the ledger. Anyone can see it. It's transparent, but often slower or more expensive."
  },
  "offChain": {
    "title": "Off-chain",
    "original": "Off-Chain",
    "short": "Occurs outside the blockchain.",
    "desc": "Like a verbal agreement that is later recorded in the ledger. This can be faster and more cost-effective. Trust plays a larger role here."
  },
  "liquidity": {
    "title": "Liquidity",
    "original": "Liquidity",
    "short": "Shows how easily something can be handled.",
    "desc": "The number of buyers and sellers there are. High liquidity means you can trade quickly without significantly affecting the price. Low liquidity feels sluggish."
  },
  "volatility": {
    "title": "Volatility",
    "original": "Volatility",
    "short": "How much prices fluctuate.",
    "desc": "Like a market with wild price swings. High volatility means opportunities, but also risk. For beginners, this can be stressful."
  },
  "marketCap": {
    "title": "Market capitalization",
    "original": "Market Capitalization",
    "short": "The total value of a coin or project.",
    "desc": "Like the total value of all goods in a market. It is roughly derived from price multiplied by circulating quantity. Large values appear more stable, but they are not automatically so."
  },
  "circulatingSupply": {
    "title": "Circulation quantity",
    "original": "Circulating Supply",
    "short": "The amount of coins that is actually in circulation.",
    "desc": "Like the number of coins that are actually on the market. Not everything that exists is already in circulation. That influences the price."
  },
  "priceDiscovery": {
    "title": "Pricing",
    "original": "Price Discovery",
    "short": "This is how the price is determined by supply and demand.",
    "desc": "It's like a market: supply and demand meet. Many small decisions determine the price. There is no fixed switch."
  },
  "spread": {
    "title": "Trading range",
    "original": "Spread",
    "short": "The difference between the purchase price and the selling price.",
    "desc": "Like the bid-ask spread in a store. The smaller the gap, the fairer it feels. Large spreads make trades more expensive."
  },
  "phishing": {
    "title": "Phishing",
    "original": "Phishing",
    "short": "Fraud through fake news or websites.",
    "desc": "Like a fake bank email that lures you into a trap. The goal is for you to give away your login credentials. Never click on links blindly."
  },
  "scam": {
    "title": "Scam",
    "original": "Scam",
    "short": "A fraudulent scheme in crypto that aims to steal users’ assets.",
    "desc": "Scams are sadly common in crypto because transactions are irreversible and there is no central authority to help. Typical scams: fake giveaways (\"Send 1 XLM, get 2 back\"), fake wallet apps, fraudulent investment platforms, or fake support staff. Rule of thumb: nobody gives away crypto. If it sounds too good to be true, it usually is. Never share private keys or seed phrases—with anyone, ever."
  },
  "rugPull": {
    "title": "Rug Pull",
    "original": "Rug Pull",
    "short": "A scam where developers suddenly remove all liquidity and disappear with investors’ money.",
    "desc": "A rug pull is one of the most common scams in DeFi and token projects. Pattern: a project launches a new token, builds hype, attracts investors—and then suddenly pulls all liquidity from the pool. The token price collapses to zero and the developers vanish. Red flags: anonymous team, no smart‑contract audit, unrealistically high return promises, very short project history. Only invest in projects with transparent teams and audited code."
  },
  "ponzi": {
    "title": "Ponzi Scheme",
    "original": "Ponzi Scheme",
    "short": "A fraudulent scheme where returns to old investors are paid from new investors’ money.",
    "desc": "A Ponzi scheme promises high returns but doesn’t pay them from real profits—it pays them from new investors’ capital. It appears to work as long as new money keeps coming, then collapses when it doesn’t. Crypto has seen many Ponzis, some worth billions. Red flags: guaranteed high returns, pressure to join quickly, opaque business models, and a focus on recruiting new members."
  },
  "twoFactorAuth": {
    "title": "Two-Factor Authentication",
    "original": "2FA – Two-Factor Authentication",
    "short": "An extra security layer that requires a second step besides your password.",
    "desc": "2FA protects accounts much better than a password alone. After entering your password, a second factor is required—e.g., a time‑based code from an authenticator app (Google Authenticator, Authy) or an SMS. Important: SMS‑based 2FA is less secure than app‑based due to SIM‑swapping attacks. Enable 2FA for all crypto exchange accounts. Note: self‑custody wallets have no 2FA—the private key is the only protection."
  },
  "socialEngineering": {
    "title": "Social Engineering",
    "original": "Social Engineering",
    "short": "Manipulating people with psychological tricks to get confidential info or account access.",
    "desc": "Social engineering is often more dangerous than technical attacks because it exploits people. Common tactics: pretending to be support and asking for a private key; creating fake urgency (\"Your account will be locked!\"); building trust with fake identities. In crypto, no legitimate support and no Stellar or wallet staff will ever ask for your private key or seed phrase. Never."
  },
  "smartContract": {
    "title": "Smart contract",
    "original": "Smart Contract",
    "short": "A program that automatically executes fixed rules.",
    "desc": "Like a machine that responds according to fixed rules. It executes agreements automatically. This saves trust but requires clear rules."
  },
  "programmableLogic": {
    "title": "Automated rules",
    "original": "Programmable Logic",
    "short": "Rules that automatically execute when something happens.",
    "desc": "Like an if-then rule in an automaton. This allows processes to be controlled without manual intervention every time. This is how simple digital contracts are created."
  },
  "networkCongestion": {
    "title": "Network utilization",
    "original": "Network Congestion",
    "short": "If there are a large number of transactions pending simultaneously.",
    "desc": "Like a traffic jam on the highway. Transactions take longer and fees can increase. With less traffic, it becomes faster again."
  },
  "blockchainTypes": {
    "title": "Types of Blockchain",
    "original": "Blockchain Types",
    "short": "There are various types of blockchains with different goals.",
    "desc": "Like different vehicle types for different routes. Some are built for payments, others for programs. It's worth knowing the purpose."
  },
  "paymentBlockchain": {
    "title": "Payment blockchain",
    "original": "Payment Blockchain",
    "short": "A blockchain designed for fast payments.",
    "desc": "Like a quick ledger for money. The focus is on inexpensive and fast transfers. Features are often intentionally kept simple."
  },
  "smartContractBlockchain": {
    "title": "Smart contract blockchain",
    "original": "Smart Contract Blockchain",
    "short": "A blockchain capable of running programs and apps.",
    "desc": "Like a market with many vending machines. In addition to payments, rules and apps can run there. This makes them versatile, but often more complex."
  },
  "blockchainComparison": {
    "title": "Blockchain comparison",
    "original": "Blockchain Comparison",
    "short": "A comparison reveals the strengths and weaknesses of different blockchains.",
    "desc": "Like the comparison of banks or markets: Each has strengths and weaknesses. Important factors are cost, speed, and security. There is no perfect system for everything."
  },
  "stellarVsBitcoinVsEthereum": {
    "title": "Stellar vs. Bitcoin vs. Ethereum",
    "original": "Stellar vs. Bitcoin vs. Ethereum",
    "short": "Three well-known blockchains with different focuses.",
    "desc": "Bitcoin is like digital gold and is often seen as a store of value. Ethereum is like a platform for programs and apps. Stellar is focused on affordable payments."
  },
  "mining": {
    "title": "Mining",
    "original": "Mining",
    "short": "The process where computers solve hard math to create new blocks and confirm transactions.",
    "desc": "Mining is the core of Proof‑of‑Work blockchains like Bitcoin. Miners compete to solve a complex math puzzle first. The winner adds the next block and earns new coins as a reward. Mining uses huge amounts of electricity and specialized hardware. Stellar does not need mining—the SCP consensus is energy‑efficient and confirms transactions in seconds."
  },
  "proofOfWork": {
    "title": "Proof of Work",
    "original": "Proof of Work",
    "short": "A consensus method that uses computing power to validate transactions and create new blocks.",
    "desc": "Proof of Work (PoW) is the original blockchain consensus used by Bitcoin. Miners must spend massive computing power to create a valid block, making attacks extremely expensive. The downside: PoW uses a lot of energy and is slow (Bitcoin about 7 transactions per second). Stellar and many newer blockchains chose more efficient alternatives."
  },
  "proofOfStake": {
    "title": "Proof of Stake",
    "original": "Proof of Stake",
    "short": "A consensus method where validators lock coins as security instead of using computing power.",
    "desc": "In Proof of Stake (PoS), validators are chosen to create blocks based on the amount they stake. Ethereum switched from PoW to PoS in 2022 and reduced energy use by over 99%. PoS is more efficient than PoW, but has other risks like power concentration among large holders. Stellar uses neither PoW nor PoS, but its own Stellar Consensus Protocol (SCP)."
  },
  "fork": {
    "title": "Fork",
    "original": "Fork",
    "short": "A change to the blockchain protocol that is either backward‑compatible (soft fork) or incompatible (hard fork).",
    "desc": "A soft fork is backward‑compatible—old nodes can still participate. A hard fork is a major change that can split the network: nodes that don’t upgrade follow the old chain. Famous hard forks include Bitcoin Cash (split from Bitcoin in 2017) and Ethereum Classic (split from Ethereum in 2016). Stellar uses validator voting for protocol upgrades—an orderly process without uncontrolled splits."
  },
  "layer1Layer2": {
    "title": "Layer 1 / Layer 2",
    "original": "Layer 1 / Layer 2",
    "short": "Layer 1 is the base blockchain; Layer 2 are add‑on solutions for scaling and extensions.",
    "desc": "Layer 1 (L1) is the main blockchain itself—e.g., Bitcoin, Ethereum, or Stellar. Layer 2 (L2) are protocols built on top of L1 to improve speed and costs. Famous L2s include the Lightning Network (on Bitcoin) or Polygon (on Ethereum). Stellar is itself an L1 and is already fast and cheap thanks to SCP, so it needs fewer L2 solutions than Ethereum."
  },
  "bridge": {
    "title": "Bridge",
    "original": "Bridge",
    "short": "A protocol that moves assets between two different blockchains.",
    "desc": "Because blockchains are normally isolated, bridges enable transferring assets between them. Example: a bridge between Ethereum and Stellar lets you move USDC from Ethereum to Stellar. Technically, assets are usually locked on the source chain and issued as wrapped tokens on the target chain. Bridges are useful but often attacked—some of the largest crypto hacks were bridge exploits. On Stellar, anchors often provide a similar bridging role."
  },
  "interoperability": {
    "title": "Interoperability",
    "original": "Interoperability",
    "short": "The ability of different blockchains to communicate and exchange assets.",
    "desc": "Interoperability is a major challenge in crypto. Today there are hundreds of blockchains that often cannot talk to each other—like islands with no bridges. Solutions include bridges, cross‑chain protocols, or standards like IBC (Inter‑Blockchain Communication). Stellar has interoperability as a core goal: its anchor system connects to traditional finance, and bridges connect Stellar to other blockchains."
  },
  "whitepaper": {
    "title": "Whitepaper",
    "original": "Whitepaper",
    "short": "A technical document that explains a crypto project’s concept, technology, and goals.",
    "desc": "A whitepaper is the founding document of a crypto project. Bitcoin was introduced by Satoshi Nakamoto’s 2008 whitepaper. A good whitepaper explains the problem, the solution, the technology, and the tokenomics. Before investing, you should read a project’s whitepaper. If it’s missing or vague, that’s often a warning sign. The Stellar whitepaper describes SCP and is publicly available."
  },
  "ico": {
    "title": "ICO / Token Sale",
    "original": "ICO – Initial Coin Offering",
    "short": "A funding method where new tokens are sold publicly—similar to an IPO.",
    "desc": "An ICO (Initial Coin Offering) is like an IPO for crypto projects. The project sells new tokens to early investors to raise capital. ICOs were very popular in 2017–2018, but often unregulated or fraudulent. Many ICO projects never shipped a working product. Regulations are stricter today. Alternatives include IEOs (Initial Exchange Offerings) or IDOs (Initial DEX Offerings). Beginners should be very cautious with ICOs."
  },
  "airdrop": {
    "title": "Airdrop",
    "original": "Airdrop",
    "short": "The free distribution of tokens to wallet addresses, usually for marketing or community reasons.",
    "desc": "In an airdrop, users receive free tokens—often as a reward for early support, community activity, or just holding a specific wallet. Airdrops are a popular way to promote new projects. Important: legitimate airdrops never ask for private keys or upfront payments. Many airdrops are scams—never enter your private key to claim one. On Stellar, airdrops can be implemented cleanly via claimable balances."
  },
  "money": {
    "title": "Money",
    "original": "Money",
    "short": "Money is a universally accepted medium of exchange for goods and services.",
    "desc": "Money serves three functions: it is a medium of exchange, a store of value, and a unit of account. Historically, money has taken many forms – from shells to gold to today's banknotes and digital money. Modern money is mostly backed by trust in the issuing government, not by physical assets."
  },
  "fiatCurrency": {
    "title": "Fiat Currency",
    "original": "Fiat Currency",
    "short": "Government-issued currency not backed by a physical commodity like gold.",
    "desc": "Fiat currencies like the euro, dollar, or franc have no intrinsic value – their worth is based on trust in the issuing government and its economy. Central banks can print fiat currencies in unlimited quantities, which can lead to inflation. In contrast, the supply of many cryptocurrencies is strictly limited."
  },
  "centralBank": {
    "title": "Central Bank",
    "original": "Central Bank",
    "short": "A government institution that controls the monetary policy of a country or currency zone.",
    "desc": "Central banks like the European Central Bank (ECB) or the US Federal Reserve (Fed) control the money supply, set interest rates, and ensure the stability of the financial system. They can print money and hold a monopoly on issuing cash. Cryptocurrencies were developed as an alternative to centralized monetary systems – without a central bank, without a single controlling authority."
  },
  "inflation": {
    "title": "Inflation",
    "original": "Inflation",
    "short": "A general rise in price levels that reduces the purchasing power of money.",
    "desc": "With inflation, money loses value over time – you get less for the same amount. Causes include too much money in circulation, rising demand, or supply shortages. Many people see Bitcoin and other cryptocurrencies with limited supply as a hedge against inflation, similar to gold. XLM, on the other hand, has a moderate annual inflation rate set by the network."
  },
  "currency": {
    "title": "Currency",
    "original": "Currency",
    "short": "A recognized value exchange system within a specific economic area.",
    "desc": "A currency is the official means of payment in a country or region (e.g. EUR, USD, CHF). In the crypto space, the term is often used interchangeably with 'coin' or 'cryptocurrency'. The difference from an 'asset': a currency primarily serves as a medium of exchange, while an asset is a broader term for any store of value – including stocks, real estate, or tokens."
  },
  "cryptography": {
    "title": "Cryptography",
    "original": "Cryptography",
    "short": "The science of secure communication through mathematical encryption methods.",
    "desc": "Cryptography is the foundation of all blockchain technologies. It ensures that data can only be read by authorized persons and that transactions cannot be forged. Without cryptography, Bitcoin, Stellar, or any other cryptocurrency would not be possible. The term comes from the Greek 'kryptos' (hidden) and 'graphein' (to write)."
  },
  "hash": {
    "title": "Hash",
    "original": "Hash",
    "short": "A unique digital fingerprint computed from any data.",
    "desc": "A hash function converts any data (text, files, transactions) into a fixed string of characters – e.g. 'a3f8c2...'. The same input data always produces the same hash. If even a single character is changed, the hash changes completely. This makes hashes ideal for detecting tampering. In blockchains, each block is uniquely identified by its hash."
  },
  "encryption": {
    "title": "Encryption",
    "original": "Encryption",
    "short": "Converting readable data into an unreadable format that can only be decrypted with the correct key.",
    "desc": "Encryption protects data from unauthorized access. There are two main types: symmetric encryption (one key for both encrypting and decrypting) and asymmetric encryption (public key to encrypt, private key to decrypt). Wallets and blockchain transactions use asymmetric encryption."
  },
  "digitalSignature": {
    "title": "Digital Signature",
    "original": "Digital Signature",
    "short": "Cryptographic proof that a message or transaction was authorized by its rightful owner.",
    "desc": "A digital signature works similarly to a handwritten signature – only it is forgery-proof. On Stellar, you sign every transaction with your private key. The network can verify with your public key whether the signature is valid – without ever seeing your private key. Without a valid signature, a transaction is rejected by the network."
  },
  "publicKeyCryptography": {
    "title": "Public-Key Cryptography",
    "original": "Public-Key Cryptography",
    "short": "An encryption method using two linked keys: one public and one private.",
    "desc": "The principle: what is encrypted with the public key can only be decrypted with the private key – and vice versa. You can freely share your public key (= your wallet address). Your private key stays secret. Anyone who knows your private key has full access to your account. Therefore: never share your private key!"
  },
  "keyPair": {
    "title": "Key Pair",
    "original": "Key Pair",
    "short": "The combination of a public and private key that together form a crypto account.",
    "desc": "A key pair consists of the public key (your address that others may see) and the private key (your password that stays secret). On Stellar, the public key is represented as a G-address, while the private key starts with S. The key pair is generated mathematically and is practically impossible to forge or guess."
  },
  "signing": {
    "title": "Signing",
    "original": "Signing",
    "short": "Authorizing a transaction with the account holder's private key.",
    "desc": "Before a transaction is executed on the Stellar network, it must be signed. The private key is used to create a digital signature that proves the rightful account holder has approved the transaction. Without a valid signature, the transaction is rejected by the network. For multisig accounts, multiple signatures are required."
  },
  "sequenceNumber": {
    "title": "Sequence Number",
    "original": "Sequence Number",
    "short": "A sequential number that uniquely identifies each transaction of an account and prevents double spending.",
    "desc": "Every Stellar account has a sequence number that increases by 1 with each transaction. A transaction is only accepted if its sequence number matches exactly the current account sequence +1. This prevents the same transaction from being executed twice. If you send multiple transactions at the same time, they must be processed in the correct order."
  },
  "baseReserve": {
    "title": "Base Reserve",
    "original": "Base Reserve",
    "short": "The minimum amount of XLM that must remain in a Stellar account and cannot be spent.",
    "desc": "On Stellar, every account must hold a minimum balance in XLM. This is calculated from the base reserve (currently 0.5 XLM) multiplied by the number of 'entries' on the account (e.g. trustlines, signers, data offers). An empty account requires at least 1 XLM (2 × 0.5 XLM). Each trustline increases the minimum balance by an additional 0.5 XLM. This balance is locked as long as the entries are active."
  },
  "coin": {
    "title": "Coin",
    "original": "Coin",
    "short": "The native cryptocurrency of a blockchain that exists directly on that blockchain.",
    "desc": "A coin is the 'own' currency of a blockchain. Bitcoin (BTC) is the coin of the Bitcoin blockchain, Ether (ETH) the coin of Ethereum, XLM the coin of Stellar. Coins are created directly by the network protocol and are mostly used to pay transaction fees. In contrast, tokens are issued by third parties on an existing blockchain."
  },
  "coinVsToken": {
    "title": "Coin vs. Token",
    "original": "Coin vs. Token",
    "short": "Coins are native currencies of a blockchain, tokens are issued by third parties on an existing blockchain.",
    "desc": "The main difference: a coin exists on its own blockchain (BTC on Bitcoin, XLM on Stellar). A token is created by someone on an already existing blockchain – e.g. a company issuing its own stablecoin on Stellar. Tokens do not need their own blockchain. On Stellar, self-created tokens are called 'assets'. In everyday language, the terms are often mixed up, which leads to confusion."
  },
  "nativeCoin": {
    "title": "Native Coin",
    "original": "Native Coin",
    "short": "The original means of payment of a blockchain, managed by the network itself.",
    "desc": "Every blockchain has a native coin used for transaction fees and basic network functions. On Stellar, XLM is the native coin. It does not exist as a third-party token but is built directly into the protocol. The native coin is also often a means of spam prevention – on Stellar, every transaction must pay a small XLM fee."
  },
  "fungibility": {
    "title": "Fungibility",
    "original": "Fungibility",
    "short": "The property of an asset where every unit is identical and interchangeable with any other.",
    "desc": "A fungible asset is like a banknote: every 10-dollar bill is worth just as much as any other. With cryptocurrencies like XLM, BTC, or USDC, every unit is identical – one XLM is always equal to another XLM. The opposite are NFTs (Non-Fungible Tokens): each NFT is unique and not interchangeable. Fungibility is an important property for use as a currency."
  },
  "wrappedToken": {
    "title": "Wrapped Token",
    "original": "Wrapped Token",
    "short": "A token that represents the value of another asset on a different blockchain.",
    "desc": "A wrapped token makes it possible to use assets from one blockchain on another. Example: Wrapped Bitcoin (WBTC) is a token on Ethereum that is backed 1:1 by real Bitcoin. The original is locked in a smart contract, and in return the wrapped token is issued. On Stellar, Bitcoin or Ether can be issued as wrapped tokens by anchors, allowing them to be traded on the Stellar network."
  },
  "syntheticAsset": {
    "title": "Synthetic Asset",
    "original": "Synthetic Asset",
    "short": "A token that replicates the price of a real-world asset without directly owning it.",
    "desc": "Synthetic assets replicate the value of other assets – e.g. stocks, gold, or currencies – without owning the original. They are secured through smart contracts and collateral. An example: a synthetic Apple stock token follows the price of the real stock but is a crypto token. Synthetic assets are an advanced DeFi concept."
  },
  "memeCoin": {
    "title": "Meme Coin",
    "original": "Meme Coin",
    "short": "A cryptocurrency based on an internet meme or joke that usually has no technical utility.",
    "desc": "Meme coins like Dogecoin (DOGE) or Shiba Inu (SHIB) originally started as a joke but sometimes reached enormous market values through community hype and social media attention. They generally have no technical added value and are extremely speculative. Their value is based almost entirely on sentiment and trends. For beginners, meme coins are particularly risky."
  },
  "stellarAsset": {
    "title": "Stellar Asset",
    "original": "Stellar Asset",
    "short": "Any asset issued on the Stellar network, defined by its asset code and issuer address.",
    "desc": "On Stellar, anyone can create their own asset – a company its loyalty token, a bank its stablecoin. Every Stellar asset is uniquely identified by two components: the asset code (e.g. 'USD', 'MOBI', 'USDC') and the G-address of the issuer. Two assets with the same code but different issuers are different assets. To receive a Stellar asset, you must first set up a trustline to the issuer."
  },
  "issuedAsset": {
    "title": "Issued Asset",
    "original": "Issued Asset",
    "short": "An asset issued by an anchor or company on Stellar that represents a real-world counterpart.",
    "desc": "An issued asset is a Stellar asset issued by an anchor that represents a real-world value – e.g. US dollars, euros, or gold. The anchor holds the real counterpart and issues corresponding tokens on Stellar. Users can hold and trade these tokens. To get back the real asset, you redeem the tokens with the anchor (offramp). Well-known examples are USDC (Circle) or EURC."
  },
  "missingKey": "Missing glossary key: {{detail}}",
  "zkp": {
    "title": "Zero-Knowledge Proof",
    "original": "Zero-Knowledge Proof (ZKP)",
    "short": "Proves a statement is true without revealing the underlying data.",
    "desc": "Imagine proving you are old enough to enter a website without showing your ID. A Zero-Knowledge Proof (ZKP) does exactly that: it proves a claim is true without revealing the underlying information.\n\nEveryday analogy:\nYou prove to a website that you are over 18 without sharing your name, date of birth, or photo. The site only learns: Yes, old enough.\n\nHow it works:\n1. Prover: Creates a mathematical proof for a claim.\n2. Verifier: Checks the proof without seeing the original value.\n3. Result: True or False - nothing more.\n\nRelevance for Stellar and blockchain:\nBlockchain transactions are normally public. ZKP technology allows transactions to be verified without exposing sensitive data (amount, recipient):\n- Privacy-preserving payments\n- KYC verification without sharing identity data\n- Scaling via compressed proofs (zk-SNARKs, zk-STARKs)\n\nCurrent situation on Stellar:\nThe core protocol does not yet use ZKP, but Soroban smart contracts can integrate ZKP libraries.\n\nHow to recognise reliable ZKP sources:\n- Prefer .org or .edu domains\n- Check the project's GitHub presence\n- Look for academic citations or whitepapers",
    "externalDomains": [
      "ethereum.org/en/zero-knowledge-proofs",
      "zkhack.dev",
      "zkproof.org"
    ],
    "domainsHeading": "Further reading (type the domain yourself):"
  },
  "walletWatcher": {
    "title": "Wallet Watcher / Drainer",
    "original": "Wallet Watcher / Drainer",
    "short": "An automated script that monitors a compromised account and instantly withdraws every new deposit.",
    "desc": "Once scammers gain access to a secret key, they often set up an automatic watcher. It monitors the account around the clock and transfers every new deposit to the scammer's account instantly – often within seconds. The account is permanently compromised. The only solution: immediately create a new wallet with completely new keys and never use the old account again."
  },
  "lumio": {
    "title": "Lumio",
    "original": "Lumio",
    "short": "Mascot of the Stellar Konto Manager – a living Lumen.",
    "desc": "Lumio is the mascot of the Stellar Konto Manager and your companion in Story Mode. His name comes from 'Lumen' – the official name for the base unit of Stellar's currency XLM. You could say: Lumio is a Lumen that came to life to teach others how the Stellar blockchain works. The name has a second meaning too: 'lumen' is Latin for 'light' – fitting for a glowing star that spreads knowledge."
  },
  "base_fee": {
    "title": "Base Fee",
    "original": "Base Fee",
    "short": "Small network fee (0.00001 XLM) per transaction – prevents spam.",
    "desc": "The base fee is a very small fee for every transaction on Stellar. It amounts to 0.00001 XLM. The fee is burned and thus prevents spam transactions. Without a fee, a transaction will be rejected."
  },
  "transaction_hash": {
    "title": "Transaction Hash",
    "original": "Transaction Hash",
    "short": "Unique ID for every transaction – serves as proof.",
    "desc": "Every transaction on Stellar receives a unique ID, the transaction hash. Anyone can look up the transaction in the Explorer using this hash. It serves as a receipt and proof that the transaction took place."
  },
  "friendbot": {
    "title": "Friendbot",
    "original": "Friendbot",
    "short": "Testnet service that activates new accounts for free with test XLM.",
    "desc": "Friendbot is a service provided by the Stellar Development Foundation. It activates new Testnet accounts for free with 10,000 test XLM. On the real Mainnet there is no Friendbot – another account must send at least 1 XLM to activate a new account."
  },
  "keypair": {
    "title": "Keypair",
    "original": "Keypair",
    "short": "Matching combination of Public Key and Secret Key.",
    "desc": "A keypair consists of two matching keys: the Public Key (your address) and the Secret Key (your password). Both keys belong together and form a unit. You share the Public Key publicly – the Secret Key you always keep to yourself."
  }
}