{
  "pageTitle": "Glossary",
  "pageIntro": "Here you will find important terms from the blockchain world and the Stellar network. Everything is explained in simple words.",
  "searchLabel": "Search term",
  "searchPlaceholder": "Search term (z. B. Konto, Account, Muxed)",
  "searchHint": "The search finds words and explanations.",
  "noResults": "No match.",
  "groups": {
    "accountsKeys": "Accounts & Keys",
    "multisigSecurity": "Multisig & Account Security",
    "walletsCustody": "Wallets & Custody",
    "tokensAssets": "Token & Assets",
    "transactionsFees": "Transactions & Fees",
    "marketsTrading": "Markets & Trading",
    "networkProtocol": "Network & Protocol",
    "smartContracts": "Smart Contracts",
    "blockchainBasics": "Blockchain Basics",
    "security": "Security & Fraud"
  },
  "blockchain": {
    "title": "Blockchain",
    "original": "Blockchain",
    "short": "Shared digital ledger – many computers store the same entries.",
    "desc": "A blockchain is like a digital ledger. Many computers store the same entries, ensuring that no one can secretly make changes."
  },
  "wallet": {
    "title": "Wallet",
    "original": "Wallet",
    "short": "Digital wallet that manages your keys.",
    "desc": "A wallet is your digital purse. It manages the keys you need to access your account and send transactions. A wallet can be a program, an app, or even just a piece of paper with your private key."
  },
  "account": {
    "title": "Account",
    "original": "Account",
    "short": "A blockchain account can hold assets and send transactions.",
    "desc": "An account is the location on the blockchain where your assets are held. An account has a public address that begins with G. Multiple wallets can access the same account if they have the correct key."
  },
  "addressG": {
    "title": "G address",
    "original": "G Address",
    "short": "The public primary address of a Stellar account (beginnt mit G).",
    "desc": "The G-address is the main address of a Stellar account. It starts with the letter G. You provide it to others so they can send you something."
  },
  "publicKey": {
    "title": "Public key",
    "original": "Public Key",
    "short": "Adresse, die du teilen darfst; bei Stellar meist die G‑Adresse.",
    "desc": "The public key is the address you are allowed to share. In Stellar, this is the G-address. Others use it to send you money."
  },
  "privateKey": {
    "title": "Secret key",
    "original": "Secret Key",
    "short": "Password for the account – never share it.",
    "desc": "The secret key is your password for the account. Whoever has this key can move your money. Never share it."
  },
  "addressFederation": {
    "title": "Federation address",
    "original": "Federation Address",
    "short": "Kurze Adresse wie E‑Mail, zeigt auf eine G‑Adresse.",
    "desc": "A federation address looks like an email. Example: name*domain.com. This short address points to a regular G-address. It's easier to remember."
  },
  "addressMuxed": {
    "title": "Muxed account",
    "original": "Muxed Account",
    "short": "M‑address with additional ID – shares a base account.",
    "desc": "An M-address points to an existing Stellar account but has an additional number (ID).\n\nMuxed Accounts = G-account + ID (M-Adresse)\nThey provide association, but no account separation.\nBalance, trustlines, signers, flags are always on the G-account.\n\nStellar Development Foundation\n\nFor example, multiple individuals or departments can be distinguished under the same G-address. Technically, the money still belongs to the main account."
  },
  "muxedAccountsUseCases": {
    "title": "Use cases for Muxed Accounts",
    "original": "Muxed accounts use cases",
    "short": "Examples, benefits, and limitations of M-addresses as a mapping aid.",
    "desc": "Company - Example\n\nSetup:\n- A company G-account\n- One M-address per customer/use-case (ID)\n\nProcess:\n- Customer pays to their M-address\n- Everything goes to the company G-account\n- Accounting reads the ID -> unique allocation\n\nSuitable for:\n- Shops, payment providers, exchanges\n- Internal references without memo risks\n\nAssociation - Example\n\nSetup:\n- An association G-account\n- M-addresses for members, departments, purposes\n\nProcess:\n- Contribution/donation to the appropriate M-address\n- Allocation via ID, no memo errors\n\nSuitable for:\n- Membership fees\n- Earmarked revenues\n- Easy auditing\n\nWhat Muxed Accounts excel at:\n- Robust input allocation\n- One account, many identities\n- No memo requirement\n- Fewer operational errors\n\nWhat Muxed Accounts are not:\n- Not sub-accounts\n- No individual balance\n- No individual trustlines\n- No individual signers/rights\n\nTypically unsuitable use cases:\n- Salary payments/payroll accounts (benoetigen eigenes G-Konto)\n- Trust/Escrow for third parties (kein rechtlicher Vermoegenstrenner)\n- Role-based security (keine getrennten Signer/Thresholds)\n- Budget or limit separation (keine separaten Salden/Asset-Limits)\n- Compliance-separated accounts (KYC/Reporting nicht sauber trennbar)\n\nComparison (Kurz):\nAssigning payments: Yes\nSeparating assets: No\nDelegating access: No\nLegally separate account: No\nInternal accounting: Yes\n\nKey takeaway:\nMuxed Accounts address payments - they do not replace accounts.\nIf control, ownership, or separation is needed -> own G-account."
  },
  "multisig": {
    "title": "Multisignature",
    "original": "Multi‑Sig",
    "short": "Important actions require more than a signature.",
    "desc": "Multi-Sig stands for multiple signatures. An important action requires more than one key. Example: You and a second key must both agree before something is sent. This makes theft more difficult.",
    "help": {
      "title": "General Explanation of a Multisignature (Multi-Signature) Company Account",
      "intro": "A company can use a shared blockchain account in which several authorized individuals are involved. Typically, at least three signatories (Signer) are included, for example, the management, the financial officer, and compliance/backup. The objective is for individual persons to be able to execute payments independently without allowing a single person to control or take over the account alone.",
      "problem": "If a signer (Signer) has enough weight to execute payments and simultaneously has enough weight for account changes, that person could remove other signers (Signer) or adjust the threshold/weighting (Thresholds) and thus take over the account. Conversely, the original owner should also not be able to easily exclude other signers (Signer) without checks and balances. A multi-signature structure ensures that important decisions are always collectively made by multiple people.",
      "setupTitle": "Example of a secure multi-signature structure with three signers",
      "setupWeights": "In an example with three equal roles, all receive the same signature strength:\n- Signer (Signer) A (Management): Weight 2\n- Signer (Signer) B (Finanzen): Weight 2\n- Signer (Signer) C (Compliance/Backup): Weight 2",
      "setupThresholds": "Appropriate thresholds/weights are set as follows:\n- Low (low_threshold): 1\n- Medium (med_threshold): 2 (for payments and other medium actions)\n- High (high_threshold): 4 (for structural changes such as adding/removing signers (Signer) or changing the threshold/weight (Thresholds))\nThis ensures that each authorized person can execute payments, but no individual person can alter the account structure alone.",
      "behavior": "With this configuration, payments can be made by any of the three eligible individuals alone because each individual's weight meets the medium threshold/Threshold. For structural changes such as removing a signer/Signers, adjusting the thresholds/weights, or merging or closing the account, the high threshold/high_threshold is required. This value can only be achieved when at least two of the three signers/Signer sign together. This setup keeps the account flexible for daily use while providing strong protection against misuse.",
      "removal": "Wenn eine Person das Unternehmen verlässt oder nicht mehr vertrauenswürdig ist, können zwei der verbleibenden Unterzeichner (Signer) gemeinsam die Signaturrechte dieser Person entfernen. Kein einzelner Unterzeichner (Signer) – weder ein Mitarbeiter noch die Geschäftsführung – kann andere eigenständig aus dem Konto ausschließen. Der Entzug von Berechtigungen erfolgt also immer kontrolliert und nachvollziehbar durch mindestens zwei Verantwortliche.",
      "summary": "This type of multi-sig structure allows individual parties to efficiently process payments while maintaining control of the account among multiple participants. It reduces the risk of account takeovers, protects against unilateral decisions, and is particularly suitable for corporate accounts where both security and operational flexibility are important.",
      "closeLabel": "Close",
      "linkLabel": "What does Multi-Signature mean?",
      "glossaryLinkLabel": "View in glossary"
    }
  },
  "multisigCorporate": {
    "title": "Multisignature - Example",
    "original": "Multi-Signature - Example",
    "short": "Example of a multi-signature structure for corporate accounts with roles, weights, and thresholds."
  },
  "trustline": {
    "title": "Trustline",
    "original": "Trustline",
    "short": "Agreement to hold a token from a specific issuer.",
    "desc": "A trustline is like a \"Yes, I accept this token.\" By setting it up, you're indicating that your account is ready to hold a specific token from a specific issuer. Without a trustline, you cannot receive this token.\n\nExample: A trustline is specified as CODE:ISSUER. For EURT from the issuer GDUKMGUGDZQK6Y…, it would be EURT:GDUKMGUGDZQK6Y…"
  },
  "token": {
    "title": "Token",
    "original": "Token",
    "short": "Digital unit – for example, money, points, or credits.",
    "desc": "A token is a digital unit on the blockchain. A token can represent money, points, or credits for a service."
  },
  "asset": {
    "title": "Asset",
    "original": "Asset",
    "short": "Tokens on Stellar are always linked to an issuer.",
    "desc": "On Stellar, a token is called an asset. An asset is always linked to an issuer account. For example, an account can issue a Euro token, and this Euro token is then considered an asset."
  },
  "xlm": {
    "title": "XLM",
    "original": "XLM",
    "short": "Native currency of Stellar for fees and activation.",
    "desc": "XLM is the native currency of Stellar. You need XLM to pay fees and to start a new account."
  },
  "mainnet": {
    "title": "Mainnet",
    "original": "Mainnet",
    "short": "Echtes Stellar‑Netzwerk mit realem Wert.",
    "desc": "The real Stellar network with actual value. Transactions are final and fees are paid in real XLM."
  },
  "testnet": {
    "title": "Testnet",
    "original": "Testnet",
    "short": "Public training network without real value.",
    "desc": "A public practice network. Tokens have no real value. Ideal for learning and experimenting without risk."
  },
  "memo": {
    "title": "Memo",
    "original": "Memo",
    "short": "Short note in a transaction.",
    "desc": "A memo is a small note that you can send along with a transaction. Often, an exchange requires a specific memo to know to whom the money belongs."
  },
  "transaction": {
    "title": "Transaction",
    "original": "Transaction",
    "short": "Action on the blockchain, e.g., payment or trustline.",
    "desc": "A transaction is an action on the blockchain, such as sending money or establishing a trust line. Once confirmed, a transaction is permanently recorded."
  },
  "fee": {
    "title": "Fee",
    "original": "Fee",
    "short": "Very small amount per transaction.",
    "desc": "The fee is a very small amount that you pay with each transaction. The fee goes to the network. On Stellar, the fees are very low."
  },
  "ledger": {
    "title": "Ledger",
    "original": "Ledger",
    "short": "Chain of confirmed data and balances.",
    "desc": "The ledger is the chain of all confirmed data. It shows which accounts hold how much and what transactions have occurred. Anyone can check the ledger."
  },
  "horizon": {
    "title": "Horizon",
    "original": "Horizon",
    "short": "API‑Dienst, über den Apps mit Stellar sprechen.",
    "desc": "Horizon is the service through which programs communicate with the Stellar blockchain. Our tool queries Horizon to load account balances and transactions."
  },
  "horizonHistory": {
    "title": "Horizon History",
    "original": "Horizon history depth",
    "short": "Describes how far back the transaction history provided by public Horizon servers extends.",
    "desc": "The public Horizon servers (Mainnet und Testnet) operated by the Stellar Development Foundation only provide a limited history – currently approximately one year retroactively. Older data can no longer be retrieved through these free endpoints. If you need to go further back in time, you essentially have two options: (1) you can run your own Horizon node with full history (inklusive History Archives), or (2) you can use third-party or paid services that store and provide long-term historical Stellar data.",
    "seeAlso": "Es wurde kein spezifischer Text zur Übersetzung bereitgestellt. Bitte geben Sie den Text ein, den Sie übersetzt haben möchten."
  },
  "anchor": {
    "title": "Anchor",
    "original": "Anchor",
    "short": "Firma, die Fiat‑Geld mit Stellar verbindet.",
    "desc": "An anchor is a company that connects real money, such as euros or dollars, with Stellar. For example, you give the anchor euros and receive a euro token on Stellar in return."
  },
  "exchange": {
    "title": "Stock exchange",
    "original": "Exchange",
    "short": "Place to buy and sell tokens.",
    "desc": "An exchange is a place where you can buy or sell tokens. Many exchanges require a KYC process, meaning identity verification, before you can withdraw money in euros or francs."
  },
  "dex": {
    "title": "DEX (Decentralized Exchange)",
    "original": "Decentralized Exchange",
    "short": "Decentralized exchange directly on the blockchain.",
    "desc": "DEX stands for Decentralized Exchange. Here, people trade directly with each other on the blockchain. There is no single operator. Stellar has a DEX built directly into it."
  },
  "liquidityPool": {
    "title": "Liquidity pool",
    "original": "Liquidity Pool",
    "short": "Common pool with two tokens for immediate exchange.",
    "desc": "A liquidity pool is a shared pot containing two tokens. People deposit both tokens into it. Others are then allowed to instantly exchange these tokens. The depositors earn small fees in return."
  },
  "balanceClaimable": {
    "title": "Claimable Balance",
    "original": "Claimable Balance",
    "short": "Reserved money that you still need to receive.",
    "desc": "A claimable balance is money that is already reserved for you, but you still need to claim it. It only gets credited to your account once you accept it."
  },
  "protocolUpdate": {
    "title": "Protocol Update",
    "original": "Protocol Update",
    "short": "Aktualisierung der Netzwerk‑Regeln.",
    "desc": "A Protocol Update is an upgrade of the rules in the Stellar network, such as new features or security changes. All nodes in the network must use the same rules."
  },
  "soroban": {
    "title": "Soroban",
    "original": "Soroban",
    "short": "Stellars Smart‑Contract‑System.",
    "desc": "Soroban is the smart contract system of Stellar. A smart contract is program code on the blockchain. The code can independently verify rules and trigger actions without the need for a bank intermediary."
  },
  "multiSignature": {
    "title": "Multisignature",
    "original": "Multi-Signature",
    "short": "Multiple signatures required; weights + threshold determine the release.",
    "desc": "In a multi-signature setup, multiple keys must sign before an action becomes valid. Each signer has a weight, and the sum must meet the required threshold. This increases security because a single stolen key is not sufficient."
  },
  "signer": {
    "title": "Signatory",
    "original": "Signer",
    "short": "Public key with weight, part of the account configuration.",
    "desc": "A signer is a public key that belongs to an account and has a weight. Its signature counts towards the required threshold. Multiple signers can collectively authorize a transaction.\n\nSigner types:\n- ed25519 (standard key)\n- hashX (Hash-Vorlage)\n- preAuthTx (vorab autorisierte Transaktion)\n\nSKM supports only ed25519. For additional options, visit https://lab.stellar.org."
  },
  "thresholds": {
    "title": "Thresholds",
    "original": "Thresholds",
    "short": "Limits (low/med/high) that set the required total weight.",
    "desc": "Thresholds define how many weighted signatures are required for actions: low for simple operations, med for payments, and high for critical changes. The sum of the signer weights must meet the respective threshold."
  },
  "masterWeight": {
    "title": "Master weight",
    "original": "master_weight",
    "short": "Weight of the master key; controls how much importance the master key holds.",
    "desc": "The master weight is the weight of the main key of an account. A high master weight allows the master key to sign many actions on its own; a low value requires additional signers."
  },
  "accountConfig": {
    "title": "Account configuration",
    "original": "Account Configuration",
    "short": "The interplay between signers and thresholds determines the security of the account.",
    "desc": "The account configuration defines which signers exist with which weights and what thresholds apply. Changes to signers or thresholds are security-critical because they determine how many signatures are required."
  },
  "distributedNetwork": {
    "title": "Distributed network",
    "original": "Distributed Network",
    "short": "Many computers work together instead of one making all the decisions.",
    "desc": "Imagine a market where many traders know the same rules. If one participant drops out, it continues to run because others can take over. This keeps the system stable and more difficult to manipulate."
  },
  "node": {
    "title": "Node",
    "original": "Node",
    "short": "A single participant in the network.",
    "desc": "A node is like a ledger-keeper that holds a copy of the data. It verifies new entries and passes them on. Many nodes together make the network reliable."
  },
  "block": {
    "title": "Block",
    "original": "Block",
    "short": "A block is a bundle of entries.",
    "desc": "Like a page in a cash book, a block collects several transactions. Once it is full, it is completed and added to the chain. This creates the history step by step."
  },
  "consensusMechanism": {
    "title": "Consensus mechanism",
    "original": "Consensus Mechanism",
    "short": "Rules by which everyone agrees on valid entries.",
    "desc": "It's like when a group decides which receipt is valid. This prevents anyone from secretly making changes. Different blockchains use different methods, but the goal is always consensus."
  },
  "finality": {
    "title": "Finality / Definitiveness",
    "original": "Finality",
    "short": "The certainty that a transaction is final.",
    "desc": "When something is final, it feels like a confirmed bank statement. You no longer have to expect it to be reversed. This creates trust."
  },
  "immutability": {
    "title": "Immutability",
    "original": "Immutability",
    "short": "Entries should not be altered retrospectively.",
    "desc": "Similar to a ledger: Any after-the-fact erasures are noticeable. Changes are added as a new entry, not overwritten. This makes the history traceable."
  },
  "decentralization": {
    "title": "Decentralization",
    "original": "Decentralization",
    "short": "No central authority controls everything.",
    "desc": "Instead of a single vault, there are many vaults with the same information. Decisions emerge from the interaction of many participants. This makes the system more robust."
  },
  "publicBlockchain": {
    "title": "Public blockchain",
    "original": "Public Blockchain",
    "short": "Open to anyone who wishes to participate.",
    "desc": "Everyone can participate and view the data, similar to a public notice board. This increases transparency, but every action is visible to everyone. Rules ensure that nobody can cheat."
  },
  "privateBlockchain": {
    "title": "Private blockchain",
    "original": "Private Blockchain",
    "short": "Access for selected participants only.",
    "desc": "Like a company cash book that only employees are allowed to see. It can be faster and more controlled, but it is less open. Trust is established here through the organization."
  },
  "permissionlessBlockchain": {
    "title": "Permissionless blockchain",
    "original": "Permissionless Blockchain",
    "short": "Everyone is allowed to participate without permission.",
    "desc": "Like a market that anyone can join. This lowers barriers but may require more rules to stay fair. Examples include many public blockchains."
  },
  "permissionedBlockchain": {
    "title": "Permissioned blockchain",
    "original": "Permissioned Blockchain",
    "short": "Participation by permission only.",
    "desc": "Like a club with a membership list. This can create clear responsibilities. However, it is less open."
  },
  "seedPhrase": {
    "title": "Restoration theorem",
    "original": "Seed Phrase / Recovery Phrase",
    "short": "A word list with which you can restore your wallet.",
    "desc": "She is like the backup key to your safe. Whoever has it can restore your wallet. Therefore, it should never be stored online."
  },
  "selfCustody": {
    "title": "Self-custody",
    "original": "Self-Custody",
    "short": "You are keeping your keys yourself.",
    "desc": "Like cash in your own safe: you have control, but also the responsibility. If you lose access, no one can help. For beginners, caution is especially important."
  },
  "custodian": {
    "title": "Custodian",
    "original": "Custodian",
    "short": "A service provider keeps your keys for you.",
    "desc": "Like a bank that manages your account. It can be convenient but takes away full control from you. You have to trust it."
  },
  "hardwareWallet": {
    "title": "Hardware wallet",
    "original": "Hardware Wallet",
    "short": "A physical device for your keys.",
    "desc": "Like a small safe in your pocket. The keys remain on the device and do not go online. This protects against many online attacks."
  },
  "hotWallet": {
    "title": "Hot wallet",
    "original": "Hot Wallet",
    "short": "A wallet with internet access.",
    "desc": "Like a wallet in a jacket: convenient but more vulnerable. Good for small amounts and everyday use. Not ideal for large sums."
  },
  "coldWallet": {
    "title": "Cold wallet",
    "original": "Cold Wallet",
    "short": "A wallet without an internet connection.",
    "desc": "Like a safe in the basement. Very secure, but impractical for everyday use. Suitable for long-term storage."
  },
  "cryptocurrency": {
    "title": "Cryptocurrency",
    "original": "Cryptocurrency",
    "short": "Digital currency that is sent directly between people.",
    "desc": "Like digital cash, but without a bank. You can send it directly to others. The value can fluctuate."
  },
  "altcoin": {
    "title": "Altcoin",
    "original": "Altcoin",
    "short": "All cryptocurrencies except Bitcoin.",
    "desc": "Like other brands on the market besides the dominant player. Some are well-known, many are small. Quality and risk vary greatly."
  },
  "stablecoin": {
    "title": "Stablecoin",
    "original": "Stablecoin",
    "short": "Cryptocurrency with a potentially stable value.",
    "desc": "Like digital money that is pegged to a standard currency. This makes its price more stable. However, trust in the provider is still important."
  },
  "utilityToken": {
    "title": "Usage token",
    "original": "Utility Token",
    "short": "A token that can be used to access a service.",
    "desc": "Like a voucher at a market stall. It provides access or a discount. Its value depends on the usefulness of the service."
  },
  "securityToken": {
    "title": "Security tokens",
    "original": "Security Token",
    "short": "A token with security characteristics.",
    "desc": "Like a stock certificate. It can promise rights or profits. Stricter rules often apply for this."
  },
  "governanceToken": {
    "title": "Governance token",
    "original": "Governance Token",
    "short": "A token to have a say in rules.",
    "desc": "Like a voting card in a club. Those who have tokens can vote on rules. That means responsibility."
  },
  "liquidityToken": {
    "title": "Liquidity tokens / LP tokens",
    "original": "Liquidity Token",
    "short": "A token for provided liquidity.",
    "desc": "Like a receipt showing that you have contributed money to a shared pool. You receive proportional fees. The value can fluctuate."
  },
  "nft": {
    "title": "Non-fungible token / NFT",
    "original": "Non-Fungible Token",
    "short": "A unique digital token.",
    "desc": "Like a signed collectible item. It represents something unique, not an interchangeable coin. The value depends on demand."
  },
  "cbdc": {
    "title": "Central Bank Digital Currency / CBDC",
    "original": "Central Bank Digital Currency",
    "short": "Digital money issued by a central bank.",
    "desc": "Like digital cash from the state. It would be official money, just in digital form. Details depend on the specific country."
  },
  "transactionStatus": {
    "title": "Transaction status",
    "original": "Transaction Status",
    "short": "Indicates whether a transaction is still open or already completed.",
    "desc": "Like package tracking: pending, confirmed, or failed. This way, you can see if everything worked out. Sometimes it takes a little while."
  },
  "gasFee": {
    "title": "Gas fee",
    "original": "Gas Fee",
    "short": "A fee for computational work in the network.",
    "desc": "Like a processing fee at a market stall. The busier it is, the more expensive it can become. Not every blockchain calls it gas."
  },
  "onChain": {
    "title": "On-chain",
    "original": "On-Chain",
    "short": "Occurs directly on the blockchain.",
    "desc": "Like an entry directly into the ledger. Anyone can see it. It's transparent, but often slower or more expensive."
  },
  "offChain": {
    "title": "Off-chain",
    "original": "Off-Chain",
    "short": "Occurs outside the blockchain.",
    "desc": "Like a verbal agreement that is later recorded in the ledger. This can be faster and more cost-effective. Trust plays a larger role here."
  },
  "liquidity": {
    "title": "Liquidity",
    "original": "Liquidity",
    "short": "Shows how easily something can be handled.",
    "desc": "The number of buyers and sellers there are. High liquidity means you can trade quickly without significantly affecting the price. Low liquidity feels sluggish."
  },
  "volatility": {
    "title": "Volatility",
    "original": "Volatility",
    "short": "How much prices fluctuate.",
    "desc": "Like a market with wild price swings. High volatility means opportunities, but also risk. For beginners, this can be stressful."
  },
  "marketCap": {
    "title": "Market capitalization",
    "original": "Market Capitalization",
    "short": "The total value of a coin or project.",
    "desc": "Like the total value of all goods in a market. It is roughly derived from price multiplied by circulating quantity. Large values appear more stable, but they are not automatically so."
  },
  "circulatingSupply": {
    "title": "Circulation quantity",
    "original": "Circulating Supply",
    "short": "The amount of coins that is actually in circulation.",
    "desc": "Like the number of coins that are actually on the market. Not everything that exists is already in circulation. That influences the price."
  },
  "priceDiscovery": {
    "title": "Pricing",
    "original": "Price Discovery",
    "short": "This is how the price is determined by supply and demand.",
    "desc": "It's like a market: supply and demand meet. Many small decisions determine the price. There is no fixed switch."
  },
  "spread": {
    "title": "Trading range",
    "original": "Spread",
    "short": "The difference between the purchase price and the selling price.",
    "desc": "Like the bid-ask spread in a store. The smaller the gap, the fairer it feels. Large spreads make trades more expensive."
  },
  "phishing": {
    "title": "Phishing",
    "original": "Phishing",
    "short": "Fraud through fake news or websites.",
    "desc": "Like a fake bank email that lures you into a trap. The goal is for you to give away your login credentials. Never click on links blindly."
  },
  "smartContract": {
    "title": "Smart contract",
    "original": "Smart Contract",
    "short": "A program that automatically executes fixed rules.",
    "desc": "Like a machine that responds according to fixed rules. It executes agreements automatically. This saves trust but requires clear rules."
  },
  "programmableLogic": {
    "title": "Automated rules",
    "original": "Programmable Logic",
    "short": "Rules that automatically execute when something happens.",
    "desc": "Like an if-then rule in an automaton. This allows processes to be controlled without manual intervention every time. This is how simple digital contracts are created."
  },
  "networkCongestion": {
    "title": "Network utilization",
    "original": "Network Congestion",
    "short": "If there are a large number of transactions pending simultaneously.",
    "desc": "Like a traffic jam on the highway. Transactions take longer and fees can increase. With less traffic, it becomes faster again."
  },
  "blockchainTypes": {
    "title": "Types of Blockchain",
    "original": "Blockchain Types",
    "short": "There are various types of blockchains with different goals.",
    "desc": "Like different vehicle types for different routes. Some are built for payments, others for programs. It's worth knowing the purpose."
  },
  "paymentBlockchain": {
    "title": "Payment blockchain",
    "original": "Payment Blockchain",
    "short": "A blockchain designed for fast payments.",
    "desc": "Like a quick ledger for money. The focus is on inexpensive and fast transfers. Features are often intentionally kept simple."
  },
  "smartContractBlockchain": {
    "title": "Smart contract blockchain",
    "original": "Smart Contract Blockchain",
    "short": "A blockchain capable of running programs and apps.",
    "desc": "Like a market with many vending machines. In addition to payments, rules and apps can run there. This makes them versatile, but often more complex."
  },
  "blockchainComparison": {
    "title": "Blockchain comparison",
    "original": "Blockchain Comparison",
    "short": "A comparison reveals the strengths and weaknesses of different blockchains.",
    "desc": "Like the comparison of banks or markets: Each has strengths and weaknesses. Important factors are cost, speed, and security. There is no perfect system for everything."
  },
  "stellarVsBitcoinVsEthereum": {
    "title": "Stellar vs. Bitcoin vs. Ethereum",
    "original": "Stellar vs. Bitcoin vs. Ethereum",
    "short": "Three well-known blockchains with different focuses.",
    "desc": "Bitcoin is like digital gold and is often seen as a store of value. Ethereum is like a platform for programs and apps. Stellar is focused on affordable payments."
  },
  "missingKey": "Missing glossary key: {{detail}}"
}