{
  "pageTitle": "Glossary",
  "pageIntro": "Here you will find important words from the blockchain world and from the Stellar network. Everything is explained in simple terms.",
  "searchLabel": "Search term",
  "searchPlaceholder": "Search term (e.g., Konto, Account, Muxed)",
  "searchHint": "The search finds words and explanations.",
  "noResults": "No match.",
  "blockchain": {
    "title": "Blockchain",
    "original": "Blockchain",
    "short": "Shared digital ledger - many computers store the same entries.",
    "desc": "A blockchain is like a digital ledger. Many computers store the same entries, which prevents anyone from secretly making changes."
  },
  "wallet": {
    "title": "Wallet",
    "original": "Wallet",
    "short": "Digital wallet that manages your keys.",
    "desc": "A wallet is your digital purse. It manages the keys you need to access your account and send transactions. A wallet can be a program, an app, or even just a piece of paper with your private key."
  },
  "account": {
    "title": "Account",
    "original": "Account",
    "short": "A blockchain account can hold assets and send transactions.",
    "desc": "An account is the place on the blockchain where your assets are stored. An account has a public address that begins with G. Multiple wallets can access the same account if they have the correct key."
  },
  "addressG": {
    "title": "G-address",
    "original": "G Address",
    "short": "The public main address of a Stellar account (begins with G).",
    "desc": "The G-address is the main address of a Stellar account. It starts with the letter G. You give it to others so they can send you something."
  },
  "publicKey": {
    "title": "Public key",
    "original": "Public Key",
    "short": "Address that you are allowed to share; usually the G-address in Stellar.",
    "desc": "The public key is the address you are allowed to share. In Stellar, this is the G-address. Others use it to send you money."
  },
  "privateKey": {
    "title": "Secret key",
    "original": "Secret Key",
    "short": "Password for the account - never share it.",
    "desc": "The secret key is your password for the account. Anyone who has this key can move your money. Never share it."
  },
  "addressFederation": {
    "title": "Federation address",
    "original": "Federation Address",
    "short": "Short address like email points to a G‑address.",
    "desc": "A federation address looks like an email. For example: name*domain.com. This short address points to a regular G-address. It is easier to remember."
  },
  "addressMuxed": {
    "title": "Muxed account",
    "original": "Muxed Account",
    "short": "M-address with additional ID – shares a base account.",
    "desc": "An M-address points to an existing Stellar account but also has its own number (ID). This allows, for example, distinguishing between multiple individuals or departments under the same G-address. Technically, the funds still belong to the main account."
  },
  "multisig": {
    "title": "Multisignature",
    "original": "Multi‑Sig",
    "short": "Important actions require more than a signature.",
    "desc": "Multi-Sig stands for multiple signatures. An important action requires more than one key. For example, you and a second key both need to agree before something can be sent. This makes theft more difficult."
  },
  "trustline": {
    "title": "Trustline",
    "original": "Trustline",
    "short": "Consent to hold a token from a specific issuer.",
    "desc": "A trustline is like a \"Yes, I accept this token.\" By doing so, you indicate that your account is ready to hold a specific token from a specific issuer. Without a trustline, you cannot receive this token.\n\nExample: A trustline is specified as CODE:ISSUER. For EURT from the issuer GDUKMGUGDZQK6Y…, it is EURT:GDUKMGUGDZQK6Y…"
  },
  "token": {
    "title": "Token",
    "original": "Token",
    "short": "Digital unit – e.g., money, points, or credit.",
    "desc": "A token is a digital unit on the blockchain. A token can represent money, points, or credits for a service."
  },
  "asset": {
    "title": "Asset",
    "original": "Asset",
    "short": "Tokens on Stellar are always linked to an issuer.",
    "desc": "On Stellar, a token is called an asset. An asset is always linked to an issuing account. For example, an account can issue a Euro token. This Euro token is then an asset."
  },
  "xlm": {
    "title": "XLM",
    "original": "XLM",
    "short": "Native currency of Stellar for fees and activation.",
    "desc": "XLM is the native currency of Stellar. You need XLM to pay fees and to open a new account."
  },
  "mainnet": {
    "title": "Mainnet",
    "original": "Mainnet",
    "short": "Real Stellar network with real value.",
    "desc": "The real Stellar network with actual value. Transactions are final, and fees are paid in real XLM."
  },
  "testnet": {
    "title": "Testnet",
    "original": "Testnet",
    "short": "Public practice network without real value.",
    "desc": "A public practice network. Tokens have no real value. Ideal for learning and experimenting without risk."
  },
  "memo": {
    "title": "Memo",
    "original": "Memo",
    "short": "Short note in a transaction.",
    "desc": "A memo is a small note that you can send along with a transaction. Often, an exchange requires a specific memo so that it knows to whom the money belongs."
  },
  "transaction": {
    "title": "Transaction",
    "original": "Transaction",
    "short": "Action on the blockchain, e.g., payment or trustline.",
    "desc": "A transaction is an action on the blockchain. For example, sending money or setting up a trustline. A transaction is permanently recorded once it is confirmed."
  },
  "fee": {
    "title": "Fee",
    "original": "Fee",
    "short": "Very small amount per transaction.",
    "desc": "The fee is a very small amount you pay with each transaction. The fee goes to the network. With Stellar, the fees are very small."
  },
  "ledger": {
    "title": "Ledger",
    "original": "Ledger",
    "short": "Chain of confirmed data and account balances.",
    "desc": "The ledger is the chain of all confirmed data. It shows which accounts own how much and what transactions have occurred. Anyone can inspect the ledger."
  },
  "horizon": {
    "title": "Horizon",
    "original": "Horizon",
    "short": "API service through which apps interact with Stellar.",
    "desc": "Horizon is the service through which programs interact with the Stellar blockchain. Our tool queries Horizon to load account balances and transactions."
  },
  "anchor": {
    "title": "Anchor",
    "original": "Anchor",
    "short": "Company that connects fiat money with Stellar.",
    "desc": "An anchor is a company that connects real money like euros or dollars with Stellar. For example, you give the anchor euros and receive a euro token on Stellar in return."
  },
  "exchange": {
    "title": "Stock Exchange",
    "original": "Exchange",
    "short": "Place to buy and sell tokens.",
    "desc": "An exchange is a place where you can buy or sell tokens. Many exchanges require a KYC process, which means identity verification, before you can withdraw money in euros or francs."
  },
  "dex": {
    "title": "DEX",
    "original": "Decentralized Exchange",
    "short": "Decentralized exchange directly on the blockchain.",
    "desc": "DEX stands for Decentralized Exchange. Here, people trade directly with each other on the blockchain. There is no single operator. Stellar has a DEX built directly into it."
  },
  "liquidityPool": {
    "title": "Liquidity pool",
    "original": "Liquidity Pool",
    "short": "Shared pool with two tokens for immediate exchange.",
    "desc": "A liquidity pool is a shared pool consisting of two tokens. People deposit both tokens into it, allowing others to instantly exchange these tokens. The depositors earn small fees for this service."
  },
  "balanceClaimable": {
    "title": "Claimable Balance",
    "original": "Claimable Balance",
    "short": "Reserved funds that you still need to accept.",
    "desc": "A Claimable Balance is money that is already reserved for you, but you still need to claim it. It only gets added to your account once you accept it."
  },
  "protocolUpdate": {
    "title": "Protocol Update",
    "original": "Protocol Update",
    "short": "Updating network rules.",
    "desc": "A Protocol Update is an upgrade of the rules in the Stellar network, such as new functionalities or security changes. All nodes in the network must use the same rules."
  },
  "soroban": {
    "title": "Soroban",
    "original": "Soroban",
    "short": "Stellar's Smart Contract System.",
    "desc": "Soroban is Stellar's smart contract system. A smart contract is program code on the blockchain. The code can independently verify rules and trigger actions without a bank as an intermediary."
  },
  "missingKey": "Missing glossary key: {{detail}}"
}