{
  "title": "General Explanation of a Multisignature (Multi-Signature) Corporate Account",
  "intro": "A company can use a shared blockchain account involving multiple authorized individuals. Typically, at least three signatories (Signer) are involved, for example, management, financial officer, and compliance/backup. The goal is for individual persons to be able to execute payments independently, without any single person being able to control or take over the account alone.",
  "problem": "If a signer (Signer) has enough weight to execute payments and simultaneously possesses enough weight for account changes, this person could remove other signers (Signer) or adjust the threshold/weighting (Thresholds) and thereby take over the account. Conversely, the original owner should not be able to easily exclude other signers (Signer) without checks and balances. A multi-signature structure ensures that important decisions are always made jointly by multiple people.",
  "setupTitle": "Example of a secure multi-signature structure with three signers",
  "setupWeights": "In an example with three equally important roles, all receive the same signature strength:\n- Signer (Signer) A (Management): Weight 2\n- Signer (Signer) B (Finanzen): Weight 2\n- Signer (Signer) C (Compliance/Backup): Weight 2",
  "setupThresholds": "Appropriate thresholds/weights are set:\n- Low (low_threshold): 1\n- Medium (med_threshold): 2 (for payments and other medium actions)\n- High (high_threshold): 4 (for structural changes such as adding/removing signers (Signer) or changing the threshold/weight (Thresholds))\nThis allows each authorized individual to execute payments, but no single person can alter the account structure on their own.",
  "behavior": "With this configuration, payments can be executed by any of the three authorized individuals alone, as the individual weight always meets the middle threshold/Threshold. For structural changes such as removing a signatory/Signers, adjusting the thresholds/weights, or merging or closing the account, the high threshold/high_threshold is required. This value can only be achieved if at least two of the three signatories/Signer sign together. This way, the account remains flexible in daily use while being well protected against misuse.",
  "removal": "Wenn eine Person das Unternehmen verlässt oder nicht mehr vertrauenswürdig ist, können zwei der verbleibenden Unterzeichner (Signer) gemeinsam die Signaturrechte dieser Person entfernen. Kein einzelner Unterzeichner (Signer) – weder ein Mitarbeiter noch die Geschäftsführung – kann andere eigenständig aus dem Konto ausschließen. Der Entzug von Berechtigungen erfolgt also immer kontrolliert und nachvollziehbar durch mindestens zwei Verantwortliche.",
  "summary": "This type of multi-signature structure allows individual persons to process payments efficiently while keeping control of the account with multiple parties. It reduces the risk of account takeovers, protects against unilateral decisions, and is particularly suitable for corporate accounts where both security and operational flexibility are important.",
  "closeLabel": "Close",
  "linkLabel": "What does multi-signature mean?"
}