{
  "title": "General Explanation of a Multiple Signature (Multi-Signature) Corporate Account",
  "intro": "A company can use a shared blockchain account that involves multiple authorized individuals. Typically, at least three signers (Signer) are involved, such as management, finance officer, and compliance/backup. The goal is for individuals to be able to execute payments independently, without any single person being able to solely control or take over the account.",
  "problem": "If a signer (Signer) has enough weight to execute payments and at the same time enough weight for account changes, this person could remove other signers (Signer) or adjust the threshold/weighting (Thresholds), thereby taking over the account. Conversely, the original owner should not be able to simply exclude other signers (Signer) without checks and balances. A multi-sig structure ensures that important decisions are always supported collaboratively by multiple people.",
  "setupTitle": "Example of a secure multi-signature structure with three signers",
  "setupWeights": "In an example with three equal roles, all receive the same signature strength:\n- Signer (Signer) A (management): weight 2\n- Signer (Signer) B (Finanzen): weight 2\n- Signer (Signer) C (Compliance/Backup): weight 2",
  "setupThresholds": "Appropriate thresholds/weightings are set as follows:\n- Low (low_threshold): 1\n- Medium (med_threshold): 2 (for payments and other medium actions)\n- High (high_threshold): 4 (for structural changes such as adding/removing signers (Signer) or changing the threshold/weight (Thresholds))\nThis allows every authorized person to execute payments, but no individual person can alter the account structure alone.",
  "behavior": "With this configuration, payments can be conducted individually by any of the three authorized persons, as the individual weight meets the medium threshold/Threshold. However, structural changes, such as removing a signer/Signers, adjusting thresholds/weightings, or merging or closing the account, require a high threshold/high_threshold. This value can only be achieved when at least two of the three signers/Signer sign together. This setup keeps the account flexible for everyday use while providing strong protection against misuse.",
  "removal": "Wenn eine Person das Unternehmen verlässt oder nicht mehr vertrauenswürdig ist, können zwei der verbleibenden Unterzeichner (Signer) gemeinsam die Signaturrechte dieser Person entfernen. Kein einzelner Unterzeichner (Signer) – weder ein Mitarbeiter noch die Geschäftsführung – kann andere eigenständig aus dem Konto ausschließen. Der Entzug von Berechtigungen erfolgt also immer kontrolliert und nachvollziehbar durch mindestens zwei Verantwortliche.",
  "summary": "This type of multi-signature structure allows individual persons to process payments efficiently while the control over the account remains with multiple parties. It reduces the risk of account takeovers, protects against unilateral decisions, and is particularly suitable for corporate accounts where both security and operational flexibility are important.",
  "closeLabel": "Close",
  "linkLabel": "What does Multi-Signature mean?"
}