{
  "nav": {
    "title": "Story Mode",
    "chapter_select": "Choose Chapter",
    "chapter_select_title": "Chapter Selection",
    "chapter_select_sub": "Choose a chapter to play",
    "to_home": "Home",
    "to_chapters": "Chapters",
    "step_back": "Back",
    "confirm_leave": "Your progress in this chapter will be saved.",
    "confirm_leave_cancel": "Cancel",
    "confirm_leave_ok": "Leave",
    "chapter_locked": "Locked",
    "chapter_completed": "Completed",
    "chapter_current": "Continue",
    "chapter_start": "Start",
    "home_short": "Home",
    "chapters_short": "Chapters",
    "back_short": "Back",
    "back_to_home": "Back to Home"
  },
  "chapter1": {
    "introNarrator": "The Stellar blockchain – a digital network moving value around the globe. And tumbling right into it falls a small star...",
    "introDialog1": "Hi! I'm Lumio and I just landed on the Stellar blockchain! 🌟",
    "introDialog2": "But I don't have an account here yet... can you help me create one?",
    "keypairTitle": "Step 1 – What is a Keypair?",
    "keypairNarrator": "Every account on Stellar consists of two keys: the [[Public Key|publicKey]] (your address) and the [[Secret Key|privateKey]] (your password). Only someone who knows the Secret Key can send money.",
    "choicePublicKeyLabel": "I share the Public Key with others so they can send me XLM.",
    "choicePublicKeyHint": "Exactly! The [[Public Key|publicKey]] is like a bank account number – you can share it publicly. ✓",
    "choiceSecretShareLabel": "I give my Secret Key to someone I trust.",
    "choiceSecretShareHint": "Careful! NOBODY should know the [[Secret Key|privateKey]] – not even Stellar or Lumio. It gives full access to your account.",
    "choiceSameLabel": "Both keys are actually the same thing.",
    "choiceSameHint": "That's not correct. The Public and Secret Key form a pair, but have completely different roles.",
    "createTitle": "Step 2 – Your first Keypair",
    "createDialog": "Great! Now let's create our shared test account. Press the button – I'll keep watch!",
    "createActionLabel": "Generate Keypair",
    "createActionDesc": "Creates a random Public Key and Secret Key for the Stellar Testnet. For practice purposes only!",
    "warningDialog1": "Wow, we now have a keypair! Note down the Secret Key somewhere – but never show it to anyone!",
    "warningDialog2": "On the real network I'd recommend writing it on paper and keeping it somewhere safe.",
    "activateTitle": "Step 3 – Activate the Account",
    "activateNarrator": "A new Stellar account must first be activated – it needs at least 1 XLM as a reserve. On the Testnet, the '[[Friendbot|friendbot]]' gives us free test XLM.",
    "friendbotLabel": "Request Friendbot",
    "friendbotDesc": "Sends a request to the Stellar Friendbot, which activates our test account with 10,000 test XLM.",
    "friendbotError": "No keypair found – please generate one first.",
    "outroDialog1": "We have a real account on the Stellar Testnet! I can already see the XLM in the blockchain...",
    "outroDialog2": "You learned that quickly! In the next chapter we'll send XLM together.",
    "summaryTitle": "The Arrival",
    "summaryLearning1": "Every Stellar account consists of a Public Key (address) and Secret Key (password)",
    "summaryLearning2": "The Secret Key must never be shared",
    "summaryLearning3": "New accounts need at least 1 XLM minimum balance (base reserve)",
    "summaryLearning4": "The Friendbot activates Testnet accounts for free",
    "keypair_warning": "Write down your Secret Key now! It cannot be recovered. Anyone who knows it has full access to your account.",
    "keypair_confirm": "I have written down my Secret Key and understand that it cannot be recovered.",
    "keypair_public_label": "Your Public Key (Address)",
    "keypair_secret_label": "Your Secret Key – KEEP IT SECRET!",
    "keypair_copy": "Copy",
    "keypair_copied": "Copied!",
    "keypair_continue": "I've noted everything – continue",
    "explorer_title": "Your Account in Stellar Explorer",
    "explorer_desc": "In Stellar Explorer you can publicly view your account and all transactions – like a bank statement, but visible to everyone.",
    "explorer_hint": "Copy the address and open it manually in your browser.",
    "explorer_url_label": "Explorer URL",
    "explorer_copy_url": "Copy URL",
    "explorer_open": "View in Explorer",
    "explorer_confirm_title": "External Link",
    "explorer_confirm_text": "You will be redirected to {{explorer}}. A new tab will open.",
    "explorer_confirm_cancel": "Cancel",
    "explorer_confirm_ok": "Open",
    "summaryLearning4a": "On the Testnet, Friendbot activates accounts for free with test XLM",
    "summaryLearning4b": "On the real network (Mainnet), another account must send at least 1 XLM to activate your account – Friendbot doesn't exist there!",
    "title": "Create Account",
    "explorer_after_fund": "After account activation you can view it in the Explorer",
    "q1_question": "What do you do with your [[Public Key|publicKey]]?"
  },
  "chapter2": {
    "title": "Lumio's First Transaction",
    "section_tx": "Step 1 – What is a Transaction?",
    "section_memo": "Step 2 – The Memo Field",
    "section_action": "Step 3 – Send Payment",
    "narrator_intro": "Lumio now has an account with test XLM. But having money isn't enough – you also need to be able to send it. How does that work on Stellar?",
    "lumio_1a": "I want to send 10 XLM to my friend Cosmo! But how does that work?",
    "lumio_1b": "I hear there's something called a transaction... what exactly is that?",
    "narrator_tx": "A [[transaction|transaction]] on Stellar is an instruction to the network: send X XLM from account A to account B. The network checks the balance, deducts a small [[base fee|base_fee]], and writes everything to the [[ledger|ledger]].",
    "choice1_a": "It pays the network nodes and prevents spam transactions.",
    "choice1_b": "It goes directly to the Stellar Development Foundation as profit.",
    "choice1_c": "It's optional – you can leave it out.",
    "choice1_a_hint": "Exactly! The [[base fee|base_fee]] is very small (0.00001 XLM) but important for network security.",
    "choice1_b_hint": "Wrong – the fees are burned, not collected.",
    "choice1_c_hint": "Wrong – without a fee the transaction will be rejected.",
    "lumio_2": "And what is this Memo field I see in some wallets?",
    "narrator_memo": "The [[Memo|memo]] field is an optional comment on the transaction – maximum 28 characters. Exchanges use it to identify the sender. Without the correct Memo your funds can be lost!",
    "choice2_a": "Always – without a Memo the transaction will be rejected.",
    "choice2_b": "When sending to an exchange that requires a Memo.",
    "choice2_c": "Never – the Memo field is outdated and no longer used.",
    "choice2_a_hint": "Not always – between regular wallets the Memo is optional.",
    "choice2_b_hint": "Correct! At exchanges the [[Memo|memo]] identifies your account.",
    "choice2_c_hint": "Wrong – Memo is active and essential for exchange deposits.",
    "lumio_3": "Ok, I think I understand! Let's try a real transaction!",
    "action_label": "Send 10 XLM to Cosmo",
    "action_desc": "Sends 10 test XLM to Cosmo's Testnet account with Memo 'Hallo Cosmo'. Afterwards you'll see the transaction hash on the blockchain.",
    "error_no_keypair": "No keypair found – please complete Chapter 1 first.",
    "lumio_4a": "I see it! The transaction is on the blockchain! The [[transaction hash|transaction_hash]] is like a receipt number – anyone can look up the transaction with it.",
    "lumio_4b": "In the Stellar Explorer you can publicly view any transaction using the hash.",
    "narrator_hash": "The [[transaction hash|transaction_hash]] is a unique ID for every transaction. It proves beyond doubt that the transaction took place.",
    "learning_1": "A transaction sends XLM from one account to another",
    "learning_2": "The base fee (0.00001 XLM) pays the network and prevents spam",
    "learning_3": "The Memo field is essential for exchange deposits",
    "learning_4": "Every transaction has a unique hash as proof",
    "q1_question": "What is the purpose of the [[Base Fee|base_fee]] in a Stellar transaction?",
    "q2_question": "When do you need the [[Memo|memo]] field?",
    "preset_cosmo": "Cosmo (Testnet)"
  },
  "ui": {
    "tap_to_continue": "Tap to continue",
    "testnet_badge": "Testnet – no real tokens",
    "retry_hint": "Try again!",
    "learn_more": "Learn more",
    "glossary_title": "Glossary",
    "glossary_not_found": "Term not found.",
    "glossary_hint": "You can learn more about this in the glossary.",
    "continue": "Continue",
    "tx_success": "Transaction successful!",
    "tx_hash_label": "Transaction Hash",
    "open_in_explorer": "View in Explorer ↗",
    "hash_copied": "Copied!",
    "copy_hash": "Copy hash",
    "explorer_confirm_title": "External Link",
    "explorer_confirm_text": "A new tab will open.",
    "explorer_confirm_cancel": "Cancel",
    "explorer_confirm_ok": "Open"
  },
  "placeholder": {
    "chapter_label": "Chapter",
    "wip_title": "Under Construction",
    "wip_text": "This chapter is still being built. Lumio is working hard on it – check back soon!",
    "back_to_start": "Back to Chapter 1",
    "to_chapter_select": "Go to Chapter Select",
    "wip_hint": "Chapter {{next}} is also still in progress – but you can already take a look.",
    "next_chapter": "Continue to Chapter {{n}} →"
  },
  "chapter3": {
    "title": "The Merchant",
    "narrator_intro": "A harbour town on the Stellar network. Lumio discovers a market stall – and the air carries the scent of freshly roasted coffee...",
    "marco_1a": "☕ Marco: Welcome! I'm Marco, the coffee roaster. Every one of my CAFE tokens represents 100g of my finest coffee – right here on the Stellar blockchain!",
    "marco_1b": "☕ Marco: I'd love to send you 10 CAFE as a gift! But first we need to solve a small problem...",
    "lumio_1": "A problem? What do you mean, Marco?",
    "section_asset": "What is an Asset?",
    "lumio_2": "What exactly is an Asset on Stellar? And what makes someone an Anchor?",
    "narrator_asset": "On Stellar, anyone can issue their own token – we call that an '[[Asset|asset]]'. An [[Anchor|anchor]] is a real organisation that represents real-world value (like coffee or money) through Stellar tokens.",
    "marco_asset_1": "☕ Marco: Exactly! I am an Anchor – my CAFE tokens are backed by real coffee in my warehouse. Every token can be redeemed for 100g of coffee.",
    "marco_asset_2": "☕ Marco: The problem: before you can receive CAFE, your account must first 'trust' that it accepts CAFE. In other words: you need a Trust Line.",
    "section_trustline": "Trust Lines Explained",
    "narrator_trustline_intro": "A [[Trust Line|trustline]] is a permission to receive a specific token. Without one, Stellar rejects incoming tokens – protecting you from unwanted or dangerous tokens.",
    "tl_components_title": "Components of a Trust Line",
    "tl_code_label": "Asset Code",
    "tl_issuer_label": "Issuer Address",
    "tl_limit_label": "Limit",
    "tl_limit_val": "max amount (default: unlimited)",
    "narrator_tl_why": "Why does the issuer address matter? Anyone could create a token called 'CAFE'. Only Code + Issuer Address together make a token uniquely identifiable.",
    "tl_methods_title": "3 ways to add a Trust Line",
    "tl_method1": "Manually: enter the Asset Code and Issuer Address directly",
    "tl_method2": "QR Code / Deep Link: form is auto-filled – convenient, but beware of fake codes",
    "tl_method3": "TOML file (SEP-1): anchor publishes its assets on its official domain",
    "tl_continue": "Got it – continue",
    "section_danger": "Warning: Dangerous Trust Lines",
    "marco_danger": "☕ Marco: I've heard something alarming: someone has been handing out fake CAFE QR codes around town! Please be careful.",
    "narrator_danger_qr": "A fake QR code can point to a wrong issuer address. The token might still be called 'CAFE' – but it's worthless, because it comes from the wrong issuer.",
    "narrator_danger_toml": "Phishing domains are dangerous too: 'marco-cafe.com' and 'marcocafe.com' look almost identical. Always check the exact spelling of the domain.",
    "narrator_verify": "How to identify the real issuer:\n• Check stellar.expert – is the issuer known and verified?\n• The anchor's official website always lists the issuer address\n• The TOML domain must exactly match the official anchor website",
    "section_qr": "Test Your Knowledge",
    "q_qr": "Lumio receives two QR codes for CAFE tokens. Which one is real?",
    "choice_real_label": "QR Code A: Issuer GCAFE...A7F2 (verified on stellar.expert – Marco's official address)",
    "choice_real_hint": "Correct! This code comes from Marco's real issuer account, verified on stellar.expert. Always compare with the official website.",
    "choice_fake_label": "QR Code B: Issuer GCAFE...B8G3 (unknown address, no verification found)",
    "choice_fake_hint": "Watch out! This issuer address is unknown. The tokens would be worthless. Always verify the issuer first.",
    "section_action_tl": "Set Up Trust Line",
    "marco_before_tl": "☕ Marco: Now you know how to tell real trust lines from fake ones. Let's set up the real trust line – then I can send you your 10 CAFE!",
    "tl_preview_title": "Your New Trust Line",
    "tl_setup_ready": "Set up Trust Line",
    "action_tl_label": "Add Trust Line for CAFE",
    "action_tl_desc": "Sets up a Trust Line for CAFE tokens from Marco's Testnet issuer account. Enables receiving CAFE tokens.",
    "error_no_keypair": "No keypair found – please complete Chapter 1 first.",
    "section_quiz": "Quiz – Test Your Knowledge",
    "q1_question": "Which 3 pieces of information uniquely define a [[Trust Line|trustline]]?",
    "q1_a": "Asset Code + Issuer Address + Limit",
    "q1_a_hint": "Exactly! These three pieces together define a trust line. Without the issuer address, the asset code is not unique.",
    "q1_b": "Public Key + Secret Key + Amount",
    "q1_b_hint": "No – those are keypair components, not trust line elements.",
    "q1_c": "Network + Fee + Memo",
    "q1_c_hint": "No – those are transaction fields, not trust line components.",
    "q2_question": "Why can't a CAFE token from Issuer A be confused with a CAFE token from Issuer B?",
    "q2_a": "Because only one single 'CAFE' token can exist on Stellar",
    "q2_a_hint": "Wrong – anyone can create a token called CAFE. The issuer address makes it unique.",
    "q2_b": "Because the issuer address uniquely identifies the token – same name, different issuers = different tokens",
    "q2_b_hint": "Correct! Only the combination of Asset Code + Issuer Address creates a unique asset on Stellar.",
    "q2_c": "Because different tokens must always have different names",
    "q2_c_hint": "Wrong – tokens can share the same name. The issuer address distinguishes them.",
    "q3_question": "You receive a QR code in a chat message asking you to add a Trust Line. What do you do?",
    "q3_a": "I scan the code right away – it's just a trust line, not real money",
    "q3_a_hint": "Watch out! Trust lines can be risky too – the token could be worthless or a phishing trap. Always verify first.",
    "q3_b": "I verify the issuer on stellar.expert and the anchor's official website first",
    "q3_b_hint": "Exactly right! Never trust a QR code blindly – always verify the issuer address and the domain.",
    "q3_c": "I ask a friend whether they know the QR code",
    "q3_c_hint": "Better than trusting blindly – but the most reliable method is direct verification on stellar.expert.",
    "section_receive": "Receive CAFE Tokens",
    "marco_send": "☕ Marco: Now that you've set up the trust line, I can finally send you the 10 CAFE tokens! That's exactly what the trust line was needed for.",
    "lumio_receive": "Ah, I understand! Without the trust line, Stellar would have simply rejected the tokens – no matter who sent them?",
    "marco_confirm": "☕ Marco: Exactly! The network would have responded: 'This account does not accept CAFE.' The trust line is your explicit permission.",
    "action_receive_label": "Receive 10 CAFE from Marco",
    "action_receive_desc": "Marco sends 10 CAFE tokens to your account. This works only because you set up the trust line in the previous scene.",
    "learning_1": "An Asset is any token issued on Stellar – from XLM to CAFE",
    "learning_2": "An Anchor connects real-world value (e.g. coffee, money) with Stellar tokens",
    "learning_3": "A Trust Line consists of: Asset Code + Issuer Address + Limit",
    "learning_4": "Only Asset Code + Issuer Address together uniquely identify a token",
    "learning_5": "Fake QR codes & phishing domains: always verify the issuer on stellar.expert and the official anchor website"
  },
  "chapter4": {
    "title": "The Villain",
    "section_intro": "Step 1 – A Suspicious Message",
    "section_social_eng": "Step 2 – Social Engineering",
    "section_choice1": "Step 3 – Your First Decision",
    "section_choice2": "Step 4 – The Phishing Trap",
    "section_simulator": "Step 5 – Spot the Scam",
    "section_emergency": "Step 6 – What To Do in an Emergency",
    "section_quiz": "Mini Quiz",
    "intro_narrator1": "Lumio just received their first CAFE token and is exploring the Stellar world. Then a message arrives from a stranger...",
    "intro_narrator2": "Sometimes the most dangerous enemies aren't hackers with code – they're people who exploit your trust.",
    "scammer_name": "CryptoHelper99",
    "scammer_subtitle": "Unverified contact",
    "unverified": "Unverified",
    "scam_msg1": "Hello! I'm from official Stellar Support. We've detected unusual activity on your account. 🚨",
    "scam_msg2": "To protect your account, we need to verify your identity. Please send us your Secret Key.",
    "scam_msg3": "This is completely safe and confidential. We only need it for 30 seconds for verification.",
    "scam_msg_cta": "What should I do now?",
    "social_eng_label": "Understanding the threat",
    "social_eng_title": "What is Social Engineering?",
    "social_eng_desc": "Attackers use psychology instead of technology. They play with emotions like fear, greed, or trust to manipulate you.",
    "tactic1_title": "Pretending authority",
    "tactic1_text": "\"I'm from official Support\" – real services NEVER ask for your Secret Key.",
    "tactic2_title": "Creating time pressure",
    "tactic2_text": "\"Only 30 seconds!\" – Urgency prevents you from thinking clearly.",
    "tactic3_title": "Promising rewards",
    "tactic3_text": "\"Double XLM back!\" – If it sounds too good to be true, it usually is.",
    "tactic4_title": "Building trust",
    "tactic4_text": "Mixing small truths to then place a big lie.",
    "social_eng_cta": "I understand the danger →",
    "choice1_question": "CryptoHelper99 is asking for your Secret Key. What do you do?",
    "choice1_yes": "I'll send the Secret Key – Support needs it after all.",
    "choice1_yes_hint": "Never! Real support NEVER asks for the Secret Key.",
    "choice1_no": "I ignore the message – no legitimate support asks for that.",
    "choice1_no_hint": "Correct! No Stellar service or support will ever ask for your Secret Key.",
    "choice1_ask": "I ask whether this is really necessary.",
    "choice1_ask_hint": "Better than sharing, but the right step is to simply ignore and report.",
    "choice1_hint2": "Remember: whoever has your Secret Key has EVERYTHING. There is never a reason to share it.",
    "drain_title": "Account drained!",
    "drain_text": "CryptoHelper99 used your Secret Key to transfer all XLM and tokens in seconds. Your account is empty.",
    "retry": "Try again",
    "choice_correct_cta": "Continue",
    "after_choice1_1": "Well done! The Secret Key is like a master key to your house. Give it away and anyone can get in.",
    "after_choice1_2": "Real Stellar support, wallets, or apps will NEVER ask for your Secret Key. That's an absolute red flag!",
    "choice2_question": "CryptoHelper99 now sends you a link: 'stellar-support-verify.net'. What do you do?",
    "choice2_click": "I click the link – I want to see what's behind it.",
    "choice2_click_hint": "Phishing sites often look deceptively real and steal your data.",
    "choice2_ignore": "I ignore the link and report the account as a scam.",
    "choice2_ignore_hint": "Perfect! Always ignore and report unknown links from strangers.",
    "choice2_reply": "I reply and ask why the link is needed.",
    "choice2_reply_hint": "Any interaction tells the scammer your account is active – better to ignore completely.",
    "choice2_hint2": "Phishing URLs look legitimate, but the domain is always wrong. Stellar only uses stellar.org.",
    "mini_sim_msg1": "Congratulations! You've been selected for an exclusive XLM airdrop! 🎉",
    "mini_sim_msg2": "To claim your 500 XLM, just enter your Secret Key to verify your wallet.",
    "mini_sim_msg3": "Offer valid for 10 minutes only! Hurry up!",
    "mini_sim_prompt": "Your response",
    "mini_sim_opt_share": "I enter my Secret Key.",
    "mini_sim_opt_ignore": "I ignore the message.",
    "mini_sim_opt_report": "I report the message as fraud.",
    "mini_sim_scam_result": "⚠️ You would have been scammed!",
    "mini_sim_scam_desc": "A real airdrop never needs your Secret Key. With this key, the attacker would have immediate full access to your account.",
    "mini_sim_safe_result": "✓ Well spotted!",
    "mini_sim_safe_desc": "No legitimate service needs your Secret Key. Airdrops work via your Public Key – not the Secret Key.",
    "mini_sim_cta": "Continue",
    "emergency_label": "If it has happened",
    "emergency_title": "Emergency plan: Secret Key compromised",
    "emergency_desc": "If you think your Secret Key was stolen or shared, act immediately:",
    "emergency1": "Act immediately: Every minute counts – open your wallet app.",
    "emergency2": "Transfer all funds: Send XLM and all tokens immediately to a new, secure address.",
    "emergency3": "Remove trusted addresses: Review all set trust lines.",
    "emergency4": "Create a new keypair: Generate a completely new keypair and never use the old one again.",
    "emergency5": "Report it: Inform the community and report scam addresses on relevant platforms.",
    "emergency_cta": "Understood – continue",
    "quiz1_q": "What does a legitimate support agent NEVER do?",
    "quiz1_a1": "Contact you via chat",
    "quiz1_a1_hint": "That alone is no problem – many services have live chat.",
    "quiz1_a2": "Ask for your Secret Key",
    "quiz1_a2_hint": "Correct! That's the ultimate red flag. Real support never needs your Secret Key.",
    "quiz1_a3": "Explain how Stellar works",
    "quiz1_a3_hint": "Legitimate help can explain things – that's fine.",
    "quiz2_q": "You receive a message: 'Send 1 XLM and get 10 back'. What is this?",
    "quiz2_a1": "A legitimate offer from a verified provider",
    "quiz2_a1_hint": "Such offers are never legitimate, no matter who makes them.",
    "quiz2_a2": "A testnet exercise",
    "quiz2_a2_hint": "No – this sounds like a real scam attempt.",
    "quiz2_a3": "A classic scam – too good to be true",
    "quiz2_a3_hint": "Exactly! This pattern is one of the oldest crypto scams and unfortunately still works.",
    "quiz3_q": "Your Secret Key may have been stolen. What is the FIRST step?",
    "quiz3_a1": "Immediately transfer all funds to a new account",
    "quiz3_a1_hint": "Correct! Every second counts – save what can be saved first.",
    "quiz3_a2": "Ask the attacker to return the funds",
    "quiz3_a2_hint": "That never works – blockchain transactions are irreversible.",
    "quiz3_a3": "Call Stellar Support to freeze the account",
    "quiz3_a3_hint": "Blockchain accounts cannot be frozen – that's a myth.",
    "learning1": "Social engineering uses psychology, not technology – trust, fear, time pressure",
    "learning2": "No service, support, or app ever asks for your Secret Key",
    "learning3": "Ignore and report unknown links – phishing often looks deceptively real",
    "learning4": "Was your Secret Key compromised? Transfer all funds immediately!",
    "learning5": "Offers that seem too good (10x back, free airdrop) are always scams"
  },
  "chapter5": {
    "title": "Lumio's Mission",
    "section_intro": "Introduction",
    "section_recap": "What You've Learned",
    "section_usecases": "Stellar in the World",
    "section_action": "Your Mission",
    "section_quiz": "Final Quiz",
    "section_cert": "Certificate",
    "intro_narrator1": "Congratulations – you've mastered all four chapters and now know how Stellar accounts, payments, tokens, and security work.",
    "intro_narrator2": "Lumio has one final mission for you...",
    "lumio_intro1": "You've learned so much! Now comes the final test: Can you help a real person understand Stellar?",
    "lumio_intro2": "Your friend Lena has heard about Stellar and wants to receive her first payment. Are you in?",
    "lena_age": "Curious Beginner",
    "lena_greeting": "Hey! I heard you know a lot about Stellar?",
    "lena_request": "Can you send me 1 XLM? I want to see how it works!",
    "lumio_accept": "Sure, let's do it!",
    "recap_label": "Review",
    "recap_title": "5 Lessons at a Glance",
    "lesson1_title": "Your Wallet",
    "lesson1_text": "Public Key = account number, Secret Key = PIN. Your key pair protects all your funds.",
    "lesson2_title": "Transactions",
    "lesson2_text": "Payments on Stellar are fast (3–5 sec), cheap (<0.01 XLM), and irreversible.",
    "lesson3_title": "Trustlines",
    "lesson3_text": "Want to hold a token (e.g., USDC)? You must first set a trustline to the issuer.",
    "lesson4_title": "Anchors",
    "lesson4_text": "Anchors connect Stellar to the real world – they enable e.g. Euro tokens on the blockchain.",
    "lesson5_title": "Security",
    "lesson5_text": "Your Secret Key is sacred. No service, no support, no app will ever ask for it.",
    "recap_cta": "Got it! Continue →",
    "usecases_label": "Practice",
    "usecases_title": "Stellar in the Real World",
    "usecases_desc": "Stellar is used worldwide – from individuals to financial institutions.",
    "usecase1_title": "Cross-Border Remittances",
    "usecase1_text": "Migrants send money home – in seconds, for cents instead of 5–10% bank fees.",
    "usecase2_title": "Micro-Payments for Content",
    "usecase2_text": "Creators receive tiny payments per stream or article – impossible with traditional systems.",
    "usecase3_title": "Stablecoins & DeFi",
    "usecase3_text": "USDC, EURC, and other stablecoins run on Stellar – stable values at blockchain speed.",
    "usecases_cta": "Got it! Now the mission →",
    "marco_action1": "Okay, you know what to do. Send Lena 1 XLM – this is her first Stellar experience!",
    "marco_action2": "Use your testnet account for the transfer.",
    "action_label": "Send 1 XLM to Lena",
    "action_desc": "Send Lena her first Stellar Lumens – she's already waiting!",
    "action_error": "No keypair available – please create a testnet account first.",
    "after_action": "Perfect! Lena received the payment. You just enabled someone's first crypto experience – that's Stellar!",
    "quiz_wrong": "Wrong",
    "quiz_retry": "Try Again",
    "quiz_correct_cta": "Continue",
    "quiz1_q": "What is a Public Key on Stellar?",
    "quiz1_a1": "A password that must be kept secret",
    "quiz1_a1_hint": "Not quite – that's the function of the Secret Key.",
    "quiz1_a2": "The public address of your account, like an IBAN",
    "quiz1_a2_hint": "Exactly! You can share your Public Key freely – it's your receiving address.",
    "quiz1_a3": "A special token for transactions",
    "quiz1_a3_hint": "No – XLM is the token, the Public Key is your address.",
    "quiz1_explanation": "The Public Key is your public address – comparable to an account number or IBAN. You can share it freely. The Secret Key, however, must remain secret.",
    "quiz1_hint2": "Hint: Think of the classic banking system – what do you share to receive money?",
    "quiz2_q": "What is a Trustline?",
    "quiz2_a1": "A special type of payment",
    "quiz2_a1_hint": "No – a trustline is not a payment transaction.",
    "quiz2_a2": "A permission to hold a specific token",
    "quiz2_a2_hint": "Exactly! Without a trustline, your account cannot receive or hold that token.",
    "quiz2_a3": "A contract between two wallets",
    "quiz2_a3_hint": "No – a trustline is a one-sided permission from your account for a token.",
    "quiz2_explanation": "A trustline is an explicit permission you must set for every token (except XLM). Only then can your account hold and receive that token.",
    "quiz2_hint2": "Hint: 'Trust' means you trust the token issuer.",
    "quiz3_q": "How long does a Stellar transaction normally take?",
    "quiz3_a1": "10–60 minutes, like Bitcoin",
    "quiz3_a1_hint": "That's Bitcoin speed – Stellar is much faster.",
    "quiz3_a2": "1–2 days, like a SEPA transfer",
    "quiz3_a2_hint": "No – Stellar is much faster than traditional banks.",
    "quiz3_a3": "3–5 seconds",
    "quiz3_a3_hint": "Correct! Stellar confirms transactions in about 3–5 seconds – a huge advantage over Bitcoin or banks.",
    "quiz3_explanation": "Stellar uses the Stellar Consensus Protocol (SCP), which finalizes transactions in 3–5 seconds. This makes it ideal for everyday payments.",
    "quiz3_hint2": "Hint: Stellar was specifically designed for fast payments – think real-time banking.",
    "quiz4_q": "What does an Anchor do on Stellar?",
    "quiz4_a1": "It secures the network like a validator",
    "quiz4_a1_hint": "No – that's the job of validators in the network.",
    "quiz4_a2": "It creates new Stellar accounts for users",
    "quiz4_a2_hint": "No – accounts can be created by anyone, that's not the anchor function.",
    "quiz4_a3": "It connects fiat currencies (e.g., EUR) to the Stellar blockchain",
    "quiz4_a3_hint": "Exactly! Anchors are bridges between the real financial world and Stellar – they issue tokens like EURC.",
    "quiz4_explanation": "An anchor is a regulated financial institution that converts fiat currencies (like EUR or USD) into Stellar tokens. This allows real currencies to be used on the blockchain.",
    "quiz4_hint2": "Hint: Think of a 'bridge' between traditional banking and blockchain.",
    "quiz5_q": "Someone contacts you claiming to be from 'Stellar Support'. They need your Secret Key to resolve a 'security issue'. What do you do?",
    "quiz5_a1": "Send the key, since support staff are trustworthy",
    "quiz5_a1_hint": "That would be a mistake – no legitimate support asks for the Secret Key.",
    "quiz5_a2": "Immediately ignore and block the contact – it's a scam",
    "quiz5_a2_hint": "Correct! There is no 'Stellar Support' that would need your Secret Key. This is a classic phishing attempt.",
    "quiz5_a3": "Send the key in an encrypted message",
    "quiz5_a3_hint": "No matter how secure the transmission – you never share your Secret Key.",
    "quiz5_explanation": "No legitimate service, authority, or support ever asks for your Secret Key. Whoever knows it controls your account completely. Block and report is the only right answer.",
    "quiz5_hint2": "Hint: Imagine someone asking for your online banking PIN over the phone.",
    "cert_title": "Basic Certificate",
    "cert_tagline": "Stellar Account Manager – Course Completed!",
    "cert_public_key_label": "Testnet Address",
    "cert_date_label": "Completed on",
    "cert_chapters_label": "Completed Chapters",
    "cert_xp_label": "Total XP",
    "cert_print_btn": "Print Certificate",
    "cert_home_btn": "Go to Home",
    "learning1": "Stellar enables global payments in seconds for cents",
    "learning2": "Trustlines are the foundation for tokens on Stellar",
    "learning3": "Anchors connect fiat currencies to the blockchain",
    "learning4": "Never share your Secret Key – not even with 'support'",
    "learning5": "Stellar is used worldwide – from remittances to DeFi"
  },
  "hud": {
    "chapter_short": "Ch."
  },
  "action": {
    "already_done": "Already done",
    "continue_with_existing": "Continue",
    "redo": "Run again?",
    "redo_keypair_warning": "Warning: A new keypair will overwrite the old one. Your existing Testnet account will be lost.",
    "redo_cancel": "Cancel",
    "redo_confirm": "Create new anyway"
  },
  "payment": {
    "title": "Send Payment",
    "from_label": "From (your account)",
    "to_label": "To (recipient)",
    "to_placeholder": "G... (enter Public Key)",
    "amount_label": "Amount (XLM)",
    "memo_label": "Memo (optional)",
    "memo_hint": "Tip: Exchanges often require a Memo for identification",
    "error_secret_key": "That is a Secret Key! A Secret Key is never a recipient address. Never enter your Secret Key anywhere.",
    "error_invalid_key": "Not a valid Stellar Public Key. Public Keys start with 'G' and are 56 characters long.",
    "error_own_key": "That is your own Public Key. You cannot send a payment to yourself.",
    "cancel": "Cancel",
    "send": "Send"
  },
  "chapter6": {
    "title": "The Accountant",
    "section_intro": "Marco's Chaos",
    "section_explain": "What is a Muxed Account?",
    "section_payroll": "Payroll Accounting",
    "section_usecases": "More Applications",
    "section_decision": "How do you organize it?",
    "section_action": "Send Muxed Payment",
    "section_quiz": "Mini Quiz",
    "intro_narrator1": "Marco's coffee shop is growing. Dozens of payments arrive on his Stellar account every day – but who paid what and when?",
    "intro_narrator2": "His accountant Sofia arrives with a pile of unanswered questions...",
    "marco_chaos1": "I can't keep track anymore! Every day new payments come in, but they all look identical on the blockchain.",
    "marco_chaos2": "How am I supposed to know if that's from Anna, Ben, or a customer?",
    "sofia_frustrated1": "Marco, I can't do proper payroll like this. Every employee payment looks identical on the blockchain!",
    "sofia_frustrated2": "I need a reliable way to uniquely identify each payment – without asking every time.",
    "lumio_fix": "I know exactly how to fix this. Have you heard of Muxed Accounts?",
    "explain_label": "Concept",
    "explain_title": "Muxed Accounts Explained",
    "explain_desc": "A Muxed Account is not a separate wallet – it's the same Stellar address, but with a virtual ID attached.",
    "explain_base_label": "Marco's Base Address (G…)",
    "explain_muxed_label": "Virtual M-Addresses",
    "explain_anna": "Barista",
    "explain_ben": "Roaster",
    "explain_clara": "Accounting",
    "explain_flow_desc": "All payments land on the same G-address – the embedded ID reveals who received what.",
    "explain_memo_vs_title": "Muxed Account vs. Memo",
    "explain_memo_desc": "Free text field, not standardized. Can be forgotten or entered incorrectly.",
    "explain_muxed_desc": "Structured numeric ID directly in the address. Reliable for automated accounting.",
    "explain_cta": "Got it! To the use case →",
    "payroll_label": "Use Case",
    "payroll_title": "Payroll with Muxed Accounts",
    "payroll_step1": "The company has ONE Stellar account – cheaper and easier to manage.",
    "payroll_step2": "Each employee is assigned a unique Muxed ID by the company.",
    "payroll_step3": "Every month, the payroll software sends the salary to the respective M-address.",
    "payroll_step4": "Sofia's accounting software reads the Muxed ID and automatically posts to the correct employee.",
    "payroll_step5": "No manual reconciliation, no guessing, no errors.",
    "payroll_note": "The employee doesn't need to know anything about Muxed Accounts – the company manages that internally.",
    "payroll_cta": "Great! More examples →",
    "usecases_label": "Practice",
    "usecases_title": "More Use Cases",
    "exchange_title": "Crypto Exchanges",
    "exchange_text": "An exchange uses a single Stellar address for all customers. Each customer gets a Muxed ID as their deposit address – no memo needed, no lost deposits.",
    "shop_title": "Online Shops",
    "shop_text": "Each order gets a unique Muxed ID. The payment is automatically matched to the correct order – no manual post-processing.",
    "usecases_cta": "Got it! Now it's my turn →",
    "decision_question": "How should Marco organize his payroll accounting?",
    "decision_a1": "Create a separate Stellar account for each employee",
    "decision_a2": "Use the memo field with employee names",
    "decision_a3": "Muxed Accounts with a unique ID per employee",
    "wrong_a1_title": "Not ideal",
    "wrong_a1_text": "Separate accounts mean more fees, more secret keys to manage, and a higher security risk. This doesn't scale well for a growing business.",
    "wrong_a1_hint2": "Hint: Fewer accounts = less complexity. Is there a solution that works with a single address?",
    "wrong_a2_title": "Not reliable enough",
    "wrong_a2_text": "Memos are not standardized and can be forgotten or entered incorrectly. Automated accounting needs a structured, reliable method.",
    "wrong_a2_hint2": "Hint: Which method encodes the ID directly into the address – without an extra text field?",
    "correct_sofia": "Finally! That's exactly what I needed. With Muxed Accounts I can fully automate payroll accounting!",
    "retry_btn": "Try again",
    "action_label": "Send Muxed Payment",
    "action_desc": "Send 1 XLM to a Muxed address (M-address) – base address + ID 42.",
    "action_maddress_label": "Target M-Address",
    "action_success": "On the blockchain this looks like a normal payment – but ID 42 is embedded!",
    "action_error": "No keypair available – please create a testnet account first.",
    "lumio_after_action": "See? The transaction on testnet looks like a regular XLM payment – but the Muxed ID is encoded in the address. Sofia's software would read this automatically.",
    "quiz_wrong": "Wrong",
    "quiz_retry": "Try again",
    "quiz_correct_cta": "Continue",
    "quiz1_q": "What is a Muxed Account on Stellar?",
    "quiz1_a1": "A separate wallet with its own balance",
    "quiz1_a1_hint": "No – a Muxed Account is not a standalone wallet.",
    "quiz1_a2": "A virtual sub-address with numeric ID, bound to a base G-address",
    "quiz1_a2_hint": "Exactly! The M-address points to the same account – just with an additional ID for distinction.",
    "quiz1_a3": "A special token account for companies",
    "quiz1_a3_hint": "No – Muxed Accounts work with XLM and all tokens.",
    "quiz1_explanation": "A Muxed Account is not its own wallet – it shares the balance, trustlines, and signers with the base G-account. The M-address only contains an additional numeric ID.",
    "quiz1_hint2": "Hint: Think of a bank account number with an embedded reference number – one account, many IDs.",
    "quiz2_q": "Why are Muxed Accounts better than memos for payroll accounting?",
    "quiz2_a1": "Muxed Accounts are cheaper than memos",
    "quiz2_a1_hint": "No – transaction fees are the same.",
    "quiz2_a2": "Memos are prohibited for business payments",
    "quiz2_a2_hint": "No – memos are allowed, just not ideal for automation.",
    "quiz2_a3": "Muxed IDs are structured and reliable; memos can be missing or wrong",
    "quiz2_a3_hint": "Exactly! The ID is encoded directly in the address – it can't be forgotten or entered incorrectly.",
    "quiz2_explanation": "Memos are free text fields and not standardized. They can be forgotten, entered incorrectly, or intentionally omitted. Muxed IDs are part of the address itself – structured and reliably machine-readable.",
    "quiz2_hint2": "Hint: What happens if an employee simply leaves the memo field empty when making a transfer?",
    "quiz3_q": "Does an employee need their own Stellar wallet to receive a Muxed payment?",
    "quiz3_a1": "No – the employee has their own wallet; the Muxed ID is managed internally by the company",
    "quiz3_a1_hint": "Correct! The Muxed ID is an internal accounting feature – the employee receives on their own regular address.",
    "quiz3_a2": "Yes – each employee needs an M-address as their own wallet",
    "quiz3_a2_hint": "No – M-addresses are not standalone wallets.",
    "quiz3_a3": "No – employees don't need a Stellar account at all",
    "quiz3_a3_hint": "Not quite – employees can have their own Stellar accounts; the Muxed ID is only relevant for the accounting side.",
    "quiz3_explanation": "Muxed IDs are an internal organizational tool of the company. The employee has their own Stellar account. The M-address helps Sofia's software internally assign incoming payments.",
    "quiz3_hint2": "Hint: Muxed Accounts are designed from the company's perspective – not the recipient's.",
    "learning1": "A Muxed Account is a virtual sub-address (M-address) on a Stellar base address",
    "learning2": "Muxed Accounts simplify payroll: one address, many IDs – fully automatable",
    "learning3": "Crypto exchanges and online shops use Muxed Accounts for unique customer assignment",
    "learning4": "Memos can be forgotten – Muxed IDs are encoded in the address and reliable"
  },
  "chapter7": {
    "title": "The Vault",
    "section_intro": "Scene 1 – The Problem of Control",
    "section_explain": "What is Multisignature?",
    "section_family": "Example: Family Savings",
    "section_decision1": "Decision Scene 1",
    "section_company": "Example: Company Vault",
    "section_decision2": "Decision Scene 2",
    "section_usecases": "When Do You Need Multisig?",
    "section_quiz": "Mini Quiz",
    "section_cert": "Advanced Certificate",
    "intro_narrator1": "Marco now has a business partner: Rosa. Together they run a growing company. But there's a problem...",
    "intro_narrator2": "When only one person controls the company wallet, things can go wrong – through loss of trust or lost keys.",
    "marco_problem1": "Rosa, I'm worried. What happens to our money if I lose my secret key?",
    "marco_problem2": "Or what if you can never really trust me because I control everything alone?",
    "rosa_concern": "That's exactly what worries me too, Marco. We need a solution where we're both safe.",
    "lumio_solution": "I know exactly what you need – a vault that only you can open together. That's called Multisignature!",
    "explain_label": "Basics",
    "explain_title": "What is Multisignature?",
    "explain_desc": "Normally a single key controls a wallet. With Multisig you define how many out of how many possible signers must approve a transaction.",
    "explain_1of1_label": "Normal: 1-of-1",
    "explain_1of1_desc": "One key controls everything. Whoever has this key has full access – no protection against misuse or loss.",
    "explain_multisig_label": "Multisig: N-of-M",
    "explain_multisig_desc": "Multiple signers, defined threshold. Only when enough signatures are present will the transaction be executed.",
    "explain_threshold_label": "What is a Threshold?",
    "explain_threshold_desc": "The threshold is the minimum number of signatures required to authorize a transaction. With 2-of-3, any 2 of the 3 signers must sign.",
    "explain_vault_desc": "Imagine a vault with multiple locks – all required keys must be turned simultaneously.",
    "explain_cta": "Show me an example →",
    "family_label": "Example 1",
    "family_title": "Family Savings (2-of-2)",
    "family_desc": "Elena and David set up a shared savings wallet. Both must sign every transaction – maximum security, zero impulse purchases.",
    "family_scenario_title": "Scenario",
    "family_scenario_text": "David wants to buy a new coffee machine. He sends a transaction request – Elena must also sign before the money is deducted. Both have equal control.",
    "family_risk": "Risk: If one parent loses their secret key, the wallet is permanently locked. 2-of-2 means zero fault tolerance – both signatures are always required.",
    "family_cta": "Continue to company example →",
    "d1_question": "Elena has lost her secret key. David still has his. What happens to the 2-of-2 wallet?",
    "d1_a1": "David can access the funds alone since he still has his key",
    "d1_a2": "They can reset the wallet with their email address",
    "d1_a3": "The wallet is permanently inaccessible – both signatures are always required",
    "d1_wrong_a1_title": "Wrong – 2-of-2 has no exceptions",
    "d1_wrong_a1_text": "With a 2-of-2 multisig wallet, BOTH signatures are ALWAYS required. Even if David has his key – without Elena's key no transaction is possible. That is the strength and simultaneously the risk.",
    "d1_wrong_a1_hint2": "Tip: 2-of-2 means the threshold is always 2 – no exceptions, no bypassing.",
    "d1_wrong_a2_title": "Wrong – blockchain has no password reset",
    "d1_wrong_a2_text": "The blockchain has no email recovery, no support and no password reset. The key IS the access – without it there is no way to access the wallet.",
    "d1_wrong_a2_hint2": "Tip: On the blockchain there is no central authority that could reset keys – that is intentional, but comes with responsibility.",
    "d1_correct_lumio": "Exactly! That is the fundamental risk of 2-of-2: if one key is lost, the funds are forever unreachable. That's why secure storage is so important.",
    "company_label": "Example 2",
    "company_title": "Company Vault (2-of-3)",
    "company_desc": "Marco, Rosa and lawyer Dr. Weber are three signers. Any two must sign – security with fault tolerance.",
    "company_scenario_title": "Scenario",
    "company_scenario_text": "Marco wants to pay a supplier → Rosa co-signs → done. Dr. Weber is not needed. If Marco is on vacation, Rosa and Dr. Weber can act together. The company stays operational.",
    "company_risk": "2-of-3 balances security with fault tolerance: even if one signer loses their key, the other two can still act. Only when two keys are lost does the threshold become unreachable.",
    "company_cta": "Choose now →",
    "d2_question": "Marco, Rosa and Dr. Weber run a company with 3 partners. Which multisig setup is correct: majority required, still works if one partner is unreachable?",
    "d2_a1": "1-of-3 – each individual partner can execute transactions alone",
    "d2_a2": "3-of-3 – all three partners must always sign",
    "d2_a3": "2-of-3 – any two of the three partners must sign",
    "d2_wrong_a1_title": "Wrong – 1-of-3 offers no protection",
    "d2_wrong_a1_text": "1-of-3 means that each individual signer could move all funds alone. This offers no protection against fraud, theft or a compromised key – more dangerous than a normal single-key wallet.",
    "d2_wrong_a1_hint2": "Tip: For company funds the threshold must be high enough that no single person can act alone.",
    "d2_wrong_a2_title": "Wrong – 3-of-3 is too inflexible",
    "d2_wrong_a2_text": "3-of-3 sounds secure, but if one partner is sick, traveling or loses their key, the entire company is blocked. Organizations need fault tolerance.",
    "d2_wrong_a2_hint2": "Tip: The solution is a threshold that requires a majority but still works when someone is unreachable.",
    "d2_correct_lumio": "Perfect! 2-of-3 is the most common setup for small organizations – for good reason: majority required, but fault tolerant.",
    "usecases_label": "Use Cases",
    "usecases_title": "When Do You Need Multisig?",
    "usecase1_title": "Company Wallets",
    "usecase1_text": "Multiple partners or executives – no single person can move funds alone.",
    "usecase2_title": "Family Savings",
    "usecase2_text": "Both partners must agree – protects against impulse purchases and gives equal control.",
    "usecase3_title": "DAOs & Community Funds",
    "usecase3_text": "Decentralized organizations manage shared funds without a central trustee.",
    "usecase4_title": "High-Security Personal Wallet",
    "usecase4_text": "You hold 2 keys on separate devices, a trusted partner holds 1 as backup – 2-of-3.",
    "usecase5_title": "Escrow Arrangements",
    "usecase5_text": "Funds are only released when both parties sign – no fraud possible.",
    "usecases_cta": "Continue to quiz →",
    "quiz_wrong": "Not quite right",
    "quiz_retry": "Try again",
    "quiz_correct_cta": "Continue",
    "retry_btn": "Try again",
    "quiz1_q": "What does '2-of-3 Multisig' mean?",
    "quiz1_a1": "Exactly 2 of 3 possible signers must always sign, otherwise nothing happens",
    "quiz1_a2": "Any 2 of the 3 signers must sign a transaction for it to be executed",
    "quiz1_a3": "Two transactions must be confirmed within 3 minutes",
    "quiz1_a1_hint": "Almost! Any 2 of 3 can sign – not always the same two.",
    "quiz1_a2_hint": "Exactly! Any 2 of the 3 signers are enough – that gives flexibility and security.",
    "quiz1_a3_hint": "That's not right – Multisig has nothing to do with time limits.",
    "quiz1_explanation": "With 2-of-3 Multisig, any combination of 2 of the 3 signers can approve the transaction. They don't always have to be the same two – that's the difference from 'fixed' signatures.",
    "quiz1_hint2": "Think of the company vault: Marco+Rosa, Rosa+Weber or Marco+Weber – all three combinations work.",
    "quiz2_q": "Marco, Rosa and Dr. Weber have a 2-of-3 wallet. Rosa loses her key. Can they still access the funds?",
    "quiz2_a1": "No – since one signer has lost their key, the wallet is locked",
    "quiz2_a2": "Yes – Marco and Dr. Weber together reach the threshold of 2",
    "quiz2_a3": "No – all three signers are always required",
    "quiz2_a1_hint": "The threshold is 2, not 3 – Marco and Weber can still act.",
    "quiz2_a2_hint": "Correct! That's exactly the strength of 2-of-3: fault tolerance when one key is lost.",
    "quiz2_a3_hint": "With 2-of-3 only 2 signatures are required, not all 3.",
    "quiz2_explanation": "With 2-of-3 any 2 signatures are sufficient. If Rosa loses her key, Marco and Dr. Weber can still execute all transactions together. That's the difference from 2-of-2.",
    "quiz2_hint2": "Remember: 2-of-3 = one lost signature = still operational. 2-of-2 = one lost signature = permanently locked.",
    "quiz3_q": "Elena and David have a 2-of-2 wallet. Elena loses her key. What happens?",
    "quiz3_a1": "The wallet is permanently locked – both signatures are always required",
    "quiz3_a2": "David can access the funds alone since he still has his key",
    "quiz3_a3": "They can contact Stellar to recover the key",
    "quiz3_a1_hint": "Correct! 2-of-2 has zero fault tolerance – both keys are always required.",
    "quiz3_a2_hint": "With 2-of-2 a single key is not enough – the threshold always remains 2.",
    "quiz3_a3_hint": "Stellar is decentralized – there is no central authority that can reset keys.",
    "quiz3_explanation": "With 2-of-2 both signatures are always required. If one key is lost, there is no way to execute a transaction – the wallet is permanently locked. That's why secure key storage is so critical.",
    "quiz3_hint2": "Remember: 2-of-2 = maximum security, zero fault tolerance. Every key must be stored securely – in multiple physical locations.",
    "quiz4_q": "Why is 1-of-3 Multisig risky for a company fund?",
    "quiz4_a1": "Because the setup is too complicated and confuses employees",
    "quiz4_a2": "Because Stellar only supports 2-of-3 or higher thresholds",
    "quiz4_a3": "Because each individual signer can move all funds alone – no protection against fraud",
    "quiz4_a1_hint": "That's not the reason – the threshold makes the setup risky.",
    "quiz4_a2_hint": "Stellar supports flexible thresholds – that's not the problem.",
    "quiz4_a3_hint": "Exactly! 1-of-3 means no real majority control – anyone can act alone.",
    "quiz4_explanation": "With 1-of-3 each of the three signers can move all funds alone. That's worse than a normal single-key wallet, because three different people are a potential attack target.",
    "quiz4_hint2": "Think of a company fund: you don't want a single employee to be able to initiate transfers alone.",
    "cert_title": "Advanced Certificate",
    "cert_tagline": "You are now a Stellar pro!",
    "cert_public_key_label": "Public Key",
    "cert_date_label": "Completion Date",
    "cert_chapters_label": "Completed Chapters",
    "cert_xp_label": "Total XP",
    "cert_badge1": "Basic Certificate",
    "cert_badge2": "Advanced Certificate",
    "cert_print_btn": "Save Certificate",
    "cert_home_btn": "Go to Home",
    "learning1": "Multisignature requires multiple signatures to execute a transaction",
    "learning2": "2-of-3 provides fault tolerance: one lost key does not lock the wallet",
    "learning3": "Multisig is suitable for companies, families, DAOs and high-security wallets",
    "learning4": "2-of-2 has zero fault tolerance – if one key is lost, the funds are forever unreachable"
  }
}
